{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This paper presents a semi-supervised classification method for classifying unlabeled nodes in graph data. The authors propose a Graph Inference Learning (GIL) framework to learn node labels on graph topology. The node labeling is based of three aspects: 1) node representation to measure the similarity between the centralized subgraph around the unlabeled node and reference node; 2) structure relation that measures the similarity between node attributes; and 3) the reachability between unlabeled query node and reference node.\n\nThe authors propose to use graph convolution to learn the node representation and random work on graph to evaluate the reachability from query node to reference node.\n\nThe presentation of the paper is clear and easy to follow. The idea of the paper seems straightforward and the experimental results seems promising in semi-supervised classification for nodes in graph data.\n\nJust a few concerns on model performance:\n\n1) The node labeling is based on the comparison with reference nodes. Would such method get biased toward major classes in the data, if the data is imbalanced among different classes?\n\n2) This method adopts three different modules for node labeling. It would be helpful if the authors can add some results to show the contribution of the different modules, i.e., what would be the performance if reachability or consistency of local graph topology structure is not considered in the classification?\n\nOne typo: in Table 1, it should be \"Label rate\"."}