{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The main goal of this work is to assess the effect of the introduction of two human vision-inspired features on large scale (ImageNet) image recognition.  Specifically, their contribution to the robustness of said recognition. These features are namely an explicit episodic  cache memory and a shape bias. \nOverall a well-organized work, with a very well written paper and a clear incremental methodology (stated goals, experimental settings, derived conclusions). Concepts are well defined and gradually introduced.\n\nThe authors have translated the to be assessed visual cognition features into a recognition model implemented as a deep neural net. \nWork uses known/pre-trained deep neural networks (ResNet-50, AlexNet) to estimate their effect on robustness of the recognition. \nTwo types of perturbations were therefore input to the model: Natural and adversarial. \n\nAdversarial perturbations are added to model inputs  and robustness to them is estimated while using the cache memory feature. Three different threat models are compared: white-box (attacker has full knowledge of the backbone model and the items stored), gray-box (attacker has full knowledge of only the backbone model), and black-box attacks (No knowledge of either) (as in Dubey et al.(2019)). Reported results also compare different ResNet-50 layer use (fc, avg pool, layer4) in the three scenarios.\nVarious design choices for the memory are explored. Three memory design variables are used: Retrieval method, cache size & dimensionality.\nObtained results show scenarios that explicit that cache memory improves the adversarial robustness of image recognition models at the ImageNet scale.  Reported results also show that caching, does not improve the robustness of classifiers against natural perturbations.\n\nNatural perturbations were therefore tested on the ImageNet-C benchmark dataset (created by Hendrycks& Dietterich for this type of perturbations). These consisted in noise, blur, weather and digital perturbations each being represented by 4 different varieties except noise that had three for a total of 15 perturbations (with 5 severity levels for each) allowing for comparison of robustness against this type of perturbations (for example blur vs noise) and within same perturbation type (called variety here: Gauss, shot or  impulse for noise for example).  shape bias is implemented by using Shape-ResNet-50 network to estimate its effect on robustness to tested natural perturbations. \nReported results confirm a beneficial effect and suggest a synergistic effect,  on robustness of the recognition model under natural (as sought) but also partially adversarial perturbations when cache in used to.\n\nOnly would request few clarifications that may be useful:\n      - Regarding the large similarity of the reported results in Figure 2 (Accuracy of ResNet-50 under the 3 scenarios) and Figure 3 (Accuracy of Shape-ResNet-50 under the 3 scenarios).\n    - In Table 3, although some number rounding must have r, all results are identical (ResNet-50 and with cache(texture) except for Shot noise perturbation, Shape-ResNet-50 and with cache(shape))."}