{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper outlines a model for generating quantized multi-voice music, utilizing lots of prior information about the structure of western music scores to structure the model. It addresses the question of modeling long term dependencies in the data by hierarchically structuring the model to produce measures, voices, notes and chords. The authors employ a lot of domain knowledge in constructing their data representation (separate modeling of ties, splitting notes into tied notes, durations as a product of exponentiated primes, winthin-beat positioning signal, normalizing duration to be 2 per a bar). These biases are well-aligned to the classical music datasets they consider, and the quality of their generated samples is quite high qualitatively. \n\nHowever, the paper itself has some serious shortcomings that make of limited use to the ICLR community, and make me suggest that it should not be accepted unless they are addressed. \n\n(1) There is a serious lack of quantitative evaluation and comparison. A domain expert could qualitatively see that the model represents advancement for this type of data, but the paper gives no evidence to support this. No baseline models are presented to show the relative quality of the work. Beating a strong baseline, such as the MusicTransformer model (Huang et al.) trained on the same note/duration representation could potentially motivate the need for hierarchy at the level of bars/voices etc. Also, no ablation studies are given to show what are the key elements in achieving performance. The only quantitative results are from a listener study of absolute quality vs. the training data which is an uncalibrated measure and of limited use. \n\n(2) The paper needs rewriting. The paper does not clearly motivate the problem, make claims about the relative advances, or support those claims. Certain important sections (abstract, discussion/conclusion) are very scarce or almost missing, while the method section is overly verbose on certain details (that can be moved to the appendix) and lacking in important details (such as a more concise and clear description of how the model fits together, and a more detailed description of /training/sampling procedure (an algorithm table could help a lot)). For example it is mentioned in passing that multi-level gibbs sampling is performed, but the exact procedure is not immediately obvious in such a hierarchical model. \n\nMinor comment:\nThe writing should be proofread, should remove some of the more questionable prose such as the first sentence \"Music, largely, is a form of art with no tangible existence\" "}