{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors consider the general problem of \"structure\" in datasets--particularly, what are the features of datasets that govern the learning dynamics of neural networks trained to classify that data.  They approach this problem by looking at combinations of [iid gaussian, structure] inputs and [teacher, latent] tasks (for particular choices of \"teacher\", \"latent\", and \"structure).  Finally, they identify that \"structure\" in the input space, and a notion of \"latent\"-ness in the task seem crucial for a synthetic dataset to recapitulate the learning dynamics of a real-world dataset.\n\nThe experiments, exposition, and motivation are all exceedingly clear.  My only reservations are about the scope of the experimentation / strength of conclusions of the paper for generally structure data.\n\nThus, I suggest a Weak Reject of this paper (though I would likely increase my rating to Weak Accept given my comments below).\n\nThe primary weakness of this paper is the over-reliance on the MNIST dataset, which is very nearly linearly separable.  Thus, I strongly worry that any notions of latentness that work for MNIST might not transfer at all to more complicated data regimes---i.e., while I believe the authors have identified and patched an interesting gap between the learning dynamics of iid data and MNIST, I'm not sure if there still isn't a gap between something like MNIST and, say, CIFAR-10.  I would raise my score to an accept if the authors carried out their analysis on (at least) CIFAR-10 as well, and even higher if the authors greatly expanded their experiments."}