{"title": "Application of GCN for overlapping community detection", "review": "This paper presents an overlapping community detection method. The idea is to use a graph neural network (namely, the graph convolutional network) with node embeddings constrained to be non-negative. The non-negative embeddings helps to learn the community membership of each node (and each node can belong to multiple communities). \n\nThe idea is natural, though not novel. The only main novelty, as compared to various other recently proposed graph embedding approaches, lies in making the node embeddings non-negative. Rest of the pieces are fairly standard, including the link functions, such as Bernoulli-Poisson.  Therefore the paper is quite thin in technical novelty.\n\nIn addition to the limited technical novelty, I have a few other concerns as well, including some on the experimental evaluation:\n\n- Real-valued node embeddings obtained from shallow/deep graph embedding methods can be used with *overlapping* versions of k-means. This can be a solid baseline.\n\n- The paper relies on subsampling the edges and non-edges to speed-up optimization. However, the encode still seems to use the entire adjacency matrix. If that is not the case, please clarify.\n\n- The reported results are only on overlapping community detection. Most of the shallow/deep graph embedding methods can also be used for link prediction task (many of the recent paper report such results). It will be nice to provide results on this task.  \n\n- There has been some recent work on using deep generative models for overlapping community detection with node side information. For example, see \"Deep Generative Models for Relational Data with Side Information\" (Hu et al, 2017). Interestingly, they too use Bernoulli-Poisson link (but not GCN).\n\n- None of the baselines are deep learning methods. As I pointed out, one can use real-valued embeddings from such methods with overlapping k-means (or other overlapping clustering methods). Link-prediction results can also be compared.\n\nIn summary, I think the paper lacks both in terms of technical novelty as well as experimental evaluation and therefore doesn't seem to be ready. I would encourage the authors to consider the suggestions above.", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}