{"title": "The problem considered in this paper is interesting. However, there are quite a few fundamental errors about Riemannian optimization. Therefore, I donot think this paper can be published at this stage.", "review": "This paper considers an optimization problem defined on the intersection of multiple manifolds and the intersection is not a manifold. An optimization algorithm is proposed and its convergence analysis is given. An experiment of neural network with batch normalizatiion is used to demonstrate the performance of the algorithm.\n\nThe problem considered in this paper is interesting. However, there are quite a few fundamental errors about Riemannian optimization. In addition, the convergence analysis is not complete. See more details below. Therefore, I donot think this paper can be published at this stage.\n\n*) P2, Section 2.1, line 2: The statement \"A manifold is a subspace of R^n$ is not true in general.\n*) P2, Section 2.1, line 7: The statement \"manifold is not a linear space\" is not true in general. A manifold can be a linear space, such as the vector space R^n.\n*) P2, Section 2.1, below (2): The statement \"Riemannian gradient is the orthogonal projection of gradient \\nabla f(x) ...\" is not true in general.\n*) P3, (3) and (4): what is the definition of $h_k^{(1)}$ and $h_k^{(2)}$. Are they arbitrary or the ones given on Page 4?\n*) P4, Theorem 2.3: the iterates {x_k} converges in the sense that \\|gradf(x_k)\\| goes to 0. Does {x_k} go to the intersection of the two manifolds \\mathcal{M}_1 and \\mathcal{M}_2? To complete the proofs, the author may need to show that \\|gradf(y_k)\\| goes to 0 and {x_k} and {y_k} have the same limit.\n*) P5, the grassmann manifold with p = 1: G(1, n), is called projective space, and the Stiefel manifold with p = 1: St(n, 1) is called the unit sphere.\n*) P6, the discussion of the intersection of G(1, n) and St(n, 1) does not make sense to me. G(1, n) is a quotient manifold, which is not a submanifold of R^n. Given a quotient manifold, the typical way in optimization framework is to choose representation of the quotient manifold. Fortunately, the projective space has a global orthogonal section, which is the unit sphere. In other words, G(1, n) is diffemorphisic to the unit sphere St(n, 1), and even can be isometric if appropriate Riemannian metrics are used on G(1, n) and St(n, 1). Therefore, I don't understand the notion of the intersection of G(1, n) and St(n, 1).\n\n\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}