{"title": "So isolated from the similar works on GANs", "review": "- There have been works on this before in the GAN literature, they have not been even cited, let alone being compared to in the experiments. Seminal examples include Donahue et al., ICLR 2018 \"Semantically decomposing the latent spaces of generative adversarial networks\", and (a bit less starkly in terms of the alignment with the goals of this paper): Huang et al., 2017 \"Stacked generative adversarial networks\". \n\n- In general, comparisons to state-of-the-art (or to other) algorithms are missing.\n\n- Is the assumptions of pre-trained components viable with image, and not text, data? Please elaborate\n\n- The related work section is missing out on dozens of  works, those on disentanglement or interpretability; what is the point then of making a related work section in the first place if only one single example of an algorithm in each broad topic is mentioned? If so, I would suggest mentioning this single example prior to the discussing the topic without a related work section, or (apparently the better option) to do a related work section with a rigorous coverage. Examples of some related works on disentanglement and interpretability: \nHiggins et al., ICLR 2017 \"beta-VAE\" - Kim & Mnih, ICML 2018 \"Disentangling by factorising\" - Adel et al., ICML 2018 \"Discovering interpretable representations for both deep generative and discriminative models\" - Chen et al., NIPS 2017 \"InfoGAN: Interpretable representation learning by information maximizing generative adversarial nets\", etc.\n\n- The advantages promised in Section 1 are a little bit too presumptuous. Too many idealistic assumptions are need in order for these advantages to hold. For instance, extensibility has been mentioned as an advantage in Section 1 and in the abstract, and that has not been capitalised on, or confirmed in the experiments, or from this point onwards. \n\n- It will be interesting to see what happens with rather real-world cases like occlusion, etc\n\n- Writing has room for improvements, in terms of both the flow and also grammar, etc. There are a few typos. ", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}