{"title": "Some concerns on experiments and written style", "review": "The paper proposes to use a simple tri-diagonal matrix to reduce the variance of stochastic gradient and provide a better generalization property. Such a variant is shown to be equivalent to applying GD on smoothed objective function. Theoretical results show a convergence rate and variance reduction. Various experiments are done in different settings.  I have following comments:\n\n1) In section 2, it is stated that \"This viscosity solution u(w, t) makes f(w) more convex by bringing down the local maxima while retaining the wide minima.\" Besides illustrating such a point on some nicely constructed function f, is there any theory or analysis supporting this statement? Or is there any intuition behind it? In the abstract and Section 1, how to define a function is \"more convex\"? This is one of the fountains of the paper, it worths to spend one or two paragraphs to explain it, or at least introduce some references here. The current statement is not formed in a rigorous way.\n\n2) The main advantages of proposed method that the paper claims are, reduce the variance and improve the generalization accuracy. However, there are few comparisons with other existed methods, besides numerical section. Such comparisons or analysis could help readers understand the difference and novelty.\n\n3) The proof seems fine. Propositions 1-4 try to analyze the convergence rate, which are common techniques in other variance reduction papers on SGD. Propositions 5-9 rely on some nice properties of matrix A_\\sigma and show it can help to reduce the variance. Typos:\nPage 11, \"Proof of Proposition 1\", there is a missing \"-\" in \\nabla_w u(w, t), also in the next equation.\nPage 13, \"Proof of Proposition 6, d = A_\\sigma g\". \n\n4) The proposed method strongly relies on the choice of \\sigma, but discussion on how to choose the value for \\sigma is rare. From Proposition 8, the upper bound on reduced variance is a quadratic function on \\sigma, so it is better to discuss more on it or have some experiments on sensitivity analysis. In Section 4, \\sigma varies (1.0, 3.0, etc) in different experiments, but again there are no explanations.\n\n5) Numerical results in Section 4.3 is not strong enough to support the advantage of the proposed method. It is hard to observe \"visibly less noisy\" in both Figure 8 and 9. Better ways of illustration might be considered.\n\n6) The paper is not nicely written thus cannot be easily read. It seems to be cut and pasted from another version in a short time. Some titles of subsections is missing. The font size is not fixed in the whole paper.\n\nThe above concerns prevents me to give a higher rating at this time.\n\nSummary\nquality: ok\nclarity: good\noriginality: nice\nsignificance: good", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}