{"title": "The main input of this paper is to combine Information Direct Sampling and Distributional Reinforcement Learning for handling heteroscedasticity of noise in Reinforcement Learning.", "review": "This paper investigates sophistical exploration approaches for reinforcement learning. Motivated by the fact that most of bandit algorithms do not handle heteroscedasticity of noise, the authors built on Information Direct Sampling and on Distributional Reinforcement Learning to propose a new exploration algorithm family. Two versions of the exploration strategy are evaluated against the state-of-the-art on Atari games: DQN-IDS for homoscedatic noise and C51-IDS for heteroscedastic noise. \n\nThe paper is well-written. The background section provides the clues to understand the approach. In IDS, the selected action is the one that minimizes the ratio between a squared conservative estimate of the regret and the information gain. Following (Ktischner and Krause 2018), the authors propose to use \\log(1+\\sigma^2_t(a)/\\rho^2(a)) as the information gain function, which corresponds to a Gaussian prior, where \\sigma^2_t is the variance of the parametric estimate of E[R(a)] and \\rho^2(a) is the variance of R(a). \\sigma^2_t is evaluated by bootstrap (Boostrapped DQN). Where the paper becomes very interesting is that recent works on distributional RL allow to evaluate \\rho^2(a). This is the main input of this paper: combining two recent approaches for handling heteroscedasticity of noise in Reinforcement Learning.\n\nMajor concern:\nWhile the approach is appealing for handling heteroscedastic noise, the use of a normalized variance (eq 9) and a lower bound of variance (page 7) reveal that the approach needs some tuning which is not theoretically founded. \nThis is problematic since in reinforcement learning, the environment is usually assumed to be unknown. What are the results when the lower bound of the variance is not used? When the variance of Z(a) is low, the variance of the parametric estimate should be low also. It is not the case?\n\n\nMinor concerns:\n\nThe color codes of Figure 1 are unclear. The color of curves in subfigures (b) (c) (d) corresponds to the color code of IDS.\n\nThe way in which \\rho^2(s,a) is computed in algorithm 1 is not precisely described. In particular page 6, the equation \\rho^2(s,a)=Var(Z_k(s,a)) raises some questions: Is \\rho evaluated for a particular bootstrap k or is \\rho is averaged over the K bootstraps ?\n_____________________________________________________________________________________________________________________________________________\n\nI read the answers of authors. I increased my rating.\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}