{"title": "A well written paper with a simple, yet powerfull, idea that needs further analysis", "review": "The paper describes an imitation reinforcement learning approach where\nthe primitive actions of the agent are augmented with the most common\nsequences of actions perform by experts. It is experimentally shown\nhow this simple change has clear improvements in the performance of\nthe system in Atari games. In practice, the authors double the number\nof primitive actions with the most frequent double actions perform by\nexperts. \n\nA positive aspect of this paper comes from the simplicity of the\nidea. There are however several issues that should be taken into\naccount:\n- It is not clear how to determine when the distribution of action\n  pair saturates. This is relevant for the use of the proposed approach.\n- The total training time should consider both the initial time to\n  obtain the extra pairs of frequent actions plus the subsequent\n  training time used by the system. Either obtained from a learning\n  system (15 hours) or by collecting traces of human experts (< 1\n  hour?). \n- It would be interesting to see the performance of the system with\n  all the possible pairs of primitive actions and with a random subset\n  of these pairs, to show the benefits of choosing the most frequent\n  pairs used by the expert.\n- This analysis could be easily extended to triplets and so on, as\n  long as they are the most frequently used by experts.\n- The inclusion of macro-actions has been extensively studied in\n  search algorithms. In general, the utility of those macros depends on\n  the effectiveness of the heuristic function. Perhaps the authors\n  could revise some of the literature.\n- Choosing the most frequent pairs in all the game may not be a\n  suitable strategy. Some sequences of actions may be more frequent\n  (important) at certain stage of the game (e.g., at the beginning/end\n  of the game) and the most frequent sequences over all the game may\n  introduce additional noise in those cases.\n\nThe paper is well written and easy to follow, there are however, some\nsmall typos:\n- expert(whose => expert (whose\n% there are several places where there is no space between a word and\n% its following right parenthesis \n- don't need train => don't need to train\n- experiments4. => experiments.\n- Atmost => At most\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}