{"title": "Proposed method is interesting but additional experiments are needed", "review": "Overall:\nThis paper works on improving the gradient estimator of the ELBO. Author experimentally found that the estimator of the existing work(STL) is biased and proposed to reduce the bias by using the technique like  REINFORCE.\nThe problem author focused on is unique and the solution is simple, experiments show that proposed method seems promising.\n\nClarity:\nThe paper is clearly written in the sense that the motivation of research is clear, the derivation of the proposed method is easy to understand.\n\nSignificance:\nI think this kind of research makes the variational inference more useful, so this work is significant. But I cannot tell the proposed method is really useful, so I gave this score.\nThe reason I doubt the reason is that as I written in the below, the original STL can handle the mixture of Gaussians as the latent variable but the proposed method cannot. So I do not know which is better and whether I should use this method or use the original STL with flexible posterior distribution to tighten the evidence lower bound. I think additional experiments are needed. I know that motivation is a bit different for STL and proposed method but some comparisons are needed.\n\nQuestion and minor comments:\nIn the original paper of STL, the author pointed out that by freezing the gradient of variational parameters to drop the score function term, we can utilize the flexible variational families like the mixture of Gaussians.\nIn this work, since we do not freeze the variational parameters, we cannot utilize the mixture of Gaussians as in the STL. IWAE improves the lower bound by increasing the samples, but we can also improve the bound by specifying the flexible posteriors like the mixture of Gaussians in STL.\nFaced on this, I wonder which strategy is better to tighten the lower bound, should we use the STL with the mixture of Gaussians or use the proposed method?  \nTo clarify the usefulness of this method, I think the additional experimental comparisons are needed.\n\nAbout the motivation of the paper, I think it might be better to move the Fig.1 about the Bias to the introduction and clearly state that the author found that the STL is biased \"experimentally\".\n\nFollowings are minor comments.\nIn experiment 6.1, I'm not sure why the author present the result of K ELBO estimator in the plot of Bias and Variance.\nI think author want to point that when K=1, STL is unbiased with respect to the 1 ELBO, but when k>1, it is biased with respect to IWAE estimator.\nHowever, the objective of K ELBO and IWAE are different, it may be misleading. So this should be noted in the paper.\n\nIn Figure 3, the left figure, what each color means? Is the color assignment is the same with the middle figure?\n(Same for Figure 4)", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}