{"title": "Still needs a lot of work", "review": "This submission develops a method for evaluating the degree to which certain input features contextualize the effects of other input features in deep learning models. The authors achieve this through two steps. First, they approximate the behaviour of the target network with a mixture of student networks, that each only process a subset of the input. This provides a coarse-grained measure of the relevant context for features' effects. Second, they obtain a fine-grained measure of how input units interact with each other, via a backwards propagation algorithm. In turn, the authors demonstrate an application of these methods to the value network of an AlphaGo instantiation. Here, the objective is to measure how the effect of a newly-placed stone is modulated by the other stones on the board. The authors then validate these measures against human Go experts, providing some examples and summary statistics.\n\nI don't think this submission is ready for publication. \n\n- I found it a very confusing read, and much of the text requires a substantial rewrite to make it clearer to understand. For instance, I struggled to follow the process in Section 3.2, and the results in Section 4.2. Target units (3.2.2) and inference patterns are not explained, nor is o^{bfr}.\n\n- While the authors explain two different steps (the coarse-grained and the fine-grained ones), it's not clear how these are related. Are they used together on the AlphaGo value net? Why not just do the fine-grained study directly on the original teacher net? \n\n- Critically, the evaluation with human experts lacks the necessary rigor. There are no baselines considered for the correlations or the subjective ratings. What structure is actually being captured by this? Is it advanced Go knowledge, elementary Go knowledge, or spatial proximity? \n\n- Despite promising to \"explain the gaming strategy of the alphaGo Zero model\", I'm not convinced this delivers in the end.", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}