{"title": "the motivation of this paper is not properly justified by these evaluations.", "review": "\nSummary: \nThis paper proposes a method to reveal the effect of contextual (local) features to CNN network output. Specifically, the authors focus on the task of explaining the value network in AlphaGo. Value network provides a prediction of the winning probability over the current board. The proposed idea first uses a mixture of small local models to estimate the target global model of Value network.  It then uses the mid-level patterns from the smaller networks to extract the collaboration between different features. The evaluation section shows that the method proposed has extracted information that correlates with human annotations.\n\nReview:\nThis paper targets an interesting problem and proposes a novel approach. The local visualization idea is interesting.  A few comments: \n\n0. The evaluation section needs to be improved. The explanation in Figure 3 is clear, but it doesn’t justify the method.\n\n1.  Please add results showing the performance of using student networks. The absence of this result makes the main logic of the paper questionable. \n\n2.  Please add more evaluation of the collaboration extraction from the local models. It should be compared to baselines, like saliency maps.\n\n3.  The reported Jaccard Similarity is only 0.36. It is about the whole board. This hardly justifies that the result achieves good correlation with human annotations.\n\n4.  Why the last three boards in figure 5 are “perfect” while the predicted contextual features are very different from the human annotation? Besides, I suggest the authors add a baseline using distance to compare with the result from the proposed method.\n\nIn summary, I feel the motivation of this paper is not properly justified by these evaluations.\n\nMinor issues/suggestions:\n1.    No summary of the proposed method. An algorithm box is recommended.\n2.    Experiment results shown in the Appendix are problematic. In the “more result” Section board 3,4 “merged map” and “manual annotation” have different stones. Also, more descriptions should be provided to explain the results in the appendix.\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}