{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "The paper presents a new sequence to sequence regression problem in which every element of the input sequence contributes to the output sequence after an unknown delay. The setup is motivated by a problem in space weather that seeks to predict the solar wind from solar observations. \nA mixture of Gaussian-based model is proposed and a closed-form update for the maximum likelihood problem is derived in the paper. After providing extensive analysis for the alternating optimization of the parameters, the proposed model is tested in synthetic and real-world experiments, where it achieves state-of-the-art in solar wind prediction.\n\nThe approach of the paper to the problem is principled and it provides extensive theoretical and experimental results for further insight. Unfortunately, one of the main equations (equation 3) is difficult to parse due to its unclear notation and moving forward from that early point, I could not trust my interpretation of the presented model (to be more precise, use of subscript “t” for both x and y on the LHS, the summation index, and the probability space of p all use notations that I found confusing and problematic.)\n\nAs a separate note, early on, the paper argues against existing sequences to sequence models for this task due to their limitation in working with individual sentences. However, the paper proceeds to make a modeling assumption of the same sort which bounds the time lag. In light of this, I do think that transformer type models can be adapted to this setting, and in fact, an input dependent attention mechanism is ideal for combining the prediction of time-lag and the raw response in the output sequence. The expectation is for this type of model to perform well in the proposed setting. Could you please comment?  \n"}