{"rating": "8: Accept", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "\nThis paper proposes a bayesian method, Dynamic Time Lag Regression (DTLR), to predict effect-data y from a cause x. \nWhile both, cause and effect, are time series (x = x(t) and y = y(t)), the cause is assumed to have influence on the effect via a time lag, y(x(t), t) = y(phi(t)) = y(t + g(x(t))). The novelity of the problem posed is that the time lag g(x(t)) is allowed to be non-stationary and supposed to be unknown. The authors outlie a a Bayesian approach. The likelihood of the cause-effect data is conidered used to optimize the regressors for a given, finite set of time lags and the probability of these time lags. This discussion is very brief and detailled derivations are given in the appendix. An accompanying stability analysis is performed. In the implementation a neural network-based approach is used, where in turns the parameters of the model are optimised by a typical gradient descent algorithm and afterwards the hyperparemeters are set to values determined by the parameters. The theoretical deviation is accompanied by practical expirements on synthetically generated data and (real) space weather data. The performance of the model is compared to the one of a prediction with a fixed time lag, which it in fact outperforms. On the space weather (solar wind) data the model is shown to outperform several state-of-the-art models. A codebase for an implementation done in the Scala language is given.\n\nThe paper presented provides a meaningful contribution to the field of time series analysis and Bayesian methods. The novelty of the problem imposed as well as the accompanying solution is outlined very clearly. The problem is well justified and the motivation is clearly given.\n\nI recommend to accept it, even though a few details could have been described more precisely.\n\n1. The definition of the time lag g(x(t)) could have been made more clearly, providing a few examples at this point could help to clarify these definitions here.\n2. For the synthetic data generation a justification would be helpfull in order to motivate the choice of the functions f and v. \n3. A chart with sample time series data (y) against the time would be helpful to better visualize the problem.\n "}