{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper is motivated by a specific application about the prediction of solar wind. It is a major threat to the modern world. Authors propose a new regression model called Dynamic Time-Lag Regression which is a special case for spatio-temporal data. For solving this regression problem, the authors use a standard Bayesian approach to fit the model. The analysis of saddle point in Section 3.2 is quite impressive and meaningful. Correspondingly, the practical DTLR algorithm iteratively updates the parameters and hyper-parameters. In experiments, it reveals that the proposed method improves the performance for this particular problem significantly. The application solved by authors is very important, and it is improved by the proposed method. However, the novelty of the work is not presented clearly.\n\nMain argument\n1.\tIt is not clear about the difference between the proposed regression model and others. In my knowledge, it is a quite normal model for spatio-temporal data.\n2.\tThe Bayesian approach and its practical algorithm are very common solutions. What is the highlighted content besides the linear stability analysis?\n\nFor the experiments, the following should be addressed.\n1.\tRMSE in Section 5usually stands for root mean square error. What does relative MSE mean?\n2.\tAuthors said, “After domain knowledge, the time-lag ranges from 2 to 5 days, segmented in six-hour segments.” Does the setting of segmentation have a significant effect?\n3.\tIt would be beneficial to empirically demonstrate the evidence for supporting the theory of avoiding saddle point by synthetic regression.\n\n"}