{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper talks about training multiple energy-based models for each concept and then combining them in different ways to construct a composite model. For each composition of concepts, the samples from the composite energy-based model follow the logic of composition. \nThe main novelty of the paper is to define an energy-based model for each logical composition of the concepts based on the energy-based model of each concept. Regarding the usage of energy-based models, the idea is interesting. However, I am not sure about the existing works using alternative approaches. \n\nMy main question: the experiments only combine the energy models trained for the same domain. What does happen if you combine the energy models from different domains, for example, Celebs and color from the objects? What if you combine models with different architectures?\n \n-- The qualitative images show the method is working, but the outputs are not great!!!! \n\n-- I really want to see the outputs for old + male + smiling + heavy hair in contrast to Figure 3?\n\n\n-- The \"concept inference is not clear from the text. The goal is to infer a concept from several given images of the same concept.\nIt is not clear from the text, but I assume you compute an approximate likelihood (by estimating the partition function with a single sample using Langevin dynamics) of images for each concept and pick the concept with the highest value.  \nSo what do you mean by this: \"We can then obtain maximum a posteriori (MAP) estimates of concepts by minimizing the energy of the above expression.\" \n\n--I had a hard time following the experiments of sections 3.4 and 3.5, mostly because of unclear writing. \n\n--Some sentences are not clear, for example:\n\"To test this, we construct a sphere dataset consisting of sphere of all sizes at a specified percentage of the rightmost positions and large spheres remaining positions, with size/position annotations.\"\n\n--Equations 4 and 10 need negation for the energy term to be consistent with Equation 1.\n--The citation for Langevin dynamics should be Welling and Teh, 2011. "}