{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper describes an approach to few-shot regression based on\nlearning a sparse basis and a weight estimator network. The authors\nintroduce a sparsity inducing term in the loss to encourage sparse\nweight generation for tasks; these sparse coefficient vectors are then\nprojected onto the learned, task-dependent basis for\nregression. Experimental results are given on two synthetic regression\nproblems, with a comparison with the recent state-of-the-art.\n\nThis paper has some interesting ideas in it. However, it does have\nsome issues:\n\n 1. Clarity. There are several points of the proposed technique that\n    are not described clearly enough. For example, the diagram in\n    Figure 1 leads me to believe that the basis and weights generators\n    are independent (and thus not trained end-to-end). However, the\n    loss in eq. (5) seems (though it is not completely clear to me) to\n    depend on both networks (which is how I would expect things to\n    work). Also, the \"self attention blocks\" mentioned at several\n    points are never completely defines. And from the ablation study\n    is seems that the improvement form self-attention is the lion's\n    share of the overall improvement. I do not feel that it would be\n    easy to reproduce the results reported in this paper without\n    significant guesswork.\n\n 2. The experimental results are somewhat limited. The sinusoidal\n    regression problem is very artificial, as is the image regression\n    task. Focusing on regression is inherently limiting, but results\n    on more realistic regression problems would help establish more\n    clearly the significance of the contribution.\n\n"}