{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This is a strait forward paper that aims to address the lack of scalability of prior methods on system  identification.  The idea is simple yet the assumptions required are significant and restrict the applicability of the proposed algorithm to systems that are closed to deterministic.  Below are some pros and cons for this paper:\n\nCons:\n(+) The proposed method is simple and it could be  quickly adopted by robotics researchers and practitioners\n(+) The method seems to outperform previous algorithms\n\nPros:\n(-) The idea of working with deterministic systems is restrictive.  While the process noise may appear in some robotics applications to be small  I see no way of how one could reduce the effect of the observation noise.    Also in the context of systems that navigate in terrestrial environments  the process noise is definitely more present that in the case of flying vehicles. \n\n(-) It would definitely strengthen the paper if the authors could elaborate more on the concepts of controllability, observability and how these concepts relate to their method etc. How does the existing methods handles these properties? How is the performance of the method affected  when the true system is not controllable but it is stabilizable?\n\n\n(-) There seems to be no assumption on the shape of the trajectories. What kind of trajectories you need to perform system identification? Can you mathematically represent these assumptions? In the adaptive control literature there exists conditions related to \"sufficient rich signals\" see the book by Ioannou on Robust Adaptive Control. These are signals that can excite dynamics so that to ensure proper identification.  \n\n\n\n"}