{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposes a novel way to address the well studied system identification problem. More specifically, this paper focuses on non linear systems with partial observations. To this aim, the authors propose the \"System-indetification via Iterative Smoothing and Learning\" (SISL) algorithm. The gist of the approach is to formulate an ML problem to estimate the system model parameters from a parametric family of models to estimate both the dynamical system evolution (state updates) and the observation process. The exact optimization for this ML problem is not tractable. This work proposes to solve a surrogate point-estimate  ML problem. This optimization is solve using an alternate approach (between smoothing and learning). \n\nThe paper also presents experimental results both on synthetic  and real data aiming to demonstrate that SISL provides unbiased estimates in deterministic settings. The synthetic setting is also used to motivate the need for methods able to handle large system dimensionality for non-linear and partially observable systems. \n \nThe real data setting compares favorably the SISL approach with well established baselines. \n\nI believe that the paper can be improved in the following ways: \n1) There are intermediate steps in the derivation of the maths that could be better explained. For example, in equation 2, the “Markovian” aspect of the system is key to derive the formula (x_{t+1} only depends on x_{t}). Equation 4 is not really derived from Equation 3. The factorization shown in Equation 2 is relevant for Equation 4 although the 4) is for the surrogate objective function. \n\nAlso, I did not understand why the naive approach is not plotted on Figure 3 (a and b) (but it comes back in the appendix).  Is it just an oversight?"}