{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper employed fuzz testing approach to generate black-box adversarial examples. In general, the fuzz testing is new to the adversarial attack area to the best of reviewer's knowledge. One difference with the existing black-box attack generation methods is that AdvFuzzer walks from a source image to a guidance image rather than starting from a targeted image. However, I still have concerns about this submission. \n\n1) Figure 1 is not clear. Please highlight AdvFuzzer and LocalFuzzer and clarify the meaning of the color and symbols.\n\n2) The algorithm presentation is poor. It makes the current technical contributions unclear. What is the challenge when applying fuzz testing to adversarial example generation? And what are technical contributions induced by this new challenge?\n\n3) Some experiments are unclear to me. \n3.1) The lack of ImageNet results is a weak point. \n3.2) What is the computational complexity of the proposed fuzzing-based approach? Having a comparison on computation time might be helpful.\n3.3) The second row of Figure 2 seemingly implies that fuzzing attacks lead to much higher L_inf distortion. Right? Is there any comparison under L_inf  metric? This observation also holds in Table 1 and 2 (small L_0 but large L_2). Thus, I wonder if the reduced query number is at the cost of a significant increase of L_inf norm. For a fair comparison, it might need to add L_inf constraint such that all methods have similar pixel-level perturbation tolerance. E.g., one related work on black-box soft-label/hard-label attack https://arxiv.org/pdf/1907.11684.pdf\n\nThus, my initial rating is weak reject. "}