{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2545", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper proposes a fuzzing technique to mutate images in a black-box manner for realizing targeted and un-targeted attacks. The authors evaluate the effectiveness of their technique on MNIST and CIFAR-10 dataset.\n\n+The paper is generally well-written and easy to follow. Fuzzing is a well-explored area in Software Engineering and this paper shows the potential of fuzzing for adversarial attacks. \n\n- My main concern of this paper is the results (Section 4). Though for the untargeted attack on  MNIST dataset the proposed technique performs well, its performance is not that satisfactory, especially for CIFAR-10. For an untargeted attack (Table-1) though L0 is significantly low compared to baseline attacks, L2 is increased. This is even worse for Targeted attacks (Table 2)----both reported L0 and L2 loss are greater than C&W L0 attack. \n\n- What is the justification of using Fuzzing 300 and 500 settings, as their number of queries almost match with Opt Attack? \n\n- The evaluation tasks for BlackBox attacks should be performed on black-box scenarios such as google cloud API and Amazon API settings. Instead, the authors use simple white-box settings like mnist, cifar10.\n\n-\t“Note that due to the randomness of our fuzzing attacks, the results could vary in a certain range from run to run.” --- How much is this variation?\n\n- The paper exceeds 8 page page-limit.\n\n- In the methodology section, it is not clear to me how many pixels are mutated per step? It apparently looks like one pixel is selected per step without any guidance. This is almost like a simple brute force approach.\n"}