{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper proposes a new decision based attack algorithm. Given a targeted example and original example, the algorithm gradually check samples on this path with some local noise randomly added. The authors show that their approach can get better L_0 perturbation on MNIST and CIFAR-10. \n\nAlthough the algorithm is novel, there are several weaknesses in both algorithm design and experimental evaluation. \n\nExperimental comparisons: \n1. From the tables, the authors show improved L0 perturbation but with much worse L2 perturbation, which was the focus in both Boundary and OPT attack. Therefore it's not very convincing that the proposed method can improve the quality of adversarial example on standard L2 or even Linfty, L1 perturbations. As mentioned in the first paragraph of section 3.2, the authors mentioned that their method can also be applied to L2 perturbation, so a more fair comparison would be trying L2 version of Fussing-based attack and comparing it with Boundary and OPT attacks. \n\nFrom Figure 2 we can clearly observe perturbations, and comparing with the quality we got using L2 perturbation based algorithms (Boundary and OPT attack), I feel the proposed algorithm leads to human-perceptible perturbations. \n\n2. I am quite concern about whether AdvFuzzer is sensitive to the target image, since it only samples points on the path toward one target image, but the goal of either targeted or untargeted attack is not to perturb toward a particular target image, but to find the minimum perturbation that changes label. So, how do you select the target image? Is the algorithm sensitive to this selection?\n\n3. No experiments on ImageNet (note that both Boundary and OPT attacks have been tested on ImageNet). \n\nRegarding the algorithm : \n4. The algorithm might have huge memory requirement since the set Sadv keeps growing. What's the max size of Sadv set in your experiments? "}