{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper studies how to aggregate features from group inputs. The paper proposes  Discriminability Distillation Learning (DDL) to compute the aggregation coefficients. The method assumes that each sample has a discriminability property that is directly related to the task. The authors define this property and propose to learn such property by an auxiliary network. Such a network can be used in many models without affecting their original training procedure and is able to improve the performances on many tasks, including set-to-set face recognition and action recognition. The experimental results are comprehensive and convincing.\n\nThe idea is simple yet interesting and the results are good, so I tend to give a positive rating.\n\nBut overall, the paper is not well-written, and there are some questions:\n\n1. The paper needs more proofreadings. For example,\n    a. only frames **will** high scores will be weighted and aggregated\n    b. As shown in table ??\n2. It seems that the proposed method is limited to tasks that have the concept of “centroids”. Many tasks may not have well-defined centroids.\n3. Discriminability is also a kind of quality in some ways, and it is used in a similar way to the previous methods. The authors are encouraged to discuss more the differences to highlight the novelty and contributions. Especially after viewing Fig. 3 and 4, their boundaries become less clear.\n4. I might be wrong but I didn’t see any figures referenced in the main body. Please add references and organize them better.\n5. The discriminability is used only once. I’m just wondering if the authors have considered cascade training, i.e., use the discriminability information to train better centroids, which then will define discriminability better.\n"}