{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes a semi-supervised and adversarial training process to exploit the value of unlabeled faces and overcome the limitation of a linear 3DMM and the nonlinear models proposed early (Tran & Liu (2018), Tran et al (2019)). This approach designs a framework to exact nonlinear disentangled representations from a face image with the help of loss functions including face recognition loss, shape pairwise loss and adversarial loss. This framework's contribution is demonstrated with experiments which show this model achieves state-of-the-art performance in face reconstruction.\n\nThis paper should be rejected because:\n(1) the experiments are not representative enough and the results are controversial,\n(2) this paper does not clearly demonstrate how they exploit the value of the unlabeled training images,\n(3) the creative progress of this paper is not typical compared to the early nonlinear model (Tran & Liu (2018), Tran et al (2019)).\n\n\nMain argument: \n\nThe experiments do not provide convincing evidence of the correctness of the proposed approach or its utility compared to existing approaches. The results are not representative enough and missing many details:\n1) What is the ratio of unlabeled training images and labeled training images?\n2) Why only show the results of Cooperative and Indoor situation? \n3) Why the standard deviation of the result in Cooperative situation is higher than the early models?\n4) Why the mean value of the result in Indoor situation is higher?\n5) Why so few situations and datasets your experiments run on?\n6) How did you initialize the parameters and the weights?\n7) How about the time-consuming and memory-consuming of your model?\n\nThe paper does not demonstrate the difference and progress between its model and the early nonlinear model clearly (Tran & Liu (2018), Tran et al (2019)). This paper points out that they fully exploit the value of unlabeled face data, but there are few evidences in this paper to support that. And it also points out the time-consuming problem of early models, but there are no experiment results show how efficient its model is.\n\nThe loss functions are also not convincing enough:\n1) How to choose or initialize the value of lambda center in the Face recognition loss?\n2) Have you demonstrated the solution you used in Shape smooth loss which aims to solve the vertices do not satisfy the Laplacian equation?\n"}