{"title": "Interesting ideas; contribution is marginal over previous work; lots of questions about hierarchy construction and utility", "review": "Major comments:\n\nThis paper builds on previous work in hierarchical LMDPs and extends the core ideas to an online setting.  Essentially, we incrementally construct a hierarchy by adding new states to upper-level MDPs every once in a while; these are loosely initialized and the parameters are then refined with additional experience.\n\nOverall, I felt that this paper lacked a substantial enough contribution. \n\n* The key contributions over previous work seems to be entirely contained in Sec. 3.1 and 3.2: (1) when we have visited k new states, add a new state to the hierarchy, and (2) initialize its parameters with intuitive values.\n\n* To me, this level of contribution is below the bar for ICLR.  The ideas seem simplistic and likely to work only in the simplest of domains.\n\n* The improvement over previous work is marginal.\n\n* I think the paper is lacking in clarity.  I do not think I could re-implement the paper, given the level of detail presented.\n\n* I was very disappointed in the experiments.  Not only were they on gridworld-like domains (see below), but it was not clear if the improvements were significant in any way.\n\n* While I thought the discussion in Sec. 3.3 was interesting, it didn't seem to be a \"contribution\"; it felt like some adhoc thoughts.\n\n* Keeping per-state counts is only workable in small state space domains.\n\nMinor comments:\n\nPlease fix the formatting of your citations.\n\nThere are numerous typos and spelling errors.  Please correct them.\n\nI am strongly opposed to the use of gridworlds, or anything like them, in modern RL research.  While many ideas work fine in small, toy domains, they simply do not scale.  As a field, we need to move past them and focus more on algorithms and ideas that have more practical relevance.\n\nPros:\n+ Core ideas seem promising\n+ Leveraging mathematical structure is a great strategy for constructing algorithms with desirable properties\n\nCons:\n- Very limited experimental results\n- Not clear if improvements are significant\n- Hierarchy construction seems to be too limited to work in any reasonably sized problem\n- No evidence, theoretical or otherwise, is given to suggest that this particular hierarchy construction method is any better than any other method\n\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}