{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper revisits limitations of relation-embedding models by taking losses into account in the derivation of these limitations. They propose and evaluate a new relation encoding (TransComplEx) and show that this encoding can address the limitations previously underlined in the literature when using the right loss.\n\nThere seems to be merit in distinguishing the loss when studying relation encoding but I think the paper's analysis lacks proper rigor as-is. A loss minimization won't make equalities in (3) and (5) hold exactly, which the analysis do not account for. A rewriting of the essential elements of the different proofs could make the arguments clearer.\n\nPaper writing: \n* The manuscript should be improved with a thorough revision of the style and grammar. Example of mistakes include: extraneous or missing articles, incorrect verbs or tenses. \n* The 10-pages length is not beneficial, the recommended 8-pages could hold the same overall content.\n* The option list on page 8 is very difficult to read and should be put in a table, e.g. in appendix.\n* Parentheses are missing around many citations and equation references\n\nTheory:\nEquation (2) and (4) do not seem to bring much compared to the conditions in Table 1. Eq. (3) and (5) show \"a\" loss function rather than \"the\" loss function since multiple choices are possible. \\gamma_1 should be set to 0 when it is 0 rather than staying in the equations.\n* Minimizing the objective (3) and (5) will still not make the conditions in Table 1 hold exactly, because of slack variables.\n\nExperiments:\n- Can the authors provide examples of relations learned with RPTransComplEx# that go address the limitations L1...L6, validating experimentally the theoretical claims and showing that the gain with RPTransComplEx5 correspond to having learned these relations?"}