{"title": "Very interesting and well written paper on augmented memories", "review": "This paper looks at ways to improve memory-writing in memory augmented neural networks. Authors proposed two methods to compare against \"regular writing\" method as well as compare against each other, namely \"uniform writing\" and \"cached uniform writing\". Latter one attempts to utilize a small size memory efficiently by introducing memory overwriting in other words \"forgetting\".\n\nAuthors started with a very interesting section (namely section 2.1.1) and presented a theoretical formulation of \"remembering\" capability of RNNs, which is fundamental to this work and I really liked it that they did not jump to the proposed methods right away and instead focused on something very fundamental. Authors presented details of the proposed methods very well, and evaluated them on simple tasks such as \"double task\", \"synthetic reasoning\", etc. as well as on more challenging/real tasks such as \"document classification\" or \"image recognition task from MNIST\". I really liked the fact that the paper looked at different tasks instead of going with one. Results are convincing overall, especially for CUW. One thing that will improve the paper is the analysis part.\n\nDue to having 5+ tasks in the results section, I got the feeling that it is hard to follow the analysis presented by authors within each task as well as across tasks. Also, in some tasks analysis is quite limited. It would be great for authors to zoom into the memory write operations in each task (e.g., taking a diff between RW and URW for example and see how memory changes and more importantly how \"remember\" capability changes) and provide more stats on these, and do this across tasks in one section rather than in different sections allocated for each task. Also, analysis in more realistic tasks (e.g., document classification) can be extended as well, rather than only comparing against state-of-the-art methods in terms of final metric.\n\nWhile reviewing the paper, I couldn't help asking why larger memories were not tried. I can see the motivation of trying to use smaller augmented memory, however experimentation around slightly larger augmented memories will be useful for the audience to draw some conclusions. Especially I'm curious about the effect of memory size on accuracy in tasks like image recognition or document classification.\n\n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}