{"rating": "6: Weak Accept", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #796", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "<Strengths> \n+ This paper proposes a new dynamic model named hierarchical multi-task dynamical systems (MTDSs) as a latent sequence model that enables users to directly  control the output of data sequence via a latent code z. \n+ The proposed model adopts the multi-task learning idea to represent each sequence in the training set. Another strength of the model is flexibility as different base models and latent models can be chosen. In experiments, it can achieve reasonable performance using hierarchical RNN as a base model and VAE for latent modeling. \n+ The new formulation is well-explained in the thorough appendix.\n\n\n<Weakness>\nIn my opinion, the major weakness of this paper is weak experiments, although many results of different types of tests are reported. \n\n1. The experiments are carried out with a simple toy dataset DHO and MOCAP data. As done in previous related papers, some challenging video datasets can be used for more convincing evaluation.\n\n2. The compared baseline models are too weak, given that no state-of-the-art model is compared. \n- Throughout the papers, only single-task version and pooped version of the model are compared. It may not be surprising that the multi-task version is better than these two weak baselines. \n -In section 3, several latent sequential models are introduced, including Miladinovic et al. (2019),  Hsu et al. (2017), Yingzhen & Mandt (2018), Bird et al. (2019). I strongly recommend a couple of them may need to be implemented and investigated in some sets of experiments.\n\n<Conclusion>\nMy initial rate is borderline with slightly leaning toward accept. I am willing to adjust my rate more favorably if more experiments are conducted as mentioned above. \n"}