{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposes a doubly-normalized attention scheme, and draws connections between the proposed method and GMM and optimal transport. The authors demonstrate two benefits using DNAS, i.e. avoiding explaining away and mode collapse. Some experiments are conducted to show the performance. The paper is written well, and easy to follow. Below are my main concerns:\n\n1. Mode collapse: I do not quite understand how the figures in Appendix are drawn. Also from Fig. 2 I do not see why DNAS is *always* the upper bound of LNAS. Some theoretical analysis should be derived here. \n\n2. Sparse v.s. Dense as in LNAS v.s. DNAS: From the optimization perspective in Eq. 9 and 10, and Lemma 1, the weights in LNAS should be much sparser than those in DNAS. This leads to the benefit of computational complexity/time. However, the authors have never discussed it in the paper, neither theoretically nor empirically.\n\n3. Significance of results: Unfortunately I do not see the significance of the experimental results here. The improvements are often less than 0.5%, compared with LNAS (then why is the proposed method important???). Many experimental details are missing, e.g. how many trials are reported here? Are the numbers the best ones or averaged? What are the stds? How many epochs for LNAS and DNAS? Without knowing such details, I can hardly justify the significance.  \n\n4. HNAS experiments: Showing Fig. 3 and 4 without any comparison with other approaches like LNAS does not make sense. How do we know whether hybrid is good or not? Table 1 shows the results from DNAS without HNAS, Table 2 and 3 use HNAS but no DNAS. To me this way of showing results is weird. Why not showing all the results of DNAS and HNAS for all the tasks? "}