{"title": "Interesting idea, but seems less precise than previous work", "review": "This paper offers the argument that dropout works not due to preventing coadaptation, but because it gives more gradient, especially in the saturated region. However, previous works have already characterized how dropout modifies the activation function, and also the gradient in a more precise way than what is proposed in this paper. \n\n## Co-adaptation\nco-adaptation does not seem to mean correlation among the unit activations. It is not too surprising units need more redundancy with dropout, since a highly useful feature might not always be present, but thus need to be replicated elsewhere.\n\nSection 8 of this paper gives a definition of co-adaptation,\nbased on if the loss is reduced or increased based on a simultaneous change in units.\nhttps://arxiv.org/abs/1412.4736\nAnd this work, https://arxiv.org/abs/1602.04484, reached a conclusion similar to yours\nthat for some notion of coadaptation, dropout might increase it.\n\n## Gradient acceleration\nIt does not seem reasonable to measure \"gradient information flow\" simply as the norm of the gradient, which is sensitive to scales, and it is not clear if the authors accounted for scaling factor of dropout in Table 2.\n\nThe proposed resolution, to add this discontinuous step function in (7) with floor is a very interesting idea backed by good experimental results. However, I think the main effect is in adding noise, since the gradient with respect to this function is not meaningful. The main effect is optimizing with respect to the base function, but adding noise when computing the outputs. Previous work have also looked at how dropout noise modifies the effective activation function (and thus its gradient). This work, http://proceedings.mlr.press/v28/wang13a.html, give a more precise characterization instead of treating the effect as adding a function with constant gradient multiplied by an envelop. In fact, the actual gradient with dropout does involve the envelope by chain rule, but the rest is not actually constant as in GAAF. \n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}