{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "\nThis paper proposes a method to map a pair of textual information into a 2D RGB image. They achieve this by heuristically creating a character map in a 2D matrix and then add color according to the character within the text (e.g. a line connecting bi-gram characters). To compare 2 textual pieces, different colors are used. This novel “text representation” can be fed to 2D convolutional neural networks (image classifiers). The proposed representation is evaluated on a patent inventor disambiguation task, and shown to slightly our perform existing methods.\n\nI would not recommend this paper because the method in this paper is not well motivated and the empirical results do not demonstrate the usefulness of the proposed method. In addition, the quality of writing can be improved in several places.\n\nThe goal to capture string similarity (character overlaps) is well motivated for the name disambiguation task, but it is unfounded on why a 2D mapping would provide additional benefits from the existing features. The paper could be improved by discussing the strength and weaknesses between the existing features and the proposed representation. In the experiment, it is shown that a simple string similarity feature and a random forest (Kim et al., 2016) already achieve 99% in the F1 score. A small increment of 0.09 in the F1 score cannot justify the proposed algorithm. I think the author should select other tasks altogether. Finally, the fact that any random character map gives the same result is quite counter-intuitive and requires more analysis such as ablation on coloring (connecting lines, blue color, …).\n\nAs for the writing, there are several issues. First, the format of the table is incorrect. Some tables are out of the border and the captions are on the top. More importantly, the method to construct the character map is unclear and a significant part of the map is left in the appendix.\n"}