{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper proposed an unsupervised few-shot object recognition method by integrating GAN, Self-supervised learning, and deep metric learning of latent parts. The contributions of this paper are.\n1)\tImprovement of GAN by using the uniformly sampled codes and reconstruction loss. \n2)\tUse of an image masking procedure for triplet loss sampling. \nThe proposed ideas are interesting, and experimental results show very high performances compared with previous unsupervised few-shot learning methods. \n\nOn the other hand, there are several weak points, which are summarized below. \n\n1. The authors claimed the discrete latent codes correspond to parts of an object in images. However, if the discrete codes really correspond to parts is not verified.\n\n2. In the abstract, the authors wrote that the reconstruction loss enforces the discriminator to capture the most relevant characteristic of “fake” images. However, it is not clear why capturing the characteristics of “fake” images leads to improve the performance of few-shot recognition. \n\n3. The ablation study is incomplete. On p.2, the authors wrote that the discrete encoding gives better performance than the continuous counterpart. However, Table1 reports only the performance of BCE, which includes both discrete encoding and reconstruction loss. Thus, it is not clear if both discrete encoding and reconstruction losses are effective. Also, the performances of GAN+ROT, GAN+METRIC, and other combinations of each method are missing. \n\n4. Lacking some closely related works.\n\nB.Zhang, T.Che, Z.Ghahramni, Y.Bengio, Y.Song, MetaGAN: An Adversarial Approach to Few-Shot Learning, In Proc. NeurIPS 2018. \nS.Gidaris, A.Bursuc, N.Komodakis, P. Perez, and N. Cord, Boosting Few-Shot Visual Learning with Self-Supervision, arXiv:1906.07079. \n\n5. Random erasing data augmentation also uses erased rectangle regions for data augmentation. It is not clear if the triplet-based training is better than using masked images for data augmentation. \n\nZ.Zhong, L.Zheng, G.Kang, S.Li and Y.Yang, Random Erasing Data Augmentation, arXiv:1708.04896. \n\n"}