{"title": "GAN is extended to video with a video-level discriminator to make the frame generation smooth", "review": "This paper presents a GAN-based method for video generation conditioned on text description. A given text description is first encoded, then combined with latent noise, and finally input to the generator for generating video frames. The frame discriminator discriminates between the generated frames and real frames conditioned on the encoded text description. The discriminator ensures that the frame generation is smooth.\n\nPositives: \n- Easy-to-read paper\n- New conditioning method that generates convolution filters from the encoded text, and uses them for a convolution in the discriminator\n- New toy dataset for evaluation\n- High-quality generated videos on Kinetics dataset\n\n\nNegatives and suggestions:\n\n- Novelty is limited. While the paper presents interesting empirical results for computer vision, they may not be of broad interest to the ICLR community. The main contribution seems to be in combining the encoded text with visual features by using the convoluted operation instead of the common concatenation.  \n\n- Clarity can be improved. In section 3, there is no description about the text encoder T (section 3.1). Clarity could be improved by providing a figure of the overall architecture of D, and how to generate a set of convolved f_i from text features (they are described in the appendix, which makes the text hard to read and understand). \n\n- Experiments: \n (a) It not clear how to generate fake pairs (v, t). (By shuffling ground-truth pair or fake video or fake text?) \n(b) It is not clear how to construct the text description from 5 control parameters. \n(c) There are no qualitative results for the Shape-v1 dataset and  the Shape-v2 datasets with background. One suggestion for Shape-v2 is that the background should include color. Otherwise, it is a very easy setting, because the background is a grayscale image while the objects are colored.\n(d) The metric for classifier accuracy seems strange, because the classifier is not perfect. We cannot trust the classifier for evaluating the generated results.\n\n", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}