{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "In this paper, the authors proposed an embedding method for directed graphs.\nEach node is represented by a normal distribution. \nAccordingly, for each pair of nodes, the authors used the KL divergence between their distributions to fit the observed distance. \nThe asymmetric property of the KL divergence matches well with the nature of directed graphs.\nA scalable algorithm is designed. \nThe property of the learned space is analyzed in detail, which verifies the rationality of using KL divergence. \n\nMy main concerns are about the experiments and the baselines.\n\n1. The baselines are not very representative. Except for APP, the remaining three methods are not motivated by directed graphs. To my knowledge, authors can further consider the following two methods as their baselines.\n\na) The classic method like the Okada-Imaizumi Radius Distance Model in “Okada, Akinori, and Tadashi Imaizumi. \"Nonmetric multidimensional scaling of asymmetric proximities.\" Behaviormetrika 14.21 (1987): 81-96.” This method represents each node in a directed graph as an embedding vector with a radius and proposed a Hausdorff-like distance.\n\nb) The recent work in [35]. This method also embeds nodes by elliptical distributions, but the distance is measured in the Wasserstein space. \n\nThis work will be stronger if the authors discuss the advantages of the proposed model compared with these two methods and add more comparison experiments.\n\n\n2. In practice, node embeddings are always used in down-stream learning tasks. Besides the classic statistical measurements, I would like to see a down-stream application of the proposed method, e.g., node classification/clustering. Adding such an experiment will make the advantage of the proposed method more convincing."}