{"title": "Review of Paper \"Evolving intrinsic motivations for altruistic behavior\"", "review": "The paper describes an approach to develop a learning mechanism that shows the emergence of altruistic behaviour in public goods games across longer time scales. The essential idea is to combine principles of evolution that favour long-term behaviour with learning that focuses on the short term. \n\nTo achieve this, individual social preferences are modelled as intrinsic motivations and combined with deep reinforcement learning to develop individualised reward structures. This approach is then combined in a training setup that evolves varying policies, from which agents are sampled based on scenario performance and subjected to further selection. Finally, individuals are then matched based on assortative matching, with the baseline configuration being randomised matching. \n\nThe paper is well developed and systematically introduces the approach, along with an experimental evaluation and discussion. Moreover, the paper contributes to a challenging problem - the explanation of cooperative behaviour (more below). \n\nThe quality of the writing is good, apart from some odd expressions on Page 7. The figures are of good quality and sufficiently legible. However, the time series would benefit from better contrast in order to unambiguously identify those when reading the printed paper (black & white).\n\nSome questions/comments:\n\nOne specific question relates to the calculation of cooperativeness in the Harvest scenario. In the current operationalisation the difference between the agent's return and the mean return value is the cooperativeness ranking, confusing poor performance and cooperative behaviour. Could you think of a better metric to disambiguate this interpretation?\n\nGiven the comprehensive evaluation of retrospective and prospective metrics, can you provide generalisable insights as to when you deem the use of prospective reward networks as useful, since they (mostly) perform worse than retrospective ones?\n\nOverall, the paper tackles one of the most challenging problems of all - the explanation of cooperative behaviour. The combination of short-term learning and long-term evolutionary factors is a valuable exploration, which is we illustrated in this work. One more general question remains: can you really explain the basis of cooperative behaviour? The closest you get is the final discussion of the emerging weights, and extracting one of the insights that suggests reward if others are rewarded. While it is intuitively as well as scientifically accessible (e.g., as affective empathy), how do you substantiate that claim simply based on the weights?\n", "rating": "6: Marginally above acceptance threshold", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}