{"title": "The purpose and conclusion are unclear.  The validity of intrinsic reward is questionable.", "review": "The purpose and the conclusion of the paper are unclear.  Introduction emphasizes how cooperation emerges in nature.  The last sentence of the second paragraph states \"the goal\", but is this the goal of this paper or some others?  Does the paper tries to develop a model of multi-agent reinforcement learning (MARL) to provide theoretical or empirical underpinnings to how cooperation emerges in nature?  Is the paper simply motivated by nature and trying to develop a method of MARL that performs well?\n\nThe authors state that they apply evolution rater than hand-crafting intrinsic motivation, but it appears that intrinsic motivation is hand-crafted in the paper.  Specifically, in Section 2.2, intrinsic reward is defined through hand-crafted features of the other agents.\n\nFurthermore, those hand-crafted features are based on recently received reward or expected future reward of those agents.  The intrinsic reward for an agent is essentially the reward of the other agents.  Then it is no surprising that the cooperation emerges, because each agent seeks to maximize the total reward of all agents.\n\nIf the agents have access to the reward of each other, and the purpose of the paper is to maximize the overall performance, why not just let each agent simply maximize the total reward?  If the purpose of the paper is to provide some underpinnings to the emergence of cooperation in nature, how this definition of intrinsic reward provide any underpinnings?\n\nIn addition, technical contributions of the paper are rather limited.  What are proposed include (a) two time scales for learning and evolution, (b) assortative matchmaking that let players of a similar kind play each other, and (c) shared reward network.  The novelty of each is limited.\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}