{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "\nThis paper proposes an auxiliary reward for model-based reinforcement learning. The proposed method uses ensembles to build a better model of environment dynamics and suggests some rules to optimize the new ensemble-based dynamics and to estimate the intrinsic reward.\n\nI am torn on this paper. I like the derivation of the method and the ideas behind it. I think it is an interesting direction of research. However, the experiments are limited to one domain and the paper needs proofreading. I will vote \"weak accept\" for this paper, as I think it is incremental and the experiments are too limited.\n\nAs I said above, the paper could use some proofreading. Some sections (like pages 1-2) are well written, but others are full of grammatical mistakes. There is also a lot of redundant information.\n\nIt is often stated that the ensemble model has better capacity than the single model. Some experimental proof of this better modelling capacity could help convince a reader that the ensemble is indeed beneficial and warranted (e.g., show that P_K is better than the single model P).\n\nSome evaluation or discussion on the computational costs of the method would be beneficial. I assume the ensemble-based method is more computationally intensive. Would it perform better than single surprise if they were compared according to wall clock time?\n\n\nExamples of minor issues:\n\n- Page 3, after equation 7, sentence beginning with \"In addition to the advantage that the mixture model (4) has the increased model order for modelling\" is confusing, contains redundant elements, and is not bringing useful information. It should be revised\n- page 4, in paragraph after eq. 11: the following sentence is grammatically incorrect, please revise: \"Propositions 1 and 2 suggest a way to intrinsic reward design under the mixture model for tight gap between η(π ̃∗) and η(π∗)\"\n- in the same sentence, revise: \"be close to the true η(π∗) of the true optimal policy π∗, as desired.\",\n- page 6 text above Figure 1: \"single-modal\" should be unimodal"}