{"title": "Heuristics for choosing architectures", "review": "This paper proposes a set of heuristics for identifying a good neural network architecture, based on PCA of unit activations over the dataset. The method shows modest accuracy drops and improved parameter counts in several settings.\n\nMajor comments:\n\nThe proposed method is not optimal, in the sense that it does not provide any guarantees on the loss in performance or generalization error. It is largely heuristic, particularly the notion that the depth can be determined to be the layer at which expansion of the representation stops. This itself depends on the initial architecture one uses. \n\nThere is no clear theoretical link between PCA of the filters and performance of the network. In general, important information in features could come from low variance directions. Moreover, the PCA step is meant to give the dimensionality of the transformations, but this will depend on the choice of nonlinearity. Optimizing the method’s design parameter (% variance retained) may be comparably difficult as optimizing the number of filters in the networks directly.\n\nThe experiments show that the proposed method can often reduce the number of operations and parameters, at usually slight decreases in test performance. The experiments could be greatly improved by adding comparison to related parameter reduction mechanisms. It is hard to evaluate the benefit of the proposed method without these. Additionally, the drop in performance highlights the question of what exactly is being optimized if these design principles are ‘optimal.’\n\nIt could be interesting to look at the patterns in reduction of filters in the experimental results run here. Do adjacent layers typically increase the number of filters by certain factors after pruning? \n\nThe paper is mostly clear but the high level organization could be improved.\n\nOverall the proposed method offers a simple heuristic for choosing the architecture of a deep network, but this seems unlikely to yield principled improvements at present.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}