{"title": "Reinventing the (methodological) wheel?", "review": "Update: From the perspective of a \"broader ML\" audience, I cannot recommend acceptance of this paper. The paper does not provide even a clear and concrete problem statement due to which it is difficult for me to appreciate the results. This is the only paper out of all ICLR2019 papers that I have reviewed / read which has such an issue. Of course for the conference, the area chair / program chairs can choose how to weigh the acceptance decisions between interest to the broader ML audience and the audience in the area of the paper. \n\n----------------------------------------------------------------------------------------------------------------------------------\n\n This paper addresses the problem that often features are obtained as a set, whereas certain orders of these features are known to allow for easier learning. With this motivation the goal of this paper is to learn a permutation of the features. This paper makes the following three main contributions:\n1. The idea of using pairwise comparison costs instead of position-based costs\n2. The methodological crux of how to go from the pairwise comparison costs to the permutation (that is, solving Eqn. (2) using  Eqn. (1) )\n3. An empirical evaluation\n\nI like the idea and the empirical evaluations are promising. However, I have a major concern about the second contribution on the method. There is a massive amount of literature on this very problem and a number of algorithms are proposed in the literature. This literature takes various forms including rank aggregation and most popularly the (weighted) minimum feedback arc set problem.  The submitted paper is oblivious to this enormous literature both in the related work section as well as the empirical evaluations. I have listed below a few papers pertaining to various versions of the problem (this list is by no means exhaustive). With this issue, I cannot give a positive evaluation of this submitted paper since it is not clear whether the paper is just re-solving a solved problem. That said, I am happy to reconsider if the related work and the empirical evaluations are augmented with comparisons to the past literature on the methodological crux of the submitted paper (e.g., why off-the-shelf use of previously proposed algorithms may or may not suffice here.)\n\n\nUnweighted feedback arc set:\n\nA fast and effective heuristic for the feedback arc set problem, Eades et al.\n\nEfficient Computation of Feedback Arc Set at Web-Scale, Simpson et al.\n\nHow to rank with few errors, Kenyon-Mathieu et al.\n\nAggregating Inconsistent Information: Ranking and Clustering, Ailon et al.\n\n\nHardness results:\n\nThe Minimum Feedback Arc Set Problem is NP-hard for Tournaments, Charbit et al.\n\n\nWeighted feedback arc set:\n\nA branch-and-bound algorithm to solve the linear ordering problem for weighted tournaments, Charon et al.\n\nExact and heuristic algorithms for the weighted feedback arc set problem: A special case of the skew‐symmetric quadratic assignment problem, Flood\n\nApproximating Minimum Feedback Sets and Multicuts in Directed Graphs, Even et al.\n\n\nRandom inputs:\n\nNoisy sorting without resampling, Braverman et al.\n\nStochastically transitive models for pairwise comparisons: Statistical and computational issues, Shah et al.\n\nOn estimation in tournaments and graphs under monotonicity constraints, Chatterjee et al. \n\n\nSurvey (slightly dated):\n\nAn updated survey on the linear ordering problem for weighted or unweighted tournaments, Charon et al.\n\n\nConvex relaxation of permutation matrices:\n\nOn convex relaxation of graph isomorphism, Afalo et al.\n\nFacets of the linear ordering polytope, Grotschel\n\n", "rating": "3: Clear rejection", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}