{"title": "Potential impact, but comparison could better highlight improvements in practical applications", "review": "Deep Learning 3D Shapes using Alt-Az Anisotropic 2-Sphere Convolution\n\nThis paper presents a polar anisotropic convolution scheme on a unit sphere. The known non-shift-invariance problems of current manifold neural nets are avoided by replacing filter translation with filter rotation on a sphere. Spherical convolution are thus enabled and are rotation invariant compared to manifold convolutions. This shift also enables a proposed angular max-pooling scheme. Results are presented on mesh projections, shape classification and shape retrieval. \n\nThe paper generally reads well. Tackling the learning problem on a unit sphere has high potential, however, the proposed paper seems to be highly constrained by heuristics on a 2-sphere, such as constraining filters on a reduced rotation group to 2 rotations. This could be fine for many 3D application, but results may lack an exhaustive comparison with other spherical and manifold-based methods on the proposed experiments. Currently, several variants of data augmentations are used, and discussion may lack an explicit comparison with the state-of-the-art of spherical and spectral methods. This may impair understanding in which context the proposed method would work best.\n\n\nOther comments, possible clarification and improvements:\n\n[Method]\n- Can this be extended to unit 2-balls?\n- Isn't the \"alt-az rotation group\" the same as SO(3)?  If orientation is removed, what quotient group would this be?\n- What is the benefit of containing a filter on this quotient group rather than using convolution filters within the full rotation group?  Could a simple experiment convince the reader that the proposed approach is better than using convolutions in SO(3)?\n- Is there a dependence created by the spherical parameterization strategy?\n- How robust is the convolution scheme to topological defects, such as holes, noise?\n- Spherical images may induce parameterization distorsion if using a lat-lon grid, which would require complex variable filters on the spherical image. Are these variable filters burdening the computational complexity?\n- How to handle the distortion induced by the spherization process?\n- How to handle discontinuities around the sphere poles?\n- Computing geodesic may be costly - how does impact performance?\n- Does this rely on data augmentation to cover rotation invariance of filters?\n- Now icosahedrons are used - could the convolution work on an arbitrary mesh discretization, ranging from an ideal isoparametric sphere to a highly irregularly-triangulated mesh?\n- The remeshing strategy to a sphere also looses information from the original mesh connectivity - For instance, links between mesh nodes on the original surface may convey important information (e.g., brain connectivity in neuroscience), remising to a sphere would loose such connectivity information.\n\n[Results]\n- The experiments shows the proposed method with several augmented approaches - How exactly are data augmented?\n- Comparison with other spherical methods (Cohen et al 2018), or manifold-based methods (Monti et al 2018)?  Illustrating the pros and cons with these respective state-of-the-art?\n- Improvements could be better emphasized in Fig 6, Table 3 - how is the method better than others?\n", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}