{"title": "The paper is highly unconvincing ", "review": "This paper considers self-maps of metric spaces where the range is strictly smaller than the domain.  Under this condition this tries to show that such a map has a fixed point.  Now the paper suggests that such a \"weakly contractive\" map has a fixed point and tries to use such maps to find the global minima of functions.  \n\nEven if all the proofs in this paper were right I do not see what this has anything to do with learning and why such a paper has been submitted to ICLR! This paper should probably be submitted to an optimization journal!\n\nThe basic proofs here are completely unclear. Like in Lemma 1.2, its not even clear what the variable \"x\" is in the limit! The limit is being taken over the sequence index as far as I can see. Top of page 3 tries to describe an algorithm which can leverage weak contraction to get the global minima if it exists. But this description is hardly making any sense to me. I don't see how the function to be optimized is being used to define the weakly contractive \"T\" map in the paragraph just below the proof of Lemma 1.4. (How is that parameter \"h\" even chosen in the definitions of X^{>} and X^{\\leq}?) \n\nWithout a clear pseudocode there is almost nothing concrete in the paper to judge correctness by. The experiments are all set-up on standardized functions which have nothing to do with learning setups. So the relevance of the experiments is completely unclear, let alone the fact that the description is too muddled up.  \n\nAlso the notation used in the paper is highly non-standard and that makes reading very difficult. For example \"D\" seems to be the symbol for diameter of the metric space. So D is a property of the metric space (X,d) and its not a part of the definition of the metric-space as the weird notation \"(X,d and D)\" seems to suggest!  Also the definition 2 is ambiguous because it uses a {\\cal R} which doesnt seem to have been defined anywhere!\n\n", "rating": "3: Clear rejection", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}