{"title": "No substantial contribution, and large portions of the paper are unnecessary", "review": "Summary:\n\nThis paper considers the task of trail navigation task recently explored by Giusti et al. and Smolyanskiy et al. The authors describe their setup for physical experiments with a drone, and compare three neural network architectures for trail navigation on the IDSIA dataset. Experiments in a simulator are also reported.\n\n\nGood aspects of the paper:\n\nThe pairing of simulation with trail navigation is an interesting idea, though it is not explored much in this paper.\n\n\nBad aspects of the paper:\n\nAlthough the presence of physical experiments is suggested by pages 3 and 4, there are no physical experiments actually reported in the paper. In Section 5, this is revealed to be due to a hardware bug. The authors should not include these descriptions if they are not tied to reported experiments.\n\nOne of the main contributions of the paper is stated to be the comparison between neural network architectures. The two architectures compared to the TrailNet model from Smolyanskiy et al. are selected for their performance on the ImageNet classification task, and are shown to outperform TrailNet on salient metrics. However, comparing only three architectures is a very small comparison, and is not much of a contribution to the research problem.\n\nThis paper does not introduce new methods for approaching the problem of trail navigation. In its current form, it is a small comparison of existing classification architectures on the IDSIA dataset.\n\nThe paper also contains a number of minor errors. For instance, in Table 2 there is a footnote that leads nowhere, “introduced in Sif” is cited incorrectly, “in recent times jet (2014)” is cited incorrectly, and the figures are grainy (this isn’t really an error, but do try to make figures crisp in the future, e.g. with pdf images).", "rating": "3: Clear rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}