{"title": "Interesting paper with some missing depths in the analysis of the negative results ", "review": "The submitted paper proposes GATS, a RL model combining model-free and model-bases reinforcement learning. Estimated models of rewards and dynamics are used to perform rollouts in MTCS without actually interacting with the true environment. The authors theoretically and empirically evaluate their approach for low depths rollouts. Empirically they show improved sample complexity on the Atari game Pong.\n\nI think publishing negative research results is very important and should be done more often if we can learn from those results. But that is an aspect I feel this paper falls short at. I understand that the authors performed a great deal of effort trying to tune their model and evaluated many possible design choices, but they do not a provide a thorough investigation of the causes which make GATS \"fail\". I suggest that the authors try to understand the problems of MCTS with inaccurate models better with synthetic examples first. This could give insights into what the main sources of the problem are and how they might be circumvented. This would make the negative results much more insightful to the reader as each source of error is fully understood (e.g., beyond an error reate for predicting rewards which does not tell us about the distribution of errors which for example could have a big effect on the author's observations).\n\nAnother issue that needs further investigation is the author's \"hypothesis on negative results\". It would be great to experimentally underline the author's arguments. It is not trivial (at least to me) to fully see the \"expected\" interaction of learning dynamics and depths of rollouts. While MCTS should be optimal with any depths of rollouts given the true Q-function, the learning process seems more difficult to understand.\n\nI would also like the authors to clarify one aspect of their theoretical analysis. e_Q is defined as the error in the Q-estimate for any single state and action in the main text. This appears to be inconsistent with the proof in the appendix, making the bound miss a factor which is exponential in H (all possible x_H that can be reached within H steps). This would change the properties of the bound quite significantly. Maybe I missed something, so please clarify.\n\nOriginality mainly comes from the use of GANs in MCTS and the theoretical analysis.\n\nStrengths:\n- Interesting research at the intersection of model-free and model-based research\n- Lots of effort went into properly evaluating a wide range of possible design choices\n- Mainly well written\n\nWeaknesses:\n- Missing depths in providing a deep understanding of why the author's expectations and empirical findings are inconsistent\n- The authors use many tweaks and ideas to tune each component of their model making it difficult to draw conclusions about the exact contribution of each of these\n- Error in the theoretical analysis (?)\n\nMinor comment:\n* The paper would benefit from improved and more self-contained figure captions.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}