{"title": "Theoretical and experimental justifications are weak. ", "review": "This paper proposes a few shot learning method by exploiting the object-level relation between different images. The proposed method is based on neared neighbor search and concatenates feature maps of two input images into one feature map by considering all location combinations. Then for each slice of the location combination, the method applies fully connected layers g(). The outputs of g() are summed along location combinations and used as a feature to calculate the similarity of two inputs.  \n\nOverall, the idea of object relation is interesting. However, the proposed method is incremental from Relation Network (Learning2Compare Sun te al. 2017) and lacks theoretical and experimental justification why the proposed model works well. \n\nPros\n+ Interesting idea to improve the performance of few-shot learning. \n+ The performance improvements from Relation Network seems to be high. \n\nCons \n-Relation Network also concatenates feature maps of different objects. The main novelty of this paper seems to be all combination is considered in the concatenation and applied the separate network g() for each combination. However, why this feature extraction process works well is not theoretically justified.  \n\n-Relation Networks use different classification and learning scheme to this paper. Thus, it is not clear which parts of the proposed method, eg, the proposed concatenation procedure or the nearest neighbor model produced better results than Relational Networks. At least, the author should compare the performance when the proposed method concatenates two feature maps as in the Relation Network. \n\n-In the Sec.5, authors wrote that when the feature map size is 1 \\times 1 the proposed method corresponds to Relational Network. However, as far as I read the paper of Relational Network, the size of the feature map is not 1 \\times 1. \n\n-Each location of the feature map seems to be not an object. It needs more explanations why the feature of each location is an object. \n\n-It is not clear if the parameter of g() is common for all location combinations or learn different g() for each location combination. \n\n- Fig.2 lacks the explanation of the concatenation process of feature maps. The process is not only concatenation of feature maps, but concatenating features of all combination of location. It is hard to understand why the column size is w \\times h \\times w \\times h only writing it concatenation.  \n", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}