{"title": "Impressive result by combining existing ideas, but novelty in the algorithm is limited", "review": "This paper presents a state-of-the-art model on natural language to SQL task evaluated on the WikiSQL dataset and a subset of ATIS. The model combines several ideas, such as non-deterministic oracle, execution-guided strategy, cross attention between column names and question, and the introduction of “ANYCOL” symbol to augment the meaning representation. The main proposal is to use non-deterministic oracle to help with the “order-matters” issue. The evaluation on WikiSQL is solid but doesn’t strongly support the claim about non-deterministic oracle. More specific comments below. \n\nThe paper is well written. The model architecture and the techniques applied are clear and easy to follow. \n\nDespite the impressive result, my main concern is with the novelty. As the use of non-deterministic oracle seems to be a straightforward application of the idea from (Goldberg & Nivre, 2013), and doesn’t seem to make a significant difference. It is the use of “ANYCOL” that makes a bigger improvement, which, however, seems to be an augmentation of the meaning representation instead of an innovation in the learning algorithm. The result on the subset of ATIS helps, but it is less solid than the evaluation on WikiSQL because the dataset is too small (only 126 examples in the test set) and there are no external baselines. \n\nOverall, the paper is clear and the state-of-the-art result on WikiSQL is impressive, but the innovation in terms of the learning algorithm is limited and doesn’t seem to contribute much to the result. So the merits of this paper might be more suited for NLP venues. \n\nOne clarification question: \none page 4, “where r^A_a is a vector representation of the action a … as the concatenation of the action embedding and the parameter representation”. What does the \"parameter representation\" refer to here? \n\nMissing references: \n\nThe introduction discussed weakly supervised approach in “Without paired natural language statement…\". Several weakly supervised approaches were applied before on semantic parsing over tables (Pasupat & Liang, 2015) and a recent work (Liang et al., 2018) actually applied the weakly supervised approach to the WikiSQL dataset, which are worth mentioning. \n\nPanupong Pasupat, Percy Liang, Compositional Semantic Parsing on Semi-Structured Tables, Association for Computational Linguistics (ACL), 2015\n\nChen Liang, Mohammad Norouzi, Jonathan Berant, Quoc Le, Ni Lao, Memory Augmented Policy Optimization for Program Synthesis and Semantic Parsing, NIPS 2018", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}