{"title": "The motivation is not well justified", "review": "This paper uses a collection of methods (with minor improvements) to obtain good prediction performance on ImageNet-subset data. I sincerely recommend authors improving the paper's quality by offering more analysis and insights of their method.\n\n1. Could authors add more experiments on explaining their motivations?\n- The big motivation to their work is \"feature representations will become more similar as depth increases leading to easier classification\" (in the introduction). However, this is only supported with results in a small table in Appendix. C.\n- It is better to show results directly based on GCNZ, and then results on SGCN. \n- It seems that the performance in Table 6 and 1 (hop 2) are not consistent. Are there any reasons for this?\n- Except for accuracy, could author design some other measurement to evaluate the smoothness of the embedding in deeper layers? (perhaps t-SNE as Wang etal 2018).\n- All the above will make the paper sound more principle and better motivated. Currently, the motivation is not well justified.\n\n2. \"Rethinking\" indicates in-depth analysis of existing works, based on Q1, I suggest the author changes their title as well.\n\n3. The connections to ancestors and descendants look tricky. Are there any insight reasons for connecting and training in this way?\n- Specifically, the connectivity patterns in the graph is very complex. The authors have also said there can be DAG in the graph, so, why should we connect in this way?\n\n4. Can the proposed method be used on other kinds of data sets except those from the image domain?\n\n5. The motivation in this paper is inconsistent with experiments in Wang et al 2018. Wang has shown in Section:\"how important is the depth of GCN\" & Table 4 that the model performance increasing with the depth of layers. So, could the authors repeat the same experiments on NELL & NEIL? This will make the motivation more convincing.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}