{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "Comments and Questions : \n\n\t- The core contribution of the paper is to introduce a new architecture for a policy that is useful for successor features. This new architecture uses a variational information bottleneck approach and can be implemented readily on top of existing successor feature based approaches like USFA. \n\t- USFA are adapted for use in navigation tasks - but the paper seems to introduce two contributions based on transfer learning and stability in performance? It is not clear from the introduction what the exact contribution is. I think the paper needs better clarity and write-up. It is missing a lot of details and the core idea is not discussed in sufficient details to fully understand the contribution of the paper exactly. \n\t- It seems to me that the majority of the contribution comes from the new proposed architecture - but it somehow adapts an information bottleneck based approach? Why is this useful and what does information bottleneck mean in context of a policy for use in successor features?\n\t- I am not convinced by the proposed novelty of the paper - there are a lot of buzz terms like transfer learning and generalizability, and adapting this architecture for navigation tasks? Seems to me more like an adaptation of USFA for a navigation based tasks, and using a variational information bottleneck VIB based architecture only? \n\t- The overall contribution seems to be the useful of VIB in successor features, or more concretely for universal successor features and looking at the context of goal conditioned or latent variable conditioned policies? \n\t- The architecture has some novelty in terms of conditoning the policy based on the abstraction of future states for each action selection. I am not aware of this approach from previous works, but seems like an interesting idea for action selection and learing a policy conditioned on future visitation of states (eq : 7)\n\t- From the proposed set of experimental results, it is not clear whether the proposed method is indeed useful. Experimentally or even theoretically, the approach in the paper does not seem convincing enough. It requires more work and better clarity and presentation of the idea and results, including enough details. I would encourage the authors to present the core idea of the paper more concretely. \n\t- Overall, I do not think this paper is ready for acceptance, and would vote for a rejection. It requires significantly more work. \n"}