{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors propose a new \"higher-order\" convolution operation in which the parameters of a convolution are learned by a second function (e.g. another convolution operation). The idea is interesting and certainly more general than a standard convolution (if the second function is the identity we are back to a standard convolution). The proposal is motivated in the context of action recognition, where the authors argue that standard convolutions cannot handle the classification of actions that differ by small details (e.g. push an object from right to left vs. push an object from left to right). The proposal was evaluated on four data sets and attained results close or above the state-of-the-art.\n\nAs I mentioned in the summary, I like the overall idea, but I am not fully convinced that other models (such as 3D convolutions) would fail in these tasks. For instance, it would be interesting to see what is the total number of parameters of the models utilised in the experiments. On the other hand, is it nice to see that the proposal attains comparable results even when just trained with RGB inputs (that might mean that the model handles temporal information better).\n\nPros:\n- Simple and interesting idea that increases the representational power of convolutional networks.\n- The method was evaluated on four data sets and attains a reasonable performance.\n\nCons:\n- Experiments do not include an analysis of the performance of the model in the hard to differentiate actions (which is the main motivation for the proposal).\n- Writing of the method is quite convoluted and hard to follow.\n\nQuestions/Issues:\n- What is the number of parameters of the models utilised in the experiments?\n- From the abstract, the authors assume the readers know what they mean by \"higher-order\". However, it is only clear much later in the paper.\n- The authors claim that the architecture is necessary for recognition of actions that differ by small details. It would be nice to see an ablation study comparing the accuracy of the proposed on some of these hard to classify actions against one of the related methods.\n- Captions of tables could be more descriptive."}