{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper combines encoding and decoding of sequences within a single model component and uses masked language modelling for language translation task. Experiments were done for the task of translating Romanian to English and the reported results show that the model works successfully learns to perform the task.\n\nWhile the paper is well written and the model is clearly explained, I am not convinced about the soundness and the original contribution of the paper. The main arguments in support of my decision are as follows.\n\nI fail to comprehend the main novelty of the approach proposed in the paper. The model closely follows the masked language modelling and Transformer architecture. In my opinion, there should be a clear distinction with those models and an emphasis on the originality of the proposed approach. \n\nIt seems that the choice of decoding strategies has substantial impact on the performance of the model. In this paper, decoding strategies  followed in Devlin et al. How robust are these strategies with variation in the tasks? Is it possible to learn ps and pc for a given task? \n\nThe inequality in (11) is crucial for the model to learn. Although there is an empirical evidence of this shown in Fig. 3, there is no intuition explained in the paper. After all, the parameterized policy is learned in a greedy manner, so one would expect an argument in the line of stochastic gradient descent. \n\nThe advantage of the proposed method over Transformer in in the decoding complexity when T << I. I fail to see the guarantee of that happening. "}