{"title": "Manuscript is rough -- suggestion is to reject.  ", "review": "In Cutting Down Training Memory by Re-forwarding the authors present a method for structuring the computation graph of a DNN to save training time.  The authors given experiments that show that the method can save up to 80% training memory.\n\nThe idea paper is nice however, this draft needs more writing work to bring to a conference standard in my opinion.\n\nMy objection to the writing begins with the Definition and example of a “Close set” which I details below.  \n\nI also have further suggestions:\n\n\nQuestions & doubts\n\nDefinition 1 : Close set\n\n* A set of vertices and edges that start from v_i and that end at  v_j.\n \n1. Vertices don’t start or end at vertices so I am already confused\n2. No notation has been introduced yet for close set so I am not sure what i and j refer to.  Also I suspect you want “or” and not “and” otherwise there could only be one possible “edge” (i,j)\n\n* sij = {v,e} is called a close set such that ∀v1 ∈ sij, v1 has no edge to any v2 \\not\\in sij ∪ {vi , vj }\n\n1. Do you mean this is a set with two elements v and e?  Probably not?\n2. Is v1 and v2 meant to be generic vertices?  If so it quite unnatural to also use v_i and v_j.  I.e., probably the name of two specific vertices in your graph is “v1” and “v2”\n3. Another question is the close set s_{ij} unique or are their potentially multiple s_{ij}?\n\n* The edges of sij are all the edges between v1 , v2 ∈ sij , all the edges between vi and v ∈ sij \n\n1. Not getting what’s going with v1 and v2 versus vi and vj.\n\nExamples of close set \na Probably you should phrase as there can exist a close s_{2,4} since …\n\nAfter reading this I got general idea that close set correspond to connected component with no connections except to oldest ancestor and youngest child.  But that is a guess — the notation and precision in the definition as well as the examples led me to have too many doubts.\n\nAlso\n\nP3 Case(1) is n and N the same?\n\nWith respect to algorithm 5 Can you discuss its computation time?\n\nIn summary this is potentially interesting work but the writing should be sharper, their should be less ambiguity of interpretation of close set. \n\nI should note — this reviewer lacks confidence in his review in so far as they have next to zero experience with DNNs.  So if given the problems in the manuscript the contribution paper would be for example a key result for DNN training this reviewer would not be able to recognize it as such.\n", "rating": "4: Ok but not good enough - rejection", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}