{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposes a definition of privacy against attribute inference attack and formulates it as a minimax optimization problem that balances accuracy and privacy, it then provides an information-theoretic lower bound for the inference error. It also provides an analysis of the intrinsic privacy-utility tradeoff. Finally, it shows experimental evaluation in terms of inference error and accuracy of several representation-learning based approaches for protecting against attribute inference attack and compares with the lower bounded proved in the paper. By comparing utility with a differentially private algorithm, it shows that the other algorithm achieves higher utility under similar privacy.\n\nThe formulation of the minimax problem seems pretty interesting and the information-theoretic bound seems pretty useful in measuring inference risk based on the experimental results. \nAs for the comments and experiments with differential privacy, I’m not sure if I follow the argument correctly. It seems to me DP is stronger than the privacy guarantee defined in the paper, as it prevents an adversary from knowing whether record x or x’ is in the dataset, which I think directly implies that an adversary won’t be able to infer whether a record with attribute A or A’ (with the rest of the attributes kept) is in the dataset. Can you comment more on that side? Besides, there were two epsilon values used in the experiments for DP. As your goal is not to guarantee DP anyway, I think it makes sense to try more epsilon values, especially much larger epsilon values, as the analyzed epsilon is sometimes pretty loose upper bound."}