{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "In this study, the authors propose a regularizer for the dense layers of a deep network that consists in penalizing pairs of neurons that share similar connectivity with previous layers but have different responses. The study shows that the regularizer has three effects:\n(i) it promote the emergence of cell assemblies with similar connectivity and firing patterns\n(ii) it promotes target-class selectivity of individual neurons \n(iii) it substantially improves performance of few-shot learning on MNIST and Fashion-MNIST compared to vanilla networks and an alternative few-shot learning method (imitation networks, Kimura et al. 2018)\n\nAlthough this study is intriguing (especially (iii)), I would tend not to recommend acceptance  at this time because the presentation has issues, and the test cases of the method are too limited (MNIST and Fashion-MNIST)\n\nPros:\n- interesting result on few-shot learning.\n- intriguing connection to biology\n\nCons:\n\n1) typos, bad english wording and incorrect grammar makes the article hard to read, e.g., \"Efficient connectivity presents topologically in most BNNs due to the physical restrictions of dendrites and axons (Rivera-Alba et al. (2014)) and for energy efficiency.\" (no verb, this is just one example among many ill-constructed sentences)\n\n2) The section describing backpropagation and the chain rule is not necessary.\n\n3) The importance of the first two results is overemphasized. It is expected that this regularizer would promote cell assemblies and class selectivity and does not constitute an important result for ML.\n\n4) The correspondence to biology of class selectivity and cell assembly is not convincingly referenced:  \nTononi & Sporns (2003) is a model and does not present experimental evidence for cell assemblies in the visual cortex\nPeyrache et al. (2010) find cell assemblies in the prefrontal cortex, which is different than the visual system (decision center).\n\n5) It would be important to test that this regularizer also enhances few-shot learning on some more complicated tasks such as CIFAR-10.\n\n\nAdditional Feedback:\n\n- It would be interesting to develop a theory explaining why this regularizer is helpful for few shot learning.\n\n\n\n\n\n"}