{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "\nThe paper proposes a scheme to learn representations and a random\nforest model in a closely coupled manner, where the representations\nare learned to simultaneously improve the predictive performance of\nthe individual trees in the random forest and reduce the correlation\nbetween these trees. This is achieved via a novel triplet sampling\nscheme where the positive samples are used to improve the predictive\nperformance of the individual trees, while the negative samples are\nused to reduce the correlation between the trees. The empirical\nresults indicate the improvement of the proposed scheme over random\nforests learned over the original representations across various\ndatasets. \n\nThe manuscript is well presented and I am leaning towards accept, one\nmajor issue with this manuscript is the number of pages which crosses\nthe 8 page recommended limit in the ICLR CfP. Given that higher\nstandard, I feel that there are multiple minor issues which should be\naddressed. \n\n- It is not clear why the proposed scheme is especially well suited\n  for \"domain generalization\" and \"visual recognition\" and not for\n  general supervised classification tasks (like those on CIFAR, SVHN,\n  etc). This needs to be clarified.\n- The theoretical results for random forest rely on the independence\n  of the individual trees. Given that the trees in the random forest\n  are no longer independent in the proposed scheme, the upper bound in\n  Equation (1) may no longer be valid. While this does not affect the\n  empirical performance, it might be good to discuss the theoretical\n  implications of the proposed scheme.\n- It is not clear why the curves for the canonical features in Figure\n  3 not improving with the number of iterations (which corresponds to\n  number of trees to the best of my understanding). The results in\n  Table 1 do indicate improvement in the performance with canonical\n  features, putting Figure 3 and Table 1 at odds.\n\n\nMinor:\n\n- The individual trees in a random forest are supposed to have low\n  bias but high variance, and the heterogeneity between the trees is\n  supposed to squash the variance with the bagging. The introduction\n  mentions that the individual trees in the forest are \"less\n  biased\". Maybe this is because of our different definitions of bias\n  but any clarification here would be helpful.\n"}