{"title": "Interesting application of PushSum, but how does it fare relative to AD-PSGD?", "review": "# overview\nThis paper leverages a consensus based approach for computing and communicating approximate gradient averages to each node running a decentralized version of stochastic gradient descent.\n\nThough the PushSum idea isn't new, its application to distributed SGD and corresponding convergence analysis represents a valuable contribution, and the experimental results indicate a potentially large speedup (in highly variable or latent networks) without substantially sacrificing model accuracy.\n\nThe paper itself is reasonably comprehensive but does miss out on comparisons with more recent but equally promising approaches, namely AD-PSGD. \n\n# pros\n* Empirically shown to be significantly faster than SGD, D-PSGD in high-latency, communication bound configurations which is a fairly common real-world setup. There is an accuracy tradeoff at work here, but performance doesn't seem to suffer too much as the node count scales.\n* introduces and proves theoretical guarantees for SGP approximate distributed average convergence for smooth, non-convex case, including upper bounded convergence rates.\n\n# cons\n* biggest criticism is that AD-PSGD from Lian et al 2018 is not included in experimental comparisons even though the paper is referenced. Authors state that asynchronous methods typically generalize worse than their synchonous counterparts but that isn't what Lian et al found in their comparison with D-PSGD (see table 2 and 3 from their paper). This comparison would be particularly interesting as AD-PSGD also performs well in the high network latency regime that SGP is touted for.\n* would've liked to see comparison on other tasks beyond just image classification on ResNet.\n\n# other comments\n* Didn't see mention of specific iteration count value(s) K used in experiments or hyperparameters A.3. Since it bounds the convergence rate, this would be important to include.\n* Found a few small typos:\n  * pg. 5: Relatively -> Relative\n  * pg. 7, fig. 2: part -> par\n  * pg. 8, sec. 5.3. par. 2: achieves -> achieved\n  * pg. 8, sec. 5.3, par. 2: \"neighbors also to increases\" (drop \"to\")\n  * pg. 12, sec. A.2: \"send-buffer to filled\" -> \"send-buffer to be filled\"", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}