{"title": "The paper \"RELWALK – A LATENT VARIABLE MODEL APPROACH TO KNOWLEDGE GRAPH EMBEDDING\" is about a generative knowledge graph embedding process and a theoretic motivation for a corresponding scoring function.", "review": "+ Theoretic explanation for the scoring function.\n+ (Promise for) Online provided source code.\n+ The paper is well-written.\n\n- The authors missed [1] which also introduces a generative model for knowledge graph embeddings. \n- The use of the datasets FB15k-237 and WN18RR instead of FB15k and WN18 (without inverse relations) would enable a better empirical evaluation. By using the flawed FB15k and WN18 datasets, the evaluation is biased towards the usage of inverse relations which should not exist in a link prediction evaluation dataset.\n- The authors are not mentioning and comparing to walk based approaches like node2vec [2], Deepwalk [3], and rdf2vec [4]. \n\n\nDue to the missing comparisons to the mentioned references above and the possible bias in the evaluation, I am leaning towards rejecting the paper.\n\n\nMinor comments:\n\n. Abbreviations like h for head are used before they are introduced.\n. \"The the\" -> \"The\"\n. \"triples are likely too be obvious examples\" -> \"triples are likely to be obvious examples\"\n\n\n[1] Xiao, Han, Minlie Huang, and Xiaoyan Zhu. \"TransG: A generative model for knowledge graph embedding.\" Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Vol. 1. 2016.\n\n[2] Grover, Aditya, and Jure Leskovec. \"node2vec: Scalable feature learning for networks.\" Proceedings of the 22nd ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 2016.\n\n[3]  Perozzi, Bryan, Rami Al-Rfou, and Steven Skiena. \"Deepwalk: Online learning of social representations.\" Proceedings of the 20th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 2014.\n\n[4] Petar Ristoski, Jessica Rosati, Tommaso Di Noia, Renato De Leone, and Heiko Paulheim. \"RDF2Vec: RDF Graph Embeddings and Their Applications.\" SWJ http://www.semantic-web-journal.net/content/rdf2vec-rdf-graph-embeddings-and-their-applications-1", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}