{"title": "Very interesting paper but many design choices not validated", "review": "TITLE\nMeta-learning for stochastic gradient mcmc\n\nREVIEW SUMMARY\nA wonderful paper with many great ideas and insights. Main weakness is the complexity of the algorithms and many design choices wich are well argued for but not theoretically or empirically well founded.  \n\nPAPER SUMMARY\nThe main idea (based on the result of Ma et al.'s \"complete recipe for stochastic gradient mcmc\") is to parameterize the diffusion and curl matrices by neural networks and (meta-)learn/optimize an sg-mcmc algorithm. \n\nQUALITY\nThe technical quality of the paper appears to be good. Due to the complexity of the algorithm and lack of access to authors code at review time, it is not feasible for me to validate empirical results.\n\nMy main critisism of this work is that the proposed procedure is quite complicated, and there are a lot of steps and design choices that are made in the paper which are not backed up by theory or experiment. For example, the structure and parametrization of D and Q. I would like to have seen e.g. empirical results on full matrices compared to the particular \"diagonal\" struture used, to give an idea of how much we loose by that design choise. Similarly, the choice of meta learning objective is not (to me at least) obvious, and this could be examined further. Also, the use of the Stein gradient estimator is known sometimes to be problematic (maybe particularly with an rbf kernel) but this is not explored.\n\nAll in all, the paper leaves me wanting more, but of course there is only so much space in a conference paper. My conclusion here is that I recommend that the paper is published as it is, and I hope the authors will continue their work in future research (as also outlined in the paper). \n\nCLARITY\nThe paper is clear and well written, notation is consistent, and everything is fairly easy to follow.\n\nORIGINALITY\nThe idea of meta learning sg-mcmc is not something I have seen before, so to my knowledge the idea is original. \n\nSIGNIFICANCE\nI think the whole line of research in which this paper falls has a very high potential, and i strongly welcome any new results. This paper develops new interesting ideas of broad interest.\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}