{"title": "Good theoretical contribution; empirical results could be more extensive", "review": "Summary\n=======\nThis paper introduces spread divergences. Spread divergences are obtained by taking the divergence between smoothed/noisy versions of two distributions. A spread divergence between two distributions of non-overlapping support can be defined even when the corresponding divergence is not. The authors discuss conditions under which the data generating process can be identified by minimizing spread divergences and apply spread divergences to the examples of PCA, ICA, and noiseless VAE.\n\nReview\n======\nWith a lot of papers focusing on generative modeling, divergence minimization is of great relevance to the ICLR community. Adding noise to distributions to ensure overlapping support is intuitive and has been used to stabilize training of GANs, but I am unaware of any work focusing on questions of identifiability and efficiency. I especially like the example of slowing EM in ICA with small noise. Here, some empirical results are lacking which analyze the speed/correctness of the identification of parameters for various choices of divergence/model noise. These would have greatly enhanced the paper. Instead, the available space was used to show model samples, which I find less helpful.\n\nIn Section 3.2 and Section 6 the authors argue that choosing noise which maximizes the spread divergence is optimal or at least preferable. This seems counterintuitive, given that the point of the noise was to make the distributions more similar. Please elaborate on why maximizing the divergence is a good strategy.\n\nMinor\n=====\nThe paper seems hastily written, with some grammar issues, typos, and sloppy use of LaTeX, e.g.:\n\n– \"-\\log\" instead of \"\\log\" in definition of KL divergence in the introduction\n– \"Section 2.2\" not \"section(2.2)\", \"Equation 24\" not \"equation(24)\"\n– \"model (Tipping & Bishop, 1999)\" instead of \"model Tipping & Bishop (1999)\"\n– \"\\mid\" instead of \"|\"\n– \"x\" instead of \"y\" in Equation 28\n\nPlease provide a reference for the EM algorithm of ICA.", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}