{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "title": "Official Blind Review #3", "review": "The paper proposed a generative model for image style transfer in real time. In particular, comparing to the existing work, the proposed method is able to generate a series of transferred images instead of one, and more importantly, users can adjust different parameters without re-training the network to control over the synthesized output. The proposed method was evaluated on publicly-available datasets, and achieved convincing experimental results.\n\nPros:\n- The problems that the paper tried to solve is interesting and important. I think the proposed model could make some contributions to related research communities.\n- The idea of learning and incorporating \"adjustable loss weights\" is interesting and reasonable.\n- The paper is well written and easy to understand.\n- Experimental results appear to be promising.\n\nCons:\n- The \"adjust loss weights\" are able to control the synthesized output, but does each of them have a particular meaning? For example, if I want to generate other outputs more realistic, colorful, or in other styles, is it possible for the users to (roughly) know which parameter should be adjust, and how?\n- Following the above question, I suggest the authors to provide more qualitative results with different \"loss weights\", and give some detailed explanations.\n- Some typos and missing links could be corrected.\n\nI think the proposed approach is reasonable and and experimental results are convincing. I'm not an expert in this area, and I'm not sure about the method's novelty. If other reviewers find other existing work that proposed very similar ideas, then this would have an impact on my recommendation.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory."}