{"title": "Experimental section", "review": "This paper introduces a new way of interpreting the VQ-VAE, \nand proposes a new training algorithm based on the soft EM clustering. \n\nI think the technical aspect of this paper is written concisely. \nIntroducing the interpretation as hard EM seems natural for me, and the extension\nto the soft EM training is sound reasonable. \nMathematical complication is limited, this is also a plus for many non-expert readers. \n\nI'm feeling difficulties in understanding the experimental part.\nTo be honest, I think the experimental section is highly unorganized, not a quality for ICLR submission. \nI'm just wondering why this happens, given clean and organized technical sections...\n\nFirst, I'm confusing what is the main competent in the Table 1. \nIn the last paragraph of the page 6, it reads; \n\"Our implementation of VQ-VAE achieves a significantly better BLEU score and faster decoding speed compared to (10).\"\nHowever, Ref. (10) is not mentioned in the Table 1. Which BLEU is the score of Ref. (10)? \n\nSecond, terms \"VQ-VAE\", (soft?)\"EM\" and \"our {model, approach}\" are used in a confusing manner. \nFor example, in Table 1, below the row \"Our Results\", there are:\n- VQ-VAE\n- VQ-VAE with EM\n- VQ-VAE + distillation\n- VQ-VAE with EM + distillation\n\nThe \"VQ-VAE\" is not the proposed model, correct? \nMy understanding is that the proposal is a VQ-VAE solved via soft EM, which corresponds to \"VQ-VAE with EM\". \n\nThird, a paragraph \"Robustness of EM to Hyperparameters\" is mis-leading. \nThe figure 3 does not show the robustness against a hyperparameter. \nIt shows the BLEU against the number of \"samples\" (in fact, there is no explanation about what the \"samples\" means). \nI think hyperparameters are model constants such as the learning rate of the SGD, alpha-beta params for Adam, dimension of hidden units, number of layers, etc. The number of samples are not considered as a model hyperparameter; it's a dataset property. \nThe figure 5 shows the reconstructed images of the original VQ-VAE and the proposed VQ-VAE with EM. \nHowever, there is no explanation which hyperparameter is tested to assess \"the robustness to hyperparameters\". \n\nFourth, there is no experimental report on the image reconstructions (with CIFAR and SVHN) in the main manuscript. \nIn fact, there is a short paragraph that mentions about the SVHN results, \nbut it only refers to the appendix. \nI think appendix is basically used for additional results or proofs, that are not essential for the main message of the paper. \nHowever, performance in the image reconstruction is one of the main claims written in the abstract, the intro, etc. \nSo, the authors should include the image reconstruction results in the main body of the paper. \nOtherwise, claims about the image reconstructions should be removed from the abstract, etc. \n\n\n+ Insightful understanding of the VQ-VAE as hard EM clustering\n+ Natural and reasonable extension to soft-EM based training of the VQ-VAE\n-- Unorganized experiment section. This simply ruins the quality of the technical part. \n\n\n## after feedback\n\nSome of my concerns are addressed the feedback. \nConsidering the interesting technical parts, I raise the score upward, to the positive side. ", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}