{"title": "Explore GAs as alternative for DeepRL ", "review": "The authors explore the use of GAs as an alternative to gradient based methods for DeepRL and show performance comparisons indicating competitive /on par performance when compared to the existing methods. \n\nPros:\n-I liked the idea of exploring other avenues for approaching DeepRL problems, and challenging existing paradigms or trends. \nThis has a couple of implications - it might lead to expanding the toolbox for DeepRL problems, and it also might lend insight regarding these problems that could lead to new directions in exploring other methods. In other words, exploring WHY GA do better (and even RS!) could be useful, and this study is a foray in that direction. \nIt could also (as they point out) lead to useful hybrid approaches.\n-Their implementation will be made available and includes some useful features (compact network encoding, etc). \n-They demonstrate very nice speeds that can be impactful especially for more resource limited scenarios. \n\nCons: \n-There has been some exploration of use of GA for games, though not in DeepRL (AFAIK). They should cite previous efforts and explain what is their contribution specifically above and beyond previous efforts.\n-Although I applaud the authors for making exploratory efforts into this alternative approach and demonstrating competitive performance, the reader is left with some degree of \"so what?\". In other words, WHEN should this method be applied? How does it fit into the existing toolkit?\n-This is in some ways a conceptual exploration, and it shows interesting things that open \"why\" questions. Why does GA do better in some cases? They address this nicely in the discussion but more exploration in that direction would be useful. \n\nOverall I like this paper for its conceptual contribution that may provide insight that will help the field grow in interesting directions, and for the implementation it will provide. \n\n\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}