{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1093", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "<Strengths> \n+ This paper proposes a novel task named automatic science journalism to produce a press release from a scientific paper. Its specialty lies in that it requires summarization of a long text to another long text with extreme paraphrasing. \n+ It is a clever idea to couple a scientific paper with its corresponding news article to build a new large-scale dataset. \n+ The paper reads very well. \n\n<Weakness>\n1. This paper has no technical novelty. \n- It simply applies two existing models to new corpora, including FCONV as a vanilla CONV seq2seq model and STORY as  a SOTA neural story generation model.\n\n2. Experiments are done in a preliminary way. \n- Although this paper ambitiously proposes the automatic science journalism as a new challenging summarization task, what is actually done is nothing but primitive experiments about basic transfer learning. For example, the paper simply measures the ROUGE scores between three different configurations of the dataset: BASE, AB and PART.\n- The proposed evaluation metric is reasonable defined based on classification probability. However, it is far from saying that it can measure the actual target factuality, which is abstract and hard to be gauged even by human. \n\n<Minor comments>\n- The survey for neural text summarization is too short and cursory in Section 2. While it is an active research area in NLP, only three papers are referred. \n\n\n<Conclusion>\nAlthough this paper has a strong potential to be a good piece of work in terms of a new application and novel datasets. However, it is still largely incomplete and there are big gaps between what is aimed to do and what is actually done; as a result, it may not be yet ready for publication and have much to be done, in my opinion. \n\n"}