{"rating": "6: Weak Accept", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper shows that the maximum softmax probability is useful for uncertainty estimation on in-class data and not just for detecting out-of-distribution data. They argue this with the Bayes Ratio, which here is an uncertainty estimation quality measure that seems worth exploring more for assessing the quality of uncertainty estimation techniques. The community is still in need of a good uncertainty estimation measure (Brier score is too tangled with accuracy, has low numerical resolution, and hardly penalizes consistent overconfidence; AUROC for error detection doesn't budge; the Soft-F1 score is without theoretical motivation; area under the response rate recall curve is too close to 1 when accuracy is high), and this could be it. They evaluate on ImageNet-1K, which most uncertainty estimation papers fail to consider. By considering CIFAR-10, CIFAR-100, and ImageNet, we get fuller picture of the ranking of the utility of many uncertainty estimators, which is somewhat important for the community. This paper is currently borderline, in that what it proposes is simple, but perhaps too simple. Its empirical contributions are fairly minimal, though its proposal of the Bayes Ratio for uncertainty estimation quality assessment could quite impactful.\n\nSmaller Notes:\nFigure 1 should be on page 3 not 2. \n\nSome content in Appendix B should be incorporated in Section 5.1\n\n> In the odds have increased\nIf\n\nB.3 should have a worked example in our setting as well\nEqn (19) should say > 65 not <65\n\nNotation of Y is confusing when it means a binning of U. Perhaps use \"B\"?\n\nIs the histogram adaptively computed? Is that what “chosen to have equal weight” means?\n\nPerhaps compare the Bayes ratio with RMS Calibration Error, AURRA, or AUROC for error detection."}