{"title": "This paper proposes a series of metrics and generative models to evaluate different approximate inference frameworks.", "review": "Updated to reflect author response:\n\nThis paper proposes a series of metrics to use with  a collection of generative models to evaluate different approximate inference frameworks. The generative models are designed to be synthetic and not specialized to a particular task. The paper is clearly written and the motivation is very clear.\n\nWhile there has been work like Forestdb to maintain a collection of generative models, I don't believe\nthere has been work to evaluate how they perform on a series of metrics. There would be great utility\nin having a less ad-hoc way to evaluate inference algorithms.\n\nWhile the idea is sound, the work still feels a bit incomplete. The only distributions used in the experimental section seem to be Gaussians and Mixture of Gaussians. Many more families of distributions are mentioned in Section 3, and it would have been nice to show some evaluation of them considering the code is already there. In addition to distributions mentioned in Section 3, it would help if there were a few larger dimensional distributions. Often for evaluation now, many papers\nuse a Deep Gaussian model trained to model MNIST digits. I worry that insights drawn from\nthe synthetic examples won't transfer when the models are applied to real-world tasks.\n\nI would like to see described a wider variety of models, including possibly more models with\ndiscrete latent variables as much recent literature is currently exploring.\n\nThe paper is a bit confusing in how it discusses distributions and models. Distributions form the ground truth we compare different trained models to.  It would been more clear for me if the explanation with supplemented with some notation to describe who will compare draws from the true data distributions to samples from each of the trained generative models.\n\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}