{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The paper proposes a generative adversarial net model for heterogeneous dose-response causal effect estimation. The idea is to generate counterfactual dose-response curves using the generator that can fool the discriminator that tries to distinguish between factual data and counterfactual data. Factual data along with counterfactual data generated by the GAN can then be used for heterogeneous causal effect estimation. \n\nTo tailor to this specific heterogeneous dose-response curve estimation problem, the paper makes various architectural design modification from a regular GAN, such as using factual predictive performance as regularization, multitask for treatment option and dosage in the generator, hierarchical decomposition of the dose and response prediction in the discriminator, and permutation invariance when predicting the dosage-response curves for various treatment in the discriminator. These design choices are reasonably explained and the empirical gains due to these design choices are well documented (Table 2).\n\nA few concerns:\n\n1. It is unclear why using a GAN that seeks to produce samples that are indistinguishable from the factual ones will be the right way to synthesize counterfactual samples. Intuition and further justification need to be provided. Related to this concern, do the authors also implicitly reason under the consistency assumption (the observed/factual samples are the realizations potential outcomes of the corresponding treatment-dosage pairs in the potential outcome framework) ? If so, the authors should also reflect that in their list of assumptions.\n\n2. It is also unclear what kind of theoretical guarantees the proposed method could deliver. Since the setting considered by the paper is to formally estimate the dosage-response effect, such guarantees, while potentially challenging to derive, are nonetheless crucial to better understand the circumstances under which the proposed method is reliable/unreliable.  This is especially the case given the elusive use of GAN to generate counterfactual outcomes as mentioned in the previous concern.\n\n3. It will also be interesting to see whether the proposed method can be degenerated to handle simpler cases such as heterogeneous treatment effect estimation of binary treatment.  Or alternatively, when there is only one treatment option, where when treated there is a dosage-response curve while when not treated the dosage is zero. Related to this question, is this also the way to parameterize whether a subject receives a treatment or not in the model?\n\n"}