{"title": "Misleading title and not novel enough.", "review": "The paper proposes to use a gabor and schmid operators as first layer in a CNN\nand to do gradient descent to their parameters.\nI think that the title is over-selling and that ultimately misleads the reader.\n\nClarity needs to be improved and the text should be polished, it contains lot \nof repetitions for example.\n\nIn the contribution the author mention a new framework, I think it is better to\nsay it is a different layer for convolutional networks as the computational\nparadigm is exactly the same. \n\nIn the related work the authors try to motivate their approach but I am afraid \nin a too hand-wavy manner. For example for gabor it is written that is based \non human vision. Even if this has been shown, to some degree, by Hubel and Wiesel\nwhy would this work for a CNN that has nothing to do with the human vision?\n\nIn Section 3.2.1 it is mentioned that gabor may be an optimal feature extractor,\nwhat does it mean? Optimal with respect to what? Overall the section is too \nvague and does not seem, frankly, to make any good point.\n\nThe two operators proposed in the work are indeed differentiable, but use \nperiodic functions and divisions that could trigger numerical issues and instabilities\nduring training. This should be addressed in the text.\n\nI find the many definitions, theorems and corollaries overwhelming considering\nwhat is in the end proposed.\n\nExperiments are too weak and not sufficient to draw any conclusions. \nIn 5.1 please do at least 10 runs and report mean and variance.\nAdversarial stability is misleading as it has nothing to do with adversarial \nexamples but it is rather an ablation study.\nThe experiment on generalization is using the test set for training to make\nuse of small amount of data, but this makes things completely not comparable. \nUse rather a random subset of the training set as it is customary to do.\n\nOverall I don't find the motivation of this strong enough, in fact DL research \nseems to move in the opposite direction, and results are not convincing.", "rating": "2: Strong rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}