{"rating": "8: Accept", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "This paper compares to approaches to bilingual lexicon induction, one which relies on joint training and the other which relies on projecting two languages' representations into a shared space. It also shows which method performs better on which of three tasks (lexicon induction, NER and MT). The paper includes an impressive number of comparisons and tasks which illuminate these two popular methods, making this a useful contribution. It also compares contextualized to non-contextualized embeddings.\n\nI have some questions:\n-can you goldilocks the amount of sharing in an alignment method? Put a different way, how much is performance affected if you perform alignment w/variously sized sub-partitions of the seed dictionary? Can you find a core lexicon (perhaps most common words shared cross-lingually) that will provide a good-enough alignment to joint-align with? If you were very ambitious, you could try artificially vary the amount of lexicon disjointness across languages (for camera-ready) and report how much your results are affected by incomplete overlap in translation variants.\n-for Table 1, do you have any ideas about why certain languages do better on eng--> them and others do better on them-->eng?\n-do you have any analysis exploring what is shared? wrt this sentence \"It also suggests detecting what to share is crucial to achieve better cross-lingual transfer.\"\n\nPlease address:\n- I would like more intuitive motivation for (6).\n\nSmall notes: \n-Fig. 1 font is too small, you could also remove excess axes. There's also overlap between the labeled arrow and the y-axis label btw (a) and (b).\n-\"oversharing\" should be typographically delimited as a definition in \"We refer to this problem as oversharing\"\n-typos: bottom of p4: \"Secition 2.3\"\n-\"e.g.\" or \"i.e.\" should be followed by a \",\"\n-list which languages you use on bottom of p5\n-Table 3 caption looks crazy, what happened to your spacing there?"}