{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "################################################################################\nSummary:\n\nThe paper provides a interesting direction in the meta-learning filed. In particular, it proposes to enhance meta learning performance by fully exploring relations across multiple tasks. To capture such information, the authors develop a heterogeneity-aware meta-learning framework by introducing a novel architecture--meta-knowledge graph, which can dynamically find the most relevant structure for new tasks.\n\n\n################################################################################\nReasons for score:\n\nOverall, I vote for accepting. I like the idea of mining the relation between tasks and handle it by the proposed meta-knowledge graph. My major concern is about the clarity of the paper and some additional ablation models (see cons below). Hopefully the authors can address my concern in the rebuttal period. \n\n################################################################################\nPros:\n\n1. The paper takes one of the most important issue of meta-learning: task heterogeneity. For me, the problem itself is real and practical.\n\n2. The proposed meta-knowledge graph is novel for capturing the relation between tasks and address the problem of task heterogeneity. \nGraph structure provides a more flexible way of modeling relations.\nThe design for using the prototype-based relational graph to query the meta-knowledge graph is reasonable and interesting.\n\n3. This paper provides comprehensive experiments, including both qualitative analysis and quantitative results,  to show the effectiveness of the proposed framework. The newly constructed Art-Multi dataset further enhances the difficulty of tasks and makes the performance more convincing.\n\n################################################################################\nCons:\n\n1. Although the proposed method provides several ablation studies, I still suggest the authors to conduct the following ablation studies to enhance the quality of the paper:\n(1) It might be valuable to investigate the modulation function. In the paper, the authors compare sigmoid, tanh, and Film layer. Can the authors analyze the results by reducing the number of gating parameters in Eq. 10 by sharing the gate value of each filter in Conv layers?\n\n(2) What is the performance of the proposed model by changing the type of aggregators?\n\n2. For the autoencoder aggregator, it would be better to provide more details about it, which seems not very clear to me. \n\n3. In the qualitative analysis (i.e., Figure 2 and Figure 3), the authors provide one visualization for each task. It would be more convincing if the authors can provide more cases in the rebuttal period.\n\n\n################################################################################\nQuestions during rebuttal period:\n\nPlease address and clarify the cons above\n\n################################################################################\nSome typos:\n(1) Table 7: I. no sample-level graph -> I. no prototype-based graph\n(2) 5.1 Hyperparameter Settings: we try both sigmoid, tanh Film -> we try both sigmoid, tanh, \nFilm.\n(3) parameteric -> parametric\n(4) Table 2: Origninal -> original\n(5) Section 4 first paragraph:  The enhanced prototype representation -> The enhanced prototype representations\n"}