{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "Summary of the paper: In this paper, the authors proposed a simple method for GZSL through the inductive transfer of attribute semantics through training with soft-labeling. Experimentally the proposed method appears to achieve state-of-art performance on a widely used benchmark.\n\nKey Contributions:\nThe paper demonstrate that SoA performance is achievable by carefully shaping a loss function that encourages learning the discriminator and transferring from seen to unseen classes.\n\nComments:\nThe proposed method is simple both conceptually and in implementation, yet achieves SoA performance. This is a pleasantly surprising result as this method deviates from the current landscape of multi-part models. I have read (but have not run) the code attached to the submission and the results do seem reproducible.\nThe model used by the authors is similar to Romera-Paredes (2015), but is used on GZSL rather than ZSL and trained differently. Additionally, soft-labeling on GZSL has been previously explored by Wu et al (2018). I would like to see the authors highlight the connections and differences to these prior works.\nThe usefulness of the equations in section 3 appears marginal. The rather lengthy exposition distracts away from a simple method that can be presented more elegantly. However, this is not a major concern.\nWith the simplicity of the proposed methods, there are missed opportunities in exploring how visual features are mapped into attributes. Due to the unusual nature of the proposed method, visualizations will make the results more convincing.\nMy main concern with the paper is the poor writing quality. Grammatical errors and ill-drawn sentences are distracting readers away from the ideas being presented. Some variables in equations are used before their definition. The paper is not suited for publication in its current state.\n\nConclusion:\nI find this paper difficult to judge in the dimension of impactfulness as it presents an effective yet simple method that is of wide interest to the ZSL community, but the lack of any theoretical analysis or methodological contributions renders the paper quite dry. The writing also requires improvement to reach publication quality. I am willing to raise the rating depending on further iterations of the manuscript.\n\nReferences:\nBernardino Romera-Paredes, Philip H. S. Torr (2015) An embarrassingly simple approach to zero-shot learning. https://arxiv.org/pdf/1806.08503.pdf\n\nFan Wu, Kai Tian, Jihong Guan, Shuigeng Zhou. (2018) Global Semantic Consistency for Zero-Shot Learning. https://arxiv.org/pdf/1806.08503.pdf\n"}