{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper addresses the problem of generalized zero shot learning, a multi-class classification problem in which the test example can be from a class that is unseen before as well as from a seen class. Side information about labels is given in terms of attributes. The proposed model, augments training labels, with imputed soft labels for unseen classes.  The label imputation for each label takes into account the similarity between the unseen label and seen labels in terms of attributes. Then a classification model on the new label set is learned, with a multilayer perceptron. The model is evaluated on five ZSL datasets and the results are in favor of the paper for some of the experiments.\n\nClarity and soundness:\nI find this paper hard to read, mainly since the specifics of the method is Section 3.2 and 3.3 are not motivated or justified enough.\nIn particular: seems like the imputed value of a soft label in Equation (1) takes into account only the closeness of the unseen label to seen labels (in terms of attributes), but not that if the specific seen label is active or inactive for the data point. How is that reasonable or justified? \n\nSignificance:\n- It is not that either the idea or technicalities of the method, or the experimental evaluation reveal a strong significance of the method. \n -About the problem setting, the attributes for unseen labels must be present at training time. A more general and useful setting, can be one in which such attributes for unseen classes can become available only later at the inference time. \n\n\nDecision: Reject. \n\nMinor:\n\n- It is not clear what \\bar{y}_k^s is  in (6). Is it the same as z_k^s?\n- What norm of matrix W is used in the last term of (3)?\n- It is useful for reader to state early on in the paper that the classification setting considered in the paper is multiclass as opposed to multilabel. Currently it takes until training strategy in Section 3 for this to be clearly mentioned.\n- \"It is not difficult to see that this lack of training samples biases the learning process towards seen classes only\".  Is this with the assumption that unseen labels are set to zero at training time? \n- \"architecture, We\" "}