{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper deals with the important issue of information extraction from less-resourced languages.\nIn its current form, the paper has two main weaknesses:\n- it is poorly written & organized\n- it was a fairly weak empirical evaluation\n\nIn order to address the first issue:\n- the authors should significantly improve the quality of the prose, which can be confusing & difficult to undersrand\n- the introduction needs to be significantly crisper: in its current form, it is far too general and does NOT describe the rest of the paper; the authors should explain ...\n   1) what is the problem they are working on (currently present, but far too long) \n   2) what is the proposed approach & why is it novel (missing)  \n   3) what are the main results & their significance (also missing)\n\nIn order to address the second issue:\n- 3.1 needs more details; it is this reviewer's understanding that the current corpus consists of 1065 documents (which is extremely small in size); how many sentences are there in these documents? how many on/off events?\n- 3.2 is particularly difficult to follow\n- 3.3 should not use 3-4 paragraphs on introducing NB, SVM, and Decision Trees; last but not least, why decision trees and not randomized forests or deep learning models? in the current form, it is also unclear whether the on/off event detection is performed at sentence or document level \n- 4: what is the value of k in k-fold CV?\n\nLast but not least, the authors could use the work below as inspiration on how to improve the overall quality of the paper\nhttps://pqdtopen.proquest.com/doc/2025917601.html?FMT=ABS"}