{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The paper studies extracting events from unstructured text, specifically on the low resource language Amharic. The paper proposes to combine rule-based based with a learning-based approach. \n\nStrength\n-\tLooks at the low resource language Amharic and mines a large corpus of text.\n-\tThe paper compares 3 learning algorithms, NB, Libsvm, J48. As well as a hybrid versus a rule based approach.\n\nWeaknesses:\n1.\tPrior work\n1.1.\tThe paper misses to discuss prior work on Amahric copora\nRychlý P., Suchomel V. (2016) Annotated Amharic Corpora. In: Sojka P., Horák A., Kopeček I., Pala K. (eds) Text, Speech, and Dialogue. TSD 2016. Lecture Notes in Computer Science, vol 9924. Springer, Cham\n2.\tExperimental evaluation\n2.1.\tMissing ablations\n2.1.1.\tThe paper claims “Amharic presents sophisticated language-specific issues” but does not evaluate how the proposed approach handles those specific challenges.\n2.1.2.\tThe authors “normalize” characters with the same meaning “to an ordinary conceivable form” which “helps the performance of [their] system”; however, the paper does not ablate this benefit.\n2.2.\tThe authors “applied k-fold cross- validation which split our dataset randomly into k groups”. It would be great if the authors report the standard deviation across the results to understand the significant of differences.\n2.3.\tThe paper misses to show any qualitative results showing how the system works and which error it makes. \n2.4.\tThe paper notes that the “Amharic has a subject-object verb agreement and other morphological feature makes cumbersome the construction of rule” as well as the large unsupervised corpus they have available suggest to me that the authors should explore unsupervised pre-training a transformer-based network, such as BERT or other approaches which have successfully been used on other languages.\n3.\tClarity: The paper’s clarity could be improved:\n3.1.\tOn the one hand by clearly stating the contributions and by improving the clarity of the writing throughout.\n3.2.\tIt is not clear how Table 2 relates Table 1. The authors note it is the same dataset. Does Table 2 show Weighted Ave of On and Off-event?\n3.3.\tWhat is the large unlabeled corpus used for?\n\nMinor:\n- considering using the correct citation style: “27 million speakers Mulugeta and Gasser (2012) “ -> 27 million speakers (Mulugeta and Gasser, 2012)\n- don’t capitilzie after “;”: \n- duplication of very similar sentences: “Events in Amharic text are predominantly expressed through verbs and nouns, but, the linguistic structure and morphological richness has not represented in models that have been developed for other languages. Events in Amharic are ex- pressed predominantly through verbs and nominal, but, the linguistic structure and morphological richness highly matter to apply models used for other languages.”\n\nConclusion:\nWhile it is interesting and valuable that this paper studies a low-resource language. The paper misses comparisons to prior work for event extraction and misses to include ablations which show the value of the introduced rules and design decisions made. \n"}