{"title": "An interesting problem formulation, but the method doesn't seem innovative and the empirical results not very convincing", "review": "- Summary:\nThis paper considers the problem of learning a GAN to capture a target distribution p_t with only very few training samples from p_t available.\n\n- Good\nAn interesting problem formulation. \nThe proposed approach is not new, but seems to be a sensible and simple solution to the problem formulated in this paper. I would see the contributions of the paper: (1) an interesting problem formulation on how to learn p_t (with a few assumptions) (2) a sensible adaptation of GANs on this problem (with minor modifications to GANs which have been observed/adopted in many GAN literatures in the last two years)\nThe training appaoches/tricks are rather straightforward and not new as well.\n\n- Suggestions\nThe main problem of this paper is that it does not provide sufficient results on any real applications that can support its problem&model formulations. \nFor example, in which scenarios would the users of the model need to train a GAN to mimic a target distribution p_t which is a difference of another two distributions (with examples available there but unavailable in p_t)? It would be good to show significant results on real applications to show the problem and the method useful.\n\nTwo applications on semi-supervised classification and adversarial training are discussed. While both seem to be very artificial IMO if considering the used dataset and designed experiments. The results are also not convincing even for the shown two experiments compared to baselines.\n\nNo related works on addressing the similar problems have been discussed nor compared in experiments.\n\n- Theoretical results:\nWhile the authors claim new theoretical results, in fact, I didn't see any contributions here as the theories developed in section 3 are mostly rather straightforward. There have been some similar theories being developed in previous papers where a component in GAN exhibits mixture-modeled forms, such as in TripleGan (Li et al. NIPS'17). So I would not recommend the authors to claim contributions here.\n\n- Writing:\nThe paper does not seem to be polished. It may not be necessary to exceed 8 pages as many spaces in this paper could be easily squeezed (apparently). The organization could be better; Some parts are vague and difficult to understand;  the writing could be improved to be more clearly demonstrate the contributions of this paper. ", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}