{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper propose noisy  -SSC and Noisy-DR- -SSC to handle noisy data and dimensionality reduced data so as to improve the robustness of sparse subspace clustering methods. The authors conduct a complete and detailed theoretical analysis, and the results provide theoretical guarantee on the correctness in terms of SDP on noisy data. \nPositive:\n(1) Under both deterministic model and randomized models, this paper presents noisy  -SSC , which enhances  -SSC by theoretical guarantee on the correctness of clustering on noisy data.\n(2)  Moreover, this paper presents Noisy-DR- -SSC, the method improves the efficiency of the basic algorithm, and provably recovers the underlying subspace structure in the original data from the dimensionality reduced data under deterministic model. \nNegative:\n(1)\tThe authors conduct a complete and detailed theoretical analysis, but the description of the algorithm is not clear and the optimization process is not detailed enough.  It is very difficult to understand it.\n(2)\tThis paper proposes a noise model based on Yang et.al (2016), the objective function and the optimization process are already available, therefore, its innovation is not clear in this paper. \n(3)\tThe results of experiments demonstrate the effectiveness of noisy  -SSC and Noisy-DR- -SSC, but this paper not only lacks the description of experimental data, but also lacks the large-scale experimental data. In addition, the experiment is inadequate in this paper, it is suggested to add experiments to analyze the influence of noise ratio on the experimental results. It is hoped that the author will give the parameter analysis and convergence analysis of the algorithm in an experimental way.\n"}