{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "In this paper, the authors propose a new subspace clustering algorithm that extends L0 sparse subspace clustering (Yang et al., 2016). The main difference is that the proposed algorithm supports the noisy data situation, which is achieved by minimizing a distance-based similarity measure and L0 norm. The authors prove that the proposed L0 SSC has subspace detection property. Next, analyses on the correctness of deterministic case, randomized case and the scenario of dimensionality reduced data are given in the paper.\n\nIn Table 1 and Table 2, the experiments show that the proposed model outperforms baselines on three datasets when evaluated by accuracy and normalized mutual information.\n\nIn this paper, the authors proposes a natural extension to Eq. (1) that allows the clustering model to optimized on noisy (real) data. The paper has a comprehensive analysis for the model, which is a big plus for me. However, my major concern is in the empirical evaluation, especially I'm observing that the comparison with (Yang et al., 2016) is not presented. Addressing  this question may change my judgement.\n\n1) With a quick scan of Yang's paper (L0-sparse subspace clustering), I see they are also performing experiments on same datasets. I can't understand why not also compare with their results in Table 1 and Table 2. Showing the advantage of the proposed model over L0-SSC and AL0-SSC in Yang's paper can be important for readers to use your model. (For example, if the quality of clusters are similar, then you can put focus on optimization speed).\n\n2) You mentioned that you propose a noisy version of L0-SSC, which I believe referring to Eq. (2). (Please correct me if I'm wrong.) However, Eq. (2) in your paper is almost identical with Eq. (7) in Yang's paper.\n\nMinor question and comments:\n\n1) I searched for the number of clusters you used for the experiments, but can't find it. How many clusters did you use? How does this number affect the results?\n\n2) You can just merge Table 1 and Table 2. Then you can add more contents to experiment section and conclusion."}