{"title": "Nice study which (sadly) ignores large parts of the related work", "review": "# Review for \"On Learning Heteroscedastic Noise Models within Differentiable Bayes Filters\"\n\nThe method revisits Bayes filters. It evaluates the benefit of training the observation and process noise models, while keeping all other models fixed. Experimentally, a clear performance boost is verified if heteroscedastic noise is used.\n\nFirst, I want to applaud the effort done to do the study. I think it is very beneficial for the community to revisit classic algorithms and evaluate them in a broader and more recent context. I certainly will revisit this article and point colleagues to it. \n\nThe paper is well-written and the experiments seems to be well done. The review of the relevant models is adequate, although space filling, since the methodology  is not at the core of ICLR. I however consider it highly relevant for the future of the field.\n\nHowever, there is a major flaw: the variational state-space model literature is completely ignored. I consider this blank spot unacceptable. Especially, the models proposed have already explored heteroskedastic noise models in contexts where state-space models and posterior approximations were fully trained. It is just that an ablation study was never done.\n\nI am very torn, as I like the paper in general but think that the recognition of the variational SSM literature needs to be added, and not having it in here would foster a separation of two \"micro communities\".\n\nHere is an incomplete list of articles, which can serve as starting points for a more thorough literature review.\n\n- Archer, E., Park, I. M., Buesing, L., Cunningham, J., & Paninski, L.\n(2015). Black box variational inference for state space models. arXiv preprint arXiv:1511.07367.\n- Fraccaro, M., Sønderby, S. K., Paquet, U., & Winther, O. (2016). Sequential neural models with stochastic layers. In Advances in neural information processing systems (pp. 2199-2207).\n- Karl, M., Soelch, M., Bayer, J., & van der Smagt, P. (2016). Deep  variational bayes filters: Unsupervised learning of state space models from rawdata. ICLR 2017.\n", "rating": "6: Marginally above acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}