{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper proposes learning NN to correct for inaccuracies in numerical solvers of PDEs, with experimental focus on fluid flow simulation. It lists two approaches: (1) compute correction in high resolution simulation from reference states, convert to low-resolution correction, and train NN to predict low-res correction (optionally with temporal regularization, and (2) directly simulate forward using correction prediction and differentiable PDE solver and optimize to match the given reference states. It shows empirical results on better approximating fluid flow simulation. \n\nThe paper tackles an important problem of using NN to speed up expensive simulation computations. The main limitation appears to be the significance of machine learning approaches. Approach (1) is a naive prediction using NN, and approach (2) involves interesting differentiation through PDEs, but that’s directly borrowed from another concurrent anonymized submission. This paper alone does not seem to have enough novel ML contributions for acceptance. \n\nThe writing can benefit from more clarity and better structure. For example,\n- Write prediction as \\hat{c}_L(s) to show what is input for the NN\n- Put definition for c_H in Section 3.1. It seems to be based on v_R and v_B but would benefit from being explicit. \n- If beta=0 is used, why do you need Section 3.2? Is it a typo?\n- In Section 3.3, I am unsure if it should be called unsupervised, as you are given reference state s_H. How is the assumption different from Sections 3.1 and 3.2? Also, a relevant reference [1]\n\n[1] Bengio, Samy, et al. \"Scheduled sampling for sequence prediction with recurrent neural networks.\" Advances in Neural Information Processing Systems. 2015.\n\n"}