{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "Numerical solvers for partial differential equations take a lot of time to get high resolution results since they have to explore high dimensional grid in function domain. Thus, it is important to interpolate between grids to get high resolution results. In this paper, the authors propose the model that assists PDE solver by correcting residuals in a data-driven way. Specifically, they try to approximate NN to correction function in supervised and unsupervised manners. They also propose a temporal regularization method that smooths behavior of fluid between times. As a result, proposed method can generate high resolution results in efficient way with smoke rising simulation dataset.\n\nSignificance\n- The field that the paper target is too narrow so that it may not be significant to general machine learning community.\n\nNovelty\n- I think this approach is somewhat novel since it introduces new direction in the field where the model assists PDE solver to improve performance with learned correction function.\n\nClarity\n- I think this paper is well written in most places, but the paper is not intended to make it easy for general machine learning researchers to understand and follow the problem thoroughly.\n\nPros\n- The proposed method is orthogonal to other methods such as super-resolution and may be complemented to other existing approaches.\n\nCons\nMy main concern is that the evaluation of proposed method is quite limited in the sense that- The method is evaluated with only single dataset.- Only basic model is used to compare to proposed model. What about other baseline models use similar deep learning approaches?\n- There should be various PDE problems other than Navier-Stokes to evaluate the general effectiveness of the proposed model.\n- I think time comparison/analysis should be provided since the paper targets to get efficient approximation (using NN) in numerical analysis field.\n\nQuestions and comments\n- I wonder the affect of hyper-parameter in temporal regularization.\n- I wonder performance comparison to existing NN based approaches."}