{"title": "Interesting idea; lack of comparisons with current methods.", "review": "The author proposes to use a competitive multi-agent setting for encouraging exploration.\n\nI very much agree with most of previous reviewers, and their constructive suggestions. However, I find a major issue with this paper is the lack of baseline comparisons. The paper shows that CER + HER > HER ~ CER. I do not think CER should be compared to HER at all. CER to me attacks the exploration problem in a very different way than HER. It is not trying to \"reuse\" experience, which is the core in HER; instead, it uses 2 agents and their competition for encouraging visiting new states. This method should be compared to method that encourages exploration via some form of intrinsic motivation. There are methods proposed in the past, such as [1]/[2] that uses intrinsic motivation/curiosity driven prediction error to encourage exploration. Note that these methods are also compatible with HER. I'd suggest comparing CER with one of these methods (if not all) both with and without HER.\n\nMinor:\nIn the beginning paragraph of 3.1, the paper states: \n\"\nWhile the re-labelling strategy introduced by HER provides useful rewards for training a goal-conditioned\npolicy, it assumes that learning from arbitrary goals will generalize to the actual task goals. As such,\nexploration remains a fundamental challenge for goal-directed RL with sparse reward. We propose a relabelling\nstrategy designed to overcome this challenge.\n\"\nI think overcoming this particular challenge is a bit overstating. The method proposed in this paper is not guaranteed to address the \"fundamental challenge\" either --- i.e., why can you assume that learning from arbitrary goals that results from the dynamics of two agents will generalize to the actual task goals?\n\nI will change my rating accordingly if there are more meaningful comparisons made in the rebuttal.\n\n[1] Curiosity-driven Exploration by Self-supervised Prediction, Pathak et. al.\n[2] Large-Scale Study of Curiosity-Driven Learning. Burda et. al.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}