{"title": "Some interesting results, but not good enough. ", "review": "In this paper, the authors investigate the collapse of deep and shallow network to a constant function under the following setting:\n1. Very shallow networks, width ~ 10\n2. ReLU activation function.  \n3. Symmetric weights and biases initialization.  \n4. Vanilla feed forward networks.  \n\nThe main take-home message is: don't use neural networks (NNs) that are both deep and shallow.  \n\nThe theoretical analysis is built on the observation: \n1. Every neuron (after applying ReLU) is equal to zero with probability 1/2. \n2. For narrow network and for any fixed input, there is a high chance that all neurons in a particular hidden layer are all zero. All neurons after that layer are all zero if zero-bias initialization is used.  \n3. The authors conclude that derivatives of all parameters vanish but the bias of the last layer.\n4. As a result, the network collapse to its mean (median) if mean squared loss (L1 loss) is used because only the bias of the last layer is being updated during training. \n\nPros.\n1. I think the phenomenon that shallow and deep NNs collapse to a constant is very interesting. \n2. The authors provide empirical and theoretical insights in favor of wider networks: have a better chance to avoid vanishing gradients.  \n3. For shallow networks, it might be better not to use ReLU.  \n\nCons:\n1.The analysis works in a very limited setting, works for ReLU but not other activations: tanh, erf, SELU etc. \n2. Very shallow networks are not popular in practice. Width>=100 is popular for fully-connected layers. \n3. The phenomenon observed by the paper can easily be addressed using any of the following trick: \n   3.1. Non-symmetric initialization  (set the mean to be non-zero). \n   3.2 . wider networks. \n4. Most of the analysis (and theorems)  are about one single input. In another word, distribution of the inputs have not been taken into account.  \n5. I don't think the author provides a completely rigorous justification for the collapse phenomenon.  \n\nOther comments. \n1. Eq (2) in page 4 is not trivially correct. The expectation operator (w.r.p. to lower layers) is moved into the activation function phi, justification is needed for this step.  \n2. Theorem 4: when the Lebesgue measure of $\\Omega$ is NOT finite, it is unclear how to define a uniform probability distribution on it.  \n3. Theorem 4: the integrability assumption on y should depend on the loss: for L2 loss (L1 loss), squared (absolutely) integrable  should be used. They are not the same.  ", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}