{"title": "Paper brings insights and develops novel techniques for graph convolutional networks based on the Lanczos algorithm.", "review": "The paper under review builds useful insights and novel methods for graph convolutional networks, based on the Lanczos algorithm for efficient computations involving the graph Laplacian matrices induced by the neighbor edge structure of graph networks.\n\nWhile previous work [35] has explored the Lanczos algorithm from numerical linear algebra as a means to accelerate computations in graph convolutional networks, the current paper goes further by:\n(1) exploring in significant more depth the low rank decomposition underlying the Lanczos algorithm.\n(2) learning the spectral filter (beyond the Chebychev design) and potentially also the graph kernel and node embedding.\n(3) drawing interesting connections with graph diffusion methods which naturally arise from the matrix power computation inherent to the Lanczos iteration.\n\nThe paper includes a systematic evaluation of the proposed approach and comparison with existing methods on two tasks: semi-supervised learning in citation networks and molecule property prediction from interactions in atom networks. The main advantage of the proposed method as illustrated in particular by the experimental results in the citation network domain is its ability to generalize well in the presence of a small  amount of training data, which the authors attribute to its efficient capturing of both short- and long-range interactions.\n\nIn terms of presentation quality, the paper is clearly written, the proposed methods are well explained, and the notation is consistent.\n\nOverall, a good paper.\n\nMinor comment:\npage 3, footnote: \"When faced with a non-symmetric matrix, one can resort to the Arnoldi algorithm.\": I was wondering if the authors have tried that? I think that the Arnoldi algorithm for non-symmetric matrices are significantly less stable than their Lanczos counterparts for symmetric matrices.", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}