{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper proposes a way to generate responses during a conversation that uses a classifier to select from a set of high quality, expert-curated responses based on the conversation context.  The proposal is to overcome the problem of frequently seen  low quality, offensive, boring, or self-contradictive output of generative models like seq2seq or even GPT-2.   The method is designed for and tested in a (primary care) medical dialog setting.\n\nThe focus of the work is on how to prepare the responses.  Essentially, the suggestion is to find clusters of like-purposed responses that are not over-lapping.  The clusters are found by, initially, automated stages using various sentence encoding vectors and similarity matching techniques like k-means, BERT, and hierarchical clustering, followed by a pass of manual merging.\n\nIn the experiments, it is shown that the proposed process produced more favorable responses than those produced by a generative model, as judged by human evaluators.\n \nThe method proposed is sound, and the results are convincing.  However,  there have been many years of prior work in (neural or conventional) retrieval based approaches to response generation.   The proposal in this paper is just one small variant from this line of work, so there is little novelty.\n\nFor prior work, see an overview at:  https://basmaboussaha.wordpress.com/2018/03/23/overview-of-generative-and-retrieval-based-dialogue-systems,  and papers like: \"Response Selection with Topic Clues for Retrieval-based Chatbots\", Yu Wu et al., 2017, or \"Multi-level Context Response Matching in Retrieval-Based Dialog Systems\", by Basma El Amel Boussaha et al., 2019.\n\nP.2, paragraph starting with \"Experts ...\".  The last two sentences are not comprehensible, something (quotation marks?) seems missing.\n"}