{"title": "This paper is about obtaining a \"fully estimable empirical distribution\" for neural networks parameters in order to obtain some saliency or importance criterion for performing theoretically grounded pruning. An interesting idea at first sight, but the work and writing are done carelessly and in a rush.", "review": "Comments\n* all conditions are not discussed, for instance, isn't it quite strong to impose that the parameter space \\Theta is compact?\n* LDH condition: what is \\mathcal{N}, it isn't defined\n* The statement on top of page 3: \"Then, asymptotically, as the sample size n grows to infinity, the model parameters are distributed as (...)\" is awkward: is it standard? is it a new result? please consider stating it as a Proposition/Theorem or something, and explain where it comes from.\n* Actually, I am skeptical about the above statement itself: it is stated that \"the model parameters are distributed as (...)\". Does that mean that the parameters are random, in a Bayesian fashion? please state it then. Or the alluded to distribution is that of parameters' estimators? then the statement should be amended, and it should be explained what estimators are considered.\n* footnote 3: shouldn't the considered sum be divided by n?\n* the paper is full of flawed equations where, I think, parameters are mixed up with estimators. \n    * For instance, Equations (2) and (3) should express the same quantity, $W$, however the former displays the parameters’ covariance matrix, while the latter uses an estimator of it, \\hat{Avar}.\n    * Same in page 4 with the estimator of the Hessians (H) and of the score covariance matrix (\\hat Σ).\n    * Same for Equation (6): \\hat \\theta is suddenly plugged-in in place of \\theta_0, all of this conserving the equality sign.\n    * Same for Equation (7)\n\n\nTypos, minor comments and un-precise statements\n* the footnotes superscripts are misleading for footnotes 2 and 3; they could be better placed.\n* Lindeberg-Lvy should be Lindeberg-Lévy\n* after equations (6,7,8) you write \"Where all is defined as above\": this is fairly un-precise; as you use LaTeX, you should conveniently use some \\label and \\ref.\n* end of section 4.1: MINST dataset, a new dataset?\n* top of section 4.2: there are even typos in the proposed name for methodology! : \"Walt-based Pruning\"\n* Many references in the bibliography are incomplete, so that it is impossible to see where they come from (at least seven of them)", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}