{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This work explains how to use a seq2seq encoder-decoder neural network on the case of multivariate time series. The authors name this particular application of seq2seq the wave2wave network. Given a multivariate time series covering a time interval, it is split into subintervals of equal length, such that each block is a matrix. This matrix becomes an input into a recurrent encoder. On the decoder side, the similar matrix is produced at the output. The proposed neural network is tested on two data sets: an earthquake and activity translation.\nStrenghts:\n+ application on activity translation and evaluation by human raters is interesting\n+ the proposed work is a nice application of an encoder-decoder architecture in case of multivariate time series\nWeaknesses:\n- there is no methodological novelty. The proposed network uses a standard architecture and the authors use straightforward partitioning of the signal in equal-sized windows. Due to this, inventing a new name wave2wave is not fully justified.\n- the paper has many grammar mistakes and typos (for example, first sentence in the introduction seems to miss a few words). The writing is vague and imprecise and occasionally interferes with understanding. It would be important for the authors to carefully proofread the paper for language and clarity of presentation.\n- the experimental results are not explained in a sufficient detail. I did not understand what is the objective of the earthquake application and how does the data set looks like (e.g., what do you mean by “365 x 3 training data”). The details of experimental design, architecture and hyperparameter choice are not provided in the earthquake application. It is not clear what the authors mean by “simple encoder-decoder” and “simple seq2seq”, I guess those are some baselines. For the activity application, it would be useful to see some illustration of the neural network output when video is predicted from motion capture. It would help to clarify the accuracy measures – perplexity and human understability. How many humans were involved in rating and what were they asked to do? How did the humans rate the non-video outputs?\n\nOverall, given the quality of writing and lack of methodological novelty this paper is not ready for publication."}