{"rating": "1: Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The authors propose a variant of sequence to sequence models that operates on the fixed segments (waves). The paper contains significant flaws both in its writing and its experimental setup.\n\n1) Authors write: \"For example in human activity logs, the video data can be missing in bathrooms by ethical reasons but can be supplied by environmental sensors which have less ethical problems.\". I believe that this statement is completely irrelevant to the paper.\n\n2) Authors write: \"The straight-forward extension does not apply by two reasons: (1) the lengths of x and y are radically different, and (2) both x and y are high dimensionals.\" This statement is not justified and to the contrary of authors statement there has been recent work on wave2wave modeling including end-to-end speech-to-speech neural translation by Jia et al 2019, Liu et al 2019.\n\n3) Authors write: \"CNN is relatively weak in handling time-series data.\" Again this statement is not justified and to the contrary there has been work by Gehring et al 2017 showing success of CNNs in neural machine translation and Bai et al 2018 showing success of Temporal Convolutional Nets on various sequence modeling tasks. \n\n4) Several typos in the paper: Reccurent -> Recurrent on page 2, informaion -> information on page 5\nI believe that this paper is far from worthy of being considered to be accepted by ICLR.\n\n5) Authors claim that they learn several inverse function R^{-1} to capture target waves. On the first glance it may seem that they invert the same weight matrix used for learning source waves R, however upon closer inspection it seems that they learn separate weight matrices for source and target weights which makes inverse notation very confusing.\n\n6) I believe experimental setup is flawed. Authors consider the tasks that are not used by the community which makes it impossible to compare their method to related literature. Furthermore it is not clear to me how capturing the sequence semi-autoregressively (by modeling chunks of waves) produces such as big boost over vanilla sequence to sequence baseline."}