{"title": "A good improvement on robust adversarial training against universal perturbations, but with questions", "review": "In this paper, the authors proposed universal perturbation based robust training framework. With the aid of universal perturbation, the conventional robust training framework can be further interpreted as a fictitious play. Interesting algorithm and results are reported in the paper. My detailed comments are listed as follows. \n\n1) Some details of the proposed algorithm 1 are missing. In step 3, is just single SGD step performed? The generation of universal perturbation is not clearly discussed in Sec. 3.4. How to handle the expectation over the parameters of the affine transformation applied to the patch? MC particle-based approximation for these random parameters? If so, how many particles are used? \n\n2) I am confused on Algorithm\\,2 (AT). Is step 5 same as the robust adversarial training algorithm proposed by Madry \n et al.? What I recall is that SGD (for outer minimization) is only performed over perturbed samples, No? Please clarify it.\n\n3) In experiments, the authors mentioned \"The accuracy (dotted line in the plots) is the fraction of examples that have been correctly classified for a batch of 10000 samples randomly chosen in the train, validation and test sets.\" Please clearly define the train/validation/test datasets, e.g., size and how to generate adversarial examples for testing. \n\n4) In Figure 4-6, is only the universal perturbation based attack evaluated? It does not seem a fair comparison, since the proposed min-max problem builds on the generation of universal perturbations. I wonder how robustness of the proposed method against per-sample perturbation, e.g., C\\&W attack. I think it might be important to find a third-party attack method, e.g., C\\&W or physically transformed attacks, to test both fictitious play and robust adversarial training.\n\nIn general, the paper contains interesting ideas and results. However, there exist questions on their implementation details and empirical results. \n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}