{"title": "Paper needs to be tightened with regard to the exact problem we're trying to solve and how we measure success", "review": "- There are several things about the presentation I find confusing.  There are two different objective functions you're considering: the ones based on the 2-Wasserstein distance in equations (3), (4), and (6), and the VAE in equation (2).  So what are you referring to in the abstract when you say \"we find our discrete latent variable to be fully leveraged by the model when trained, without any modifications to the objective function or significant fine tuning\".  It seems like you're using a different objective function, so what do you mean by \"without any modification\"?\n\n- On page 1 you state that \"we seek also to establish that training generative models with OT can be significantly more effective than the traditional VAE approach.\"  Yet you don't really say how you measure this effectiveness.  Very late in the paper, on p7, you suggest using the reconstruction loss from the VAE objective to compare the trained models.  Is this the answer?  If so, I think you need to move it way up in the paper and give some discussion on why this makes sense as an evaluation metric.\n\n- At least a couple times you refer to wanting to get a \"weaker topology\", which I know is an idea developed in Bousquet et al's 2017 paper.  But you should include at least some explanation of what you mean by this and its implications -- \"weak topology\" seems like a pretty fancy term for the mathematical level of this paper.  In first paragraph of section 2.2, what is the \"induced topology\" of maximum likelihood?\n\n- To further elucidate the crux of the issue in Section 2.1, it might be helpful to explain why the EM algorithm, which is just an ELBO maximizer, for basic Gaussian mixture models doesn't typically have issues with a collapsing mixing distribution.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}