{"title": "An interesting paper; but I found the algorithm description very hard to parse!", "review": "This paper presents an approach for hierarchical RL based on an ensemble of low-level controllers.\nFrom what I can tell, you train K randomly initialized models to maximize displacement (optionally with a periodic implementation).\nThis ensemble of low-level models is then presented to a high-level controller, that can use them for actions.\nWhen you do this, the resultant algorithm performs well on a selection of deep RL tasks.\n\nThere are several things to like about this paper:\n- Hierarchical RL is an important area of research, and this algorithm appears to make progress beyond the state of the art.\n\n- The ideas of using ensemble of low-level policies is intuitive and appealing.\n\n- The authors provide a reasonable explanation of their \"periodicity\" ideas, together with evidence that it can be beneficial, but is not always essential to the algorithm.\n\n- Overall the writing is good... but I did find the main statement of the algorithm confusing! I think this deserves a proper appendix with everything spelled out.\n\n\nThere are several places this paper could be improved:\n- First, the statement of the *main* algorithm needs to be brought together so that people can follow it clearly. I understand one of the main reasons this is complicated is because the authors have tried to make this \"general\" or to be used with DQN/PPO/A3C... but if you present a clear implementation for *one* of them (PPO?) then I think this will be a huge improvement.\n\n- Something *feels* a little hacky about this... why are there only two timescales? Is this a general procedure that we should always expect to work? *why* are we doing this... and what can its downsides be? The ablation studies are good, but I think a little more thought/discussion on how this fits in with a bigger picture of RL/control would be good.\n\nOverall, I hope that I understood the main idea correctly... and if so, I generally like it.\nI think it will be possible to make this much clearer even with some simple amendments.", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}