{"title": "Clear description but lack of novelty", "review": "Summary:\nThe paper explains a stage by stage knowledge transfer method. The authors used different structures of resnets to transfer knowledge from a teacher model to a shallower student network. The L2 norm is used to minimize the difference between features. The authors argue that this type of transfer while ignoring the labels or logits improves the performance and makes the network task independent. The number of stages is fixed and at each stage the rest of the network does not get updates. The method is evaluated on several benchmarks.\n\nStrengths:\nThe description is clear and good analytic experiments are performed. The method is practical for tasks that are not classification. The datasets chosen for experiments are challenging enough to support the argument.\n\nWeaknesses:\n-While a lot of benchmarks are considered and the achieved performance is good, the improvement over competing KD methods is marginal.\n-CNN citation is missing.\n-In introduction section, authors mention performance drop when number of classes are small. Can they provide a reference for details?\n-How do you decide on k for number of stages?\n-There is not enough details to reproduce the experiments such as learning rates, layer sizes, regularizers (if any).\n-The authors claim they fix parameters to prevent vanishing the knowledge, is that really necessary? Can you present a comparison?\n-As far as i understood the proposed way of training restricts you to have same number of features between teacher and student. This is a big constraint and if not, one option would be to use regressors as in Fitnets paper.\n-The novelty is limited. If authors studied how to break down the teacher or student model in a principled way, it could have been a strong contribution but the current version does not differ much from Fitnets idea.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}