{"title": "Good paper, but I have some questions about the experimental results", "review": "The paper first provides a generalization bounds for adversarial training, showing that the error bound depends on Lipschitz constant. This motivates the use of spectral regularization (similar to Miyato et al 2018) in adversarial training. Using spectral regularization to improve robustness is not new, but it's interesting to combine spectral regularization and adversarial training. Experimental results show significant improvement over vanilla adversarial training. \n\nThe paper is nicely written and the experimental results are quite strong and comprehensive. I really like the paper but I have two questions about the results: \n\n1. The numbers reported in Figure 5 do not match with the performance of adversarial training in previous paper. In PGM L_inf adversarial training/attack (column 3 of Figure 5), the prediction accuracy is roughly 50% under 0.1 infinity norm perturbation. However, previous papers (e.g., \"Obfuscated Gradients Give a False Sense of Security\") reported 55% accuracy under 0.031 infinity norm perturbation. I wonder why the numbers are so different. \n\nMaybe it's because of different scales? Previous works usually scale each pixel to [0,1] or [-1,1], maybe the authors use the [0, 255] scale? But 0.1/255 will be much smaller than 0.031. \n\nAnother factor might be the model structure. If Alexnet has much lower accuracy, it's probably worthwhile to conduct experiments on the same structure with previous works (Madry et al and Athalye et al) to make the conclusion more clear. \n\n2. What's the training time of the proposed method compared with vanilla adversarial training? \n\n3. The idea of using SN to improve robustness has been introduced in the following paper: \n\"Lipschitz-Margin Training: Scalable Certification of Perturbation Invariance for Deep Neural Networks\"\n(but this paper did not combine it with adv training). \n", "rating": "6: Marginally above acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}