{"rating": "1: Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This article proposes a method for object counting which can be trained with weak supervision. Object counting methods are often trained with point annotations, i.e., one click-point per object. In this article, a weaker way of annotation is used: count-based annotation, i.e., the number of objects of each class present in the image are given as annotation but no precise location of the objects. This article is an extension of density-based object counting methods for weakly supervision.\n\nThis article analyzes the effect of pooling layers on WSL. The findings indicate that the pooling layer constrained the objects' locations to a predefined grid and accordingly they remove it. When removing this effect is alleviated. Moreover, the authors realized that a sift on the predictions also happen. Accordingly, they learn rotated versions of the model for centering the predictions. As a countereffect, several points per object are detected, and then a gini impurity regularization is proposed to reduce the number of detected objects. Then, the authors connect this formulation with VAE. \n\nThe experiments are conducted on a toy example, i.e., circle finding, and on the well established Mall dataset.\n\nMain concerns:\nThe experimental section should make experiments on standard datasets (i.e., USCD, Trancos, Mall, PkLot, Shangai, Penguins) using standard evaluation protocols (MAE, GAME). The current evaluation only shows the qualitative results on one frame of the Mall dataset.\n\nThe results of the proposed method should be compared with baselines. For instance, Glance method, which is only trained with count-level annotation, and with \"C-WSL: Count-guided Weakly Supervised Localization\". It should be also compared with WSL methods based on image-level labels such as \"Object Counting and Instance Segmentation with Image-level Supervision\" or \"Where are the Masks: Instance Segmentation with Image-level Supervision\" and then with methods that use point supervision as an upper bound such as density method or Where are the blobs.\n\nMoreover, some ablation studies about the effect of each component of the model would be needed.\n\nRegarding the model I have some concerns:\n - Removing the pooling layers does not seem a very good idea. This will remove part of the ability to detect objects at multiple scales and moreover will increase its computational power. Maybe for easy cases as circles and heads of mall people where the resolution changes are small could work. But not for more challenging datasets.\n - The rotation of the model could be ok for circles or heads. But making the model to learn rotation-invariant features could be challenging in more difficult datasets.\n - Eq.5 and 8 which are used in the model seem to use point supervision and not just the count based. Which makes the method not a weakly supervised one. Are these equations the ones used or others?\n\n"}