{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "The main contribution of the paper is the extension of techniques for weakly supervised localization, i.e. given ground truth counts of objects in a given image, one can do training to generate hidden layer density maps that allow for feature detection and localization of objects.   The main contribution of the paper seems to be the regularization of the density map by incorporation of a Gini impurity penalty and the contrasting of the regularizer against beta-variational autoencoder formulation. The experiments show the utility of the method in a toy example and an example involving pedestrians in video surveillance.  \n\nWhile the extensions are interesting, I find that the paper contributions are incremental and do not offer sufficient experimental results. The experiments are qualitative (just illustrations of results on a few images).  While I understand the context of the contribution from authors point of view and can appreciate the study of weakly-supervised learning, I find it important to ask how the present framework compares with a traditional method that uses background subtraction (thus gaining appearance invariance to an extent) followed by geometric prior driven indexing of counts and locations (see for example:  Lan Dong et al (ICCV 2007 - Fast Crowd Segmentation via Shape Indexing). The inductive bias and interpretability of design is extremely transparent and obvious.  Can you please elaborate how your work compares in performance to such a technique and what you mean by feature interpretability in your context? \n\nMy rating is based on the fact that the results are preliminary and further quantitative experimentation is needed."}