{"title": "Interesting framework but lack of novelty and unclear evaluation of attack", "review": "The authors present a framework for creating meaning-preserving adversarial examples, and give two methods for such attacks. One is based on k-nn in the word embedding space, and another is based on character swapping. The authors further study a series of automatic metrics for determining whether semantic meaning in the input space has changed, and find that the chrF method produces scores most correlated with human judgement of semantic meaning. The authors finally give an evaluation of the two methods.\n\n\nPositive:\n- The authors give a framework with the explicit goal of preserving meaning in attacks.\n\nNegative:\n- Unclear novelty: previous work also gives the goal of preserving input meaning in attacks, even if the attacks themselves do not preserve meaning effectively (ie Zhao et al) \n- Unclear attack effectiveness: The chrF scores for CharSwap and kNN methods have higher chrF scores than the \"unconstrained\" method, but it is unclear what this means in context. Similarly, the RDchrF scores show that the average output changes in meaning by some amount, but the authors do not show in context what this really means in terms of meaning. \n\nDetails of negatives:\nUnclear attack effectiveness: \n- Using chrF score as a proxy for human judgement is unmotivated. There is little analysis of the distribution of chrF scores compared to human judgement - the only analysis given is that a) there is a .586 correlation on French and .497 correlation on English, and b) that :\"90% of French sentence pairs to which humans gave a score of 4 or 5 in semantic similarity have a chrF > 78\". It would be good to plot the distribution of chrF score vs human judgement, so that the reader is able to tell what the chrF scores really mean in context here - a correlation score of approximately .5 is difficult to interpret.\n- The chrF/RDchrF scores in the source and target spaces (respectively) as they relate to \"meaning-preservingness\" suffer from uninterpretability as a reader, both because of the point above and also because there are few examples of adversarial examples with their chrF/RDchrF scores given (only two).", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}