{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "Specific Problem Tackled and Approach\n\nThe paper presents a novel method for low level image feature extraction called pyramid non-local block (PNB) which is the family of pyramid non-local enhanced networks (PNENs).  The authors showed its primary utility in the application of edge preserving image smoothing. However, one additional and important impact of the paper is that the PNB approach can be used as a plug and play component in other image processing and computer vision applications such image denoising and image super resolution and this adds to the generality of the approach which is commendable. The paper sets forth quantitative analysis of all the applications against state-of-the-art approaches and demonstrate the high efficiency without loss of performance in case of PNB. \n\nImpact and motivation\n\nIn terms of impact and motivation, PNB’s impact is threefold. Firstly, the pyramid approach uses multiple convolutions with different kernel sizes for generating embedding features for self-similarity (correlation) estimation. This improves the robustness of estimating correlation across pattern scales. Also, besides this, the PNB approach preserves long range dependencis in non-local features in a convolution network while remaining computationally efficient. This is one of the primary impacts of the paper. \n\nFinally, the pyramid non-local block can be incorporated into existing convolution based models used for low-level image processing in applications like denoising or for single image super-resolution. \n\nExperiments have been presented on several datasets to indicate that the pyramid non-local block improves the performance in image smoothing, denoising and super-resolution.\n\nStrengths and Rooms for Improvement\n\nThe abstract, while clear, can be improved with some linguistic clarity. Some of the sentences are fragment but this does not hinder understanding. \n\nFollowing the abstract, the introduction properly presents the motivation and related literature in an impressive manner. It might have been stronger if a brief introduction of pyramid based approaches and its applications were discussed. Still, the motivation of the fact that capturing long-range dependencies is a limitation in most modern convolution approaches has been conveyed very well. \n\nAs for Section 2 (Related Works), instead of mentioning so many works in literature, I would recommend you to cite review papers which can hold more information without taking much too much space. This way you can elaborate a bit more than just listing them including the sentence, “We do not elaborate due to limited space,” would then be unneeded.\n\nThe sections following Section 3 (Method) are the strongest. The mathematical presentation is detailed and very well presented. Figure 2 serves as a very useful architecture and motivation as to why the method presented in the paper is novel. \n\nEquation 9 and 10 does a splendid job in explaining why this is computationally efficient. \nThe two equation mathematically shows that it is motivated by two ideas. Firstly, the computation and memory requirement of non-local operations can be controlled within an acceptable load; and secondly, the robustness of self-similarity estimation is enhanced since the self-similarity is measured at various resolutions. \n\nThe experimental findings are well presented for image smoothing. I appreciate showing the spatial/image output using multiple approaches in figure 4. As a support, the quantitative findings showing PNB’s superiority over several state-of-the-art methods in table 1 is welcome. However, if this pattern were to continue for also image denoising (as from salt-and -pepper noise etc.) and image super-resolution, then the paper would be even stronger. Currently, the quantitative metrics are measured in tables 3-5 which is great but if the reader is presented with demonstrations like figure 4, then it can be excellent. \n\nAs a whole, the novelty and impact of the approach was conveyed clearly and in a scholarly manner. The work is commendable. Some clarity issues can be improved. For example, the sentence “Besides it is a very common phenomenon that the same type of patterns appear to own various spatial scales, which has not been taken into consideration in existing non-local operations” – is long and unclear. There are several such examples and I encourage the authors to break the long sentences and replace them with smaller and simpler sentences.\n"}