{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "title": "Official Blind Review #2", "review": "The paper proposes a simple modification to existing graph NN methods for classifying the entire graph of possibly variable size. The problem is of interest. The proposed method is on the other hand fairly simple and straightforward, as shown in Fig.1 and eq(4), as a simple function of the adjacency matrix A that incorporate the entire graph structure. The results are verified on four datasets with promising results. I have a number of concerns with the paper:\n*The presentation: The paper seems to come out in a rush, with many critical details missing. For example, the main method, which is the main technical contribution, is described within less 1-page length. The figure 1 is also not very helpful in understanding the details of the method. In experiment section, four datasets are presented, where many of them are introduced without any info about the dataset size, graph size, etc. The comparison methods used in Table 1 are also minimal (only 1 method is compared with in each dataset), and many of the methods are decade old. Some of the comparison methods are even without any formal reference so there is literally no precise info about where the methods are exactly from. Overall it is very difficult for an average reader to be fully convinced of the significance and professionalism of the work.\n**empirical evaluation: As aforementioned, the experiments are not compared with the recent work and detailed info is critically missing.\n**algorithmic contribution: this is also a question mark. \n", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory."}