{"rating": "1: Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposed an unsupervised method to make better usage of the inconsistent longitudinal data by minimizing the ratio of Principal Components Analysis and Locality Preserving Projections.\n\nComments:\n1. It is out of the area of my expertise, but the innovation of combining the PCA and LPP to produce the dimensionally reduced representation of the longitudinal data seems not significant enough, especially when the author did not mention why they chose these two methods out of all the available projection/hashing approaches.\n\n2. The paper is poorly written. Theorem 1 and Theorem 4 state the opposite conditions for v. Theorem  2 and Theorem 5 are exactly the same. If the same theorem has already been proved by previous work [Wang et al., 2014], it is not necessary to prove it again in this paper. The most important theorem which is claimed as the theoretical contribution of this paper (i.e. Theorem 6) did not even appear in the main contents but only in the appendix. The proof of theorems in appendix, Proof A.1, A.2, A.3 did not state which theorem they are corresponding to and are organized in different order as Theorem 3-5, make it hard to read.\n\n3. There are many grammar errors and sentences which are not consistent with English writing conventions. E.g. “This problem is heavily studied with (Wang et al., 2012; Brand et al., 2018; Lu et al., 2018) as example approaches which, despite their effectiveness, present an added complexity to the problem.” is better written as “This problem is excessively studied by (Wang et al., 2012; Brand et al., 2018; Lu et al., 2018) as example approaches which, despite their effectiveness, present an additional complexity to the problem”; “... to provide value in predicting patients’ diagnosis.” is better written as “... to provide valuable information in ...”; “... , we focus AD diagnosis from MRI scans ...” should be “... , we focus on AD diagnosis from MRI scans ...”; “consider outliers” is better as “handle outliers”; etc. \n\n4. In the sentence below equation (5), “J_LPP/J_LPP” should be “J_LPP/J_PCA”. \n"}