{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposes using a new version of graph networks – multiplex graph networks – which do object representation followed by some form of graph processing and reasoning to answer \"IQ test\" style diagrammatic reasoning, in particular including Raven Progressive Matrices that have been previously studied (a little).\n\nThe paper shows very strong results on multiple datasets, much stronger than previous results (from strong groups) on these datasets. On these grounds, I believe the paper should be accepted. \n\nHowever, the structure and writing of the paper was very frustrating to me. The paper just didn't make much of an attempt to explain and then motivate/analyze the model used. I mean, if I were writing the paper, I would have considered and done many things, such as:\n\n - shortening the introduction\n - shortening the related work\n - making the presentation of the datasets more succinct\n - having only one figure that covers most of what is currently in figures 1 and 2\n - putting details of what seem more ancillary details like the treatment of background lines objects in an appendix\n - remove Figure 3, which didn't convey much to me in the absence of more careful explanation of the model.\n\nso that I could motivate, carefully explain, and evaluate the main model in the paper. But here, all these things fill the main text, and we're told that we have to read the appendices to understand the model....  And the presentation in the appendix is more a dump-all-the-facts presentation than a careful development of the design.\n\nNevertheless, the general direction of the architecture seems sound, and the results look very strong, and there are even some useful ablations in the appendix.\n"}