{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "1) Summary\nThe manuscript explores an architecture for visual reasoning i.e. being able to respond to questions about the objects and their relations present in a 2d image. The focus is on interpretability rather on performance and not on predictive performance.\n\n2) Quality\nThe paper addresses an important problem but falls short on the analysis part.\n\n3) Clarity\nThe manuscript is reasonably well written and most of the technical and experimental content is accessible. However, the architecture is descibed in somewhat vague and informal terms and there seem to be quite some details not covered in the main text.\n\n4) Originality\nThe basic composition of the MMN seems somewhat unexplored.\n\n5) Significance\nThe proposed method seems to be a variation of one of the major architectures to visual reasoning monolithic and compositional. The performance -- among the compositional methods -- seems to improve but the interpretability is not properly demonstrated.\n\n6) Reproducibility\nThe data is from published sources (GQA, VQA) and the results for the baseline methods are available. However, there is no code for the method nor for the experiments, which makes the results pretty tricky to exactly reproduce.\n\n7) Evaluation\nWhile the empirical analysis puts a lot of effort on accuracy and ablation studies, the focus interpretability and compositionality is not the core of the investigation. So it seems semi-conclusive whether these aspects are sufficiently addressed.\n\n8) Questions\n  A) What does the last line of Section 2.2 mean?"}