{"title": "A simple method giving improved results", "review": "Review:\n\nThis paper proposes to change the typical Gaussian posterior distribution (and prior) for the latent features z associated to an image x that is used in Variational Autoencoders by a Dirichlet distribution. The work improves over previous attempts based on a soft-max + Gaussian distribution and the soft-max + Weibull distribution. The trick proposed to make feasible training the model includes approximating the inverse CDF of the gamma distribution and using the fact that the Dirichlet distribution can also be obtained as a normalized sum of gamma random variables. The method is compared in several problems. Some analysis of the reasons why it performs better is also carried out.\n\nQuality: \n\n\tI think the quality of the paper is high. It is a well written paper in which the choices made are well supported. It also has a strong experimental section.\n\nClarity: \n\n\tThe paper is well written and reads very smoothly. I have missed however a more clear statement in the introduction supporting the use of the Dirichlet for the prior and posterior of the latent variables, simply because it seems to give better results and the typical Gaussian choice.\n\nOriginality: \n\t\n\tThe paper is based on ideas already known. E.g., Dirichlet a normalized sum of gamma random variables and approximation of the inverse CDF of the gamma random variable. The combination of these two techniques is however novel. \n\nSignificance:\n\n\tThe results obtained indicate that the proposed approach improves over previous work on the Dirichlet VAE and on the Gaussian VAE. So I believe the significance of the paper is high.\n\npros:\n\n\t- Good results.\n\n\t- Simple method proposed.\n\n\t- Extensive experiments.\n\n\t- Well written paper.\n\ncons:\n\t\n\t- The idea is a combination of already known techniques put in practice for the VAE.\n\n\t- A better motivation that the Dirichlet VAE gives good results should be given at the introduction.\n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}