{"title": "Interesting insights and attack broadening our understanding of the scope of the problem of adversarial examples", "review": "The paper explores how the architecture, smoothness of the decision boundary and test accuracy of a model impacts the transferability of examples produced from it.  The paper provides a couple of novel insights, such as the asymmetry when transferring adversarial examples from one model to another. In addition, a novel method is proposed to enhance the transferability of adversarial examples from any model, through using smoothed gradients.\n\nThe experiments seem to show that the effect is rather large, and also makes the examples more robust to other transformations such as JPEG compression. Overall, these are interesting insights that could lead to further developments in making models more robust to adversarial examples. In particular, deriving adversarial examples that are both transferable and resilient to certain usual image transformations shows that the scope of the issue with adversarial examples may be even greater than what is understood today.\n\nThe paper is rather clear. Unfortunately, it is riddled with grammatical errors and should be proof-read carefully. A lot of singular/plurals are off, and some formulations are odd or downright unclear. Some examples (there are way too many to report them all):\n\n- \"Transfer-based attackS ... since they ...*\n- \"of adversarial exampleS ...\"\n- \"from model A can transfer to model B\"\n- \"less transferable than *those from* a shallow model\"?\n- \"investigations, We \": don't capitalize\n- \"the averaging *has* a smoothing effect\"\n- \"our motivation are\"\n- \"contributed it to\"\n- \"available *to the* adversary\"\n- \"crafting adversarial perturbationS\"\n- \"directly evaluation\"\n- \"be fixed 100\"\n\nPros:\n- Transferability and robustness of adversarial examples is a very important problem\n- Interesting insights, esp. the construction and evaluation of examples that are more resilient to certain image transformations\n- Experimental results are convincing\n\nCons:\n- Contribution overall may be a bit limited\n- Grammatical errors and odd formulations all over the place", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}