{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper criticizes existing High Dimensional BO (HDBO) via linear embedding literature for the following reasons:\n\n- Points in the embedded space projected mostly to the facet of the bounding box in the original space.\n- The projection induces a distorted space which is not fit to be modeled by a GP.\n- Linear projections do not preserve product kernels.\n- Linear embeddings have low probability of containing an optimum.\n\nThe paper then proposes ALEBO which supposedly improves these aspects over other linear embedding BO techniques.\n\nI have the following concerns regarding the authors' criticisms above:\n\n1. What is wrong with the points being projected mostly to the facet of the original bounding box?\nIf I understand correctly, Theorem 3 of the REMBO paper proved that there exists y* \\in R^{d_e} such that f(Ay*) = f(x*)\n(i.e., the projected space contains the optimum) with high probability so to me, it does not really matter if the projection does not include the interior of the bounding box. Fig. 1 seems to make a point that most projections seem to indeed land on the facet of the bounding box (to be thorough, how many points did the authors sample to make this plot) but given what I said above, I do not think there is much of a point in Fig. 1 here. \n\n2. The authors claimed that it is not appropriate to model the distorted space with GP, but ended up using GP \nfor ALEBO anyway (although with a different kernel). I understand that the authors did not project Ay back to B\nlike REMBO did, but the authors also gave me no reason to believe that this will improve things either. In fact, I think \nthe authors should show the space induced by ALEBO embedding as a comparison. I suspect that with the imposed \nconstraint -1 <= (B^T)y <= 1 the space will have discontinuous regions and is also not fit to be modeled \nwith any GP. \n\n3. The authors stated that \"A product kernel in the true subspace will not produce a product kernel in the embedding; \nwe will see this more explicitly in Sec. 5.1\" but I did not see it explicitly in Sec. 5.1. At the very\nleast, I do not see how REMBO fails to do the same thing. Also, the authors claimed that \"Inside the embedding, \nmoving along a single dimension will move across all dimensions of the true subspace, at rates depending \non the angles between the embedding and the true subspace\". This seems like a very qualitative claim.\nCan the authors formally define what this statement means, and prove it or at least provide some backup citations?  \n\nOther comments:\n\n4. Why do the authors use conjugate transpose (if B^T means what i think it means) instead of normal transpose \nwhen B is drawn from R^{d_e \\times d}? Shouldn't they be the same?\n\n5. Please explain the choice of \\Epsilon(B) = {x: B^T B x = x} \n\n6. The experiments provided are very limited. There is only one set of experiments showing performance of\nALEBO against other methods and it was done on a very small extrinsic dimension too (D = 100). I would like to see how \nALEBO scales with truly large dimension (REMBO also claimed that it could scale up to much higher extrinsic dimension). What about other important properties like does it guarantee that an optimum lies in the constraint space? What about rotational invariance? There are so many elements missing from the analysis.\n\nOverall conclusion:\n\nThis paper is largely empirical and lacks technical depth. It is not at all convincing that the problem it\naddresses is real, much less important. It also does not offer strong empirical evidence (too few experiments). \nGiven these reasons, I do not think the paper is not ready to be published as it is. "}