{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "= Summary \nThis paper presents a simple method that draws visual attention of deep embedding networks for metric learning. It basically follows the class attention mapping strategy based on global pooling operation [Zhou et al., CVPR 2016], but extends the original version to point-specific attention which is novel and enable interesting applications on image retrieval. In addition, the proposed method seems also independent of the loss function used for metric learning, thus it can be applied to most of existing deep embedding networks to understand their behaviors in a qualitative manner. \n\n\n= Decision\nMy current decision is officially \"weak reject\" but \"borderline\" in my mind. The major concern of mine is its weaknesses in clarity and technical novelty. However, I still believe this submission is valuable since it addresses a relatively new and timely topic, the proposed method is simple yet effective, and the applications of point-specific attention (i.e., \"cross-view pattern discovery\" and \"interactive retrieval\") are all interesting and practically useful. If the clarity issues are all clearly addressed, I would upgrade my rating. \n\n\n= Comments\n[Pros]\n1) The motivation and implementation of the point-specific attention are convincing. \n2) The point-specific attention enables not only image-to-image retrieval, but also more elaborate understanding about a pair of images and their similarity.\n3) The proposed technique is model-agnostic and loss-agnostic, thus can be applied to most of existing deep embedding networks for image retrieval. Also, the proposed technique does not degrade the retrieval performance.\n4) The proposed technique is simple yet effective in multiple applications, most of which are practically useful and have great impact. For example, the weakly supervised localization is an essential step towards many weakly supervised approaches for higher-level recognition tasks like semantic segmentation, and the interactive retrieval will allow us to build more realistic and useful image retrieval systems.\n\n[Cons]\n1) The proposed technique itself is not new but a straightforward extension of an existing work [Zhou et al., CVPR 2016].\n2) The manuscript is not crystal clear.\n- The name of the proposed point-specific attention (i.e., \"Partial attention\") is misleading.\n- The way to compute the point-specific attention map is not clearly described in Section 3.\n- It is hard to understand the contents in Figure 6 as they are not clearly illustrated. \n- The experimental and implementation details of the last two applications are not given. For example: (cross-view pattern discovery) how to compute the angle error, and how much the proposed technique is sensitive to the position selected on the query image, (interactive retrieval) how to compute the similarity between images given a specific region of interest on query.\n3) More qualitative results on the last two applications should be presented, even in an appendix, to convince future readers. Especially, in the case of \"interactive retrieval\", more results are demanded as quantitative performance analysis seems not straightforward."}