{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "Summary:\nThis paper proposes a simple procedure to display the salient areas that determine classification decisions from deep networks. In practice, these area are computed by shadowing the image using a Gaussian and measuring the network contribution at every location of the image. Results in terms of \"Pointing game\" metric (that measure similarity between computed saliency result and ground truth) are provided on the Imagenet validation dataset. \n\n1 Positive aspects:\n- Experiments are conducted on many datasets and show visually convincing results.  \n- state-of-the-art on ImageNet compared to the RICE approach. \n\n2 Negative aspects: \n- Very simple approach\n- Depends on many parameters (t1, t2, sigma_s, sigmal_l,  sigma_spatial) \n- Improvement of PT w.r.t. Rice is not very high: 0.912 compared to 0.907.The variants Light, shadow, fusion approaches are not described in the text.  \n- The paper is badly written. \n-- Many sentences are uninformative (e.g. abstract :  \"We prove the effectiveness of GLAS for fine-grained classification using the fine-grained classification dataset\")\n-- There is copy-pasted text everywhere (e.g. fea - tures , formu - lated, etc.), showing there has not been proof-reading of the paper, which is pretty disconcerting to reviewers. \n- There are multiple typos including misspelled names in the bib.\n- blurry figures.  \n\nMy initial rating is mainly motivated by the minor experimental improvement wrt RICE that is not clearly explained. There would also be a lot of work for improving the writing of the paper.   \n\nMinor : lambda is 10^-5, not 10^5 ? \nis sigma_s used in the algo or any equation? Where is it defined? "}