{"title": "The authors approach the image captioning problem conditioned on personality \"traits\"", "review": "\nThe technical contribution of this paper is reduced to adding a \"personality embedding\" to approach the image captioning problem (authors also propose a new task and data set, but motivation is not convincing). As side contributions the authors will release a data set on image captioning conditioned on personality \"traits\".  I think the authors fail at motivating the proposed task, see comments below. Also, they fail at emphasizing the technical contribution of the paper (see below as well). Finally, authors do not put in context their work, in terms of CV studies on personality analysis. \n\n\nI think the authors should elaborate more on scenarios/applications were personality-conditioned captions would be of interest to humans!, with reference to the example in Figure 1: why one would a computer to generate a subjective caption biased towards a particular personality aspect (which has to be chosen by the user, I guess)?. There are 7 subjective captions, all of them could be valid, but these are both, subjective and they surely do not cover the whole spectrum one can think of. I am not convinced of the relevance of the task, I mean is an interesting experiment, but what impact will it have in terms of applications? I think this is critical, since one of the contributions of the paper is the new dataset. \n\nAuthors mention that humans prefer their labelings ˜50% of the time (wo statistically significant difference), this actually sounds as low performance, can you please elaborate on why is this a good result?\n\nThe authors make use \"personality traits\" to make reference to a list of adjectives, actions, etc. Why the authors consider these as personality traits? What is the support for that list? There are well established notions of personality traits from the psychology field, why not adhering to them?, authors should also make an effort to put in context their work in terms of personality-analysis efforts from the CV community, see e.g.: Jacques et al. First Impressions: A Survey on Computer Vision-Based Apparent Personality Trait Analysis. ArXiv 2018\n\nWhy are missing in Table 5 the results obtained by the ResNet152 image encoder without personality encoder?\n\nThe description of the personality encoder in section 4.2 is rather brief!, this is actually the only technical contribution of the paper and the authors fail at emphasizing it. \n\nHow do the authors define engagement to annotators? More details on the human evaluation should be provided to determine the validity of the conclusions derived from this study \n\n", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}