{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper tackles the problem of geolocating an image from a 3D model of a city. This is an interesting and challenging problem since it involves solving the matching under 3D transformations at large scale.\n\nThe proposed approach is to use geometric features such as edges, faces and depths of the image, which is called \"lean image\" by the paper. The paper demonstrate that by using the \"lean image\" a neural network can recognize its geolocation with substantial accuracy. However, the idea of using geometric features has been investigated in quite a few previous literature and the paper fails to discuss relevant works, e.g., [1,2,3] and distinguish their differences.\n[1] Li et al. Planar Structure Matching Under Projective Uncertainty for Geolocation. ECCV 2014.\n[2] Mousavian and Kosecka. Semantic Image Based Geolocation Given a Map. ArXiv 2016.\n[3] Kim et al. Learned Contextual Feature Reweighting for Image Geo-Localization. CVPR 2018.\n\nThe paper contains mostly empirical evaluations however the provided experiments do not well support the claim that CNN works well with geometric structures in geolocalization. The paper should compare with CNN on RGB images on the same data in order to demonstrate its effectiveness.\n\nReview:\n## Contribution of the paper:\n1. The paper argues that \"lean images\" (geometric structure of a 2D scene) contains sufficient information for solving the memorization of geolocation tasks.\n2. The paper provide an approach to evaluate the argument.\n3. The paper provide experimental validation that the proposed method works fairly on a certain Berlin dataset.\n\n## Feedback\nThe paper is interesting but it does not meet the standard of this conference. There are some key reasons:\n1. The writing is poor. The paper is hard to follow. There are also missing references. The importance of geometry in geolocation has been studied in many previous works.\n2. The paper is empirical so it has to provide strong empirical evidence to support the claim. The experiment is only conducted in Berlin data whose scope is fairly small. Without large scale experiments, it is hard to convince readers that CNN is able to \"memorize\" all the locations using just geometric features. Without comparing to RGB baseline or other existing approaches, it is hard to convince readers that the proposed approach works fairly well. It also seems the input images are just 2D projections so without experiments using real 2D images, it is hard to say the approach is effective.\n\n## Improvements that could be done\n1. Please make sure everything in the tables are clearly explained. The metrics should be explained somewhere in the caption. It is hard to find the meaning of some notations in the table such as \"37K images\", \"Area 400x400\". Please clearly state the unit.\n2. Please include some baseline results into the tables so that readers know how much improvments achieved by your approach.\n3. Please reorganize the paper to make it more clear. \n4. Please provide more literature review and discuss the difference of your work to existing ones.\n\n\n## Questions\n1. How large is the Berlin data?\n2. How would your method work when there is only a street image? How would you method scale when 3D model is not always available.\n3. How would you method work when there is some places without much structure? Rural area could be an example."}