{"title": "Manifold Alignment via Feature correspondence - Review", "review": "The paper proposes an alignment of two manifolds that is performed in a low-dimensional parameter space corresponding to a low-pass \"filtering\" of the Graph Fourier transform obtained from the underlying data graphs for the two manifolds. The numerical results show the quality of the alignment for some toy image datasets and a biological dataset.\n\nThe derivation of the technical details of the approach is not clear - see the comments below on Pages 5,6 and 9 in particular. The paper is not clear enough for acceptance at this point.\n\nDetailed comments:\n\nPage 2: Grammar error \"that is invariant batch effects\". When denoising is discussed, can you explain whether this is denoising or simply regularization? When is the selected subspace a good approximation for the \"signal subspace\"?\nPage 3: Should X^(S) be X^(s)? When W and W(s) are defined, do they also rely on a neighborhood graph? It appears that in the definition of psi_j the eigenvectors phi_j should be obtained from W, not P (which is how they are defined earlier in the page).\nPage 4: There is an abuse of notation on f, used both as a linear function on X(s) and an element of X(s).\nPage 5: Typos \"exlpained\", \"along the along the\". It is not clear what applying a window to eigenvalues means, or what the notation g_xi(lambda) means. The construction of the filters described here needs to be more explicit. h_xi is undefined. How is H in (1) defined when i = 1?\nPage 6: M should be M(s1,s2). Typesetting error in Lambdabar(s). Which matrix is referred to in \"the laplacian eigenvalues of each view\"? What is the source and target of the embedding E? How is the embedding applied to data x(s1), x(s2)?\nPage 7: Figure 1a appears to have an error in the orientation of one of the blue \"3\"s. The text on the arrow between the manifold embeddings does not agree with the notation in the paper. In Figure 1b, it is not clear which image is the original point and which images are the neighbors, or why some images are smaller than others. Results for the other algorithms are missing (why no comparison?). Typo \"Wang&Mahadevan\". Can you be more specific as to why that algorithm was \"unable to recover k-neighborhoods\" in certain cases?\nPage 8: Why no comparison with Wang & Mahadevan in Figure 2?\nPage 9: There is little description as to how manifold learning is applied in the biological data example. What is the ambient dimensionality and the dimension of the manifolds? How are the \"abundances\" extracted from the data? \n\"Which we explore in 4\" -> \"Which we explore in Fig. 4\"", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}