{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper build on the recent Lottery Ticket Hypothesis described by Frankle and Carbin. They focus on a subset of the lottery tickets that they name “boosting tickets”. They argue that these boosting tickets converge faster than the original model and the other lottery tickets. They take advantage of this faster convergence to efficiently train model robust to adversarial perturbation. This application is a good idea and some results are encouraging. However, it is my opinion that the paper in its current form is difficult to follow and that some claims would gain to be justified more thoroughly. \n\nIn particular:\n- The difference between lottery tickets and boosting tickets is unclear. The reader struggles to find any clear definition of “boosting tickets”, besides lottery tickets that converge faster than others. \n- The procedure used to find these boosting tickets (and separating them from the other lottery tickets) is unclear too. The second paragraph in section 3.1 suggests that the main difference between the author’s strategy to find the boosting tickets and the original work lies in the learning rate warm-up. However this warm-up is used only for the retraining once the model is pruned, meaning when the lottery ticket is already found.\n- No theoretical justifications are suggested regarding the existence or the faster convergence of the boosting tickets. Although I agree that a purely empirical work can have a lot of merit, experiments on only a couple of toy datasets, without theoretical justifications, seems not enough to convince of the existence of these boosting tickets.\n\nI’m not an expert on adversarial training so I will let the other reviewers comment on this part.\nLeveraging the performance gain of the lottery tickets to more efficiently train models robust to adversarial perturbations is a great goal. I think that this paper would benefit a lot from extending this part, and dropping the first part on the boosting tickets. It was already noted by Frankle and Carbin that the lottery tickets can be retrained faster than the original model, which seems sufficient for what the authors want to accomplish.\n\nAll in all, I think this paper is not good enough in its current form.\n"}