{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This article mainly proposes a scheme for improving the effectiveness of knowledge distillation, namely, Distillation by Utilizing Peer Samples (DUPS) in one generation, which improves the effective distillation of knowledge while ensuring that the additional cost of training is not significantly increased. And combined with three parts of the experiment to verify the credibility of the proposed solution. I think the main contribution points are as follows:1) soft the label in the knowledge distillation with the help of the teacher model, thereby improving the effectiveness of knowledge transfer. 2) use the dataset in the process of knowledge distillation instead of a single sample.\n\nOn the whole, I give the opinion of rejection, the main reasons are as follows:\n1) Although the method proposed in this paper (DUPS) has improved the effectiveness of knowledge distillation, such as one to two percentage points in image classification tasks, the extent of this improvement has not reached a satisfactory level.\n2) In the part of the label propagation in the paper, I think that the work essentially uses the teacher model to soften the label. However, it seems that the author has explained this part as one of the focuses of his contribution. In fact, this part of the innovation does not very strong.\n3) In the classification task, the method proposed in the paper is not satisfactory on the DenseNet100 model, and there is no effect of some previous methods. I have not seen the authors in this paper to be very convincing explanation about this phenomenon. \n4) I think the authors did three parts of the experiment mainly to verify that his method is very generalized effective, however, I have not seen a more in-depth analysis of its own method through more detailed comparison experiments to compare that the part of the label propagation process and the use of peer examples which are more obvious to the model performance improvement.\n"}