{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper introduces a new algorithm for extreme multi-label classification. The focus of this paper is on being able to handle short documents with all experiments focussed on matching user queries to advertiser bid phrases. The key novelty in this paper is to split the labels into two buckets: head labels and tail labels. The model learns word embeddings on the head labels + a classifier on top of those embeddings. For the tail labels, the embeddings from the head labels are used as the input for another classifier which is trained on only the tail.\n\nMy thoughts on the paper:\n- I really like the paper writeup; its succinctness (in most sections, some comments below).\n- Small nit: why choose head labels as 0.1L? I would have expected a more natural choice to be based on frequency?\n- Figure 1 (and explanation in section 3.1): I understand the head setup completely (although it seems to be missing the ANNS). For the DeepXML-t part, I am not very clear from the picture nor the explanation how the ANSS feeds into the weights and how that leads to the label \\hat{y}+{clf-t}?\n- Section 3.1, DeepXML-h section: the bit after \"Additionally ...\" until \"DeepXML-t\" section is unclear. I think this needs to be explained better.\n- I might have missed it but is PSP metric defined explicitly somewhere?\n- The experiment section contains lots of baseline comparisons; unfortunately not all on publicly available datasets.\n- The paper uses a large number of aconyms which are defined sometimes after their first use, sometimes never: i.e. PLT, ANNS."}