{"title": "interesting approach; good MS-SSIM results; lacking insights / MSE evaluation", "review": "Adaptive Sample-space & Adaptive Probability (ASAP) lossy compressor is proposed. ASAP is based on neural networks.\nASAP jointly learns the quantization width and a corresponding adaptive quantization scheme. Some steps are similar to Nakanishi et al. 2018.\nASAP with the bpp x (1-MS-SSIM) x MSE loss improves in terms of MS-SSIM over Rippel & Bourdev 2017 and Nakanishi et al. 2018 on Kodak and RAISE-1k datasets.\n\nThe idea of jointly learning the quantization width and the adaptive quantization is interesting and the MS-SSIM results are good.\n\nThere is an inconsistency between section 2.2.2 and Fig. 7. I would expect in Fig. 7 also the result for the objective function from eq (6). In Fig. 7 could be added also a reference approach (such as BPG or a learned method).\n\nBy comparing Fig.7 and Fig.2  and Nakanishi et al., I suspect that the improvement of ASAP over Nakanishi et al., comes mainly from the change in the objective function and not from the proposed ASAP core? \n\nThe paper should include/discuss also the paper of \nBalle et al., \"Variational image compression with a scale hyperprior\", ICLR 2018\n\nThe authors target only MS-SSIM, however it is unclear to me why.\nAccording to Balle et al, ICLR 2018 and also to the recent CLIC challenge at CVPR18, learning for MS-SSIM or for PSNR / MSE leads to results that are not necessarily strongly correlated with the perceptual quality. MS-SSIM does not strongly correlate to the perceptual quality, while PSNR / MSE is a measure of fidelity / accuracy towards a ground truth. \n\nI would like to see a comparison in PSNR / MSE terms with BPG and/or Balle et al., ICLR 2018.\n\nI would like to see a discussion on the complexity, design, runtime, and memory requirements for the proposed approach in comparison with the other learned methods.\n\nAlso, it would be good to see more visual results, also for higher bpp.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}