{"rating": "1: Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes an algorithm to perform jointly attribute network embedding and clustering together. Some tricks about how to make use of the node attributes have been explored and put into an overall optimisation criterion. Performance evaluation has been carried out based on three benchmarking data sets.\n\nI will argue for rejecting this paper because of the following two main reasons:\n\n1. Novelty is limited.\n2. Writing quality is not satisfactory. \n\n\n1. Joint learning of embedding and clustering for attribute networks has been studied in recent years. Other than those mentioned in the paper, there are also some others more recent ones:\n- Attributed Graph Clustering: A Deep Attentional Embedding Approach (IJCAI’19)\n- Community Detection in Attributed Graphs: An Embedding Approach (AAAI’18)\n- Attributed Graph Clustering: an Attribute-aware Graph Embedding Approach (ASONAM’17)\nSome seem to give better results than those achieved in this paper. More importantly, while the formulation presented in this paper looks reasonable to me, it is not clear to me which part brings the novelty making new contribution.\n\n2. While the overall structure of the paper is fine, the detailed organization and presentations should be improved. The following gives some examples. Asterisks indicate the potentially problematic parts.\n\n“**Frequently**, embedding and clustering are used to better understand the content and structure information from the clusters.”\n“Many approaches have been proposed for the learning representation and clustering tasks (Bock, 1987; De Soete & Carroll, 1994; Vichi & Kiers, 2001; Yamamoto & Hwang, 2014) **without available information** from a network.”\n“High risk of severe deviation of approximate continuous embedding solution from the good discrete clustering. …” - related background is not provided before to understand this sentence.\n“These problems result from the **sequential way** where the learned representation is obtained before obtaining clusters using a **technical** clustering.” - there are inappropriate use of words.\n\nThe Introduction section can be improved by compressing the current version and then develop the logics which is leading to what being proposed in this paper as well as the explanation regarding why the proposed method is good and significant.\n\nAccording to Table 2, the use of S or W makes a significant different. There could be a possibility that the other methods if using S instead of W will also have significant improvement. If yes, it seems to be the use of S which gives the improvement.\n"}