{"experience_assessment": "I do not know much about this area.", "rating": "8: Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "N/A", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper draws from concepts and patterns of game theory and economics to re-interpret common machine learning algorithms, and introduces a paradigm of n-player games such that there exists a simple way to study such games where each player is individually optimized by machine learning algorithms. \n\nOverall, this is a very interesting and inspiring paper with its interdisciplinary touch, but at the same time doesn’t lose readability for audience with mostly machine learning background. The paper is clear, concise, and well-written, and hence I do not have any overarching comments. There are several suggestions and questions, though, that I’d like to propose.\n\n1. Since many concepts are not from the machine learning domain, further and more detailed touch on related work are very beneficial. The current section of related work (Section 1.2) is more succinct than laying the right background information. Authors could consider giving some examples of “market mechanism”, and similarly for “design pattern”. This can give readers some ideas on how this present work’s use of “existing design pattern” is different from prior works’ proposals of “market mechanism”. Again for the second paragraph, although these concepts are more familiar to the audience, a short description for each mentioned concept is good to include (e.g. monotone games, etc)\n\n2. Move Lemma 1 before Definition 2? Since Lemma 1 is most related to Definition 1 and not related to Definition 2.\n\n3. For Definition 2, authors could consider adding “the classic definition [of Nash equilibrium]” to the list to clarify the difference. This classic Nash equilibrium definition will be referred to again in later sections. \n\n4. In Section 2.1, consider giving a formal definition of “potential game”.\n\n5. In Section 2.3, it is not immediately clear after the text why stop_gradient becomes a problem.\n\n6. In Section 3.1, could we elucidate a bit on what is “near zero sum”?\n\n7. In Section 5, why the equation following the text “firm i’s forecast” is always positive? Since by definition, forecast is meant to represent the change of profit, which can be negative?\n"}