{"rating": "8: Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "N/A", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper introduces smooth market games (SM-games), a class of smooth games characterized by pairwise zero sum interactions, and show SM-games possess a number of appealing properties:\n- A fixed point is a local Nash equilibrium iff it is stable\n- Local convergence to stable fixed points\n- Unstable fixed points are repellent\n- Dynamics are bounded, assuming diminishing returns-to-scale for sufficiently large vectors.\nThe need for a class of games with such properties is motivated by a discussion of the pathologies of smooth games under simultaneous gradient ascent. \n\nThe paper has an extensive literature review, addresses an important problem, and has informative discussions. It is well written and there are nice examples to illustrate the central ideas. However, I do have some criticisms:\n\n1. The writing in this paper is sometimes pompous. Quoting James Scott has no added value to this work. Reference to Adam Smith’s invisible hand not only has no added value but is also confusing and detracts from the paper — SM-games are not purporting to be real economic models.\n2. Throughout the paper there is a confusing mix between ideas from economics and ideas from accounting. For example, it is not correct to say that aggregate revenue is the same as GDP. Revenue is an accounting term to show how much benefit you record in a year. GDP measures the value of production. It would be more accurate to write that aggregate output and GDP are the same. But if SM-games are reflecting the perspective of an accountant, as is stated, why is GDP being discussed at all? Similarly, the idea of a dummy player with off the book costs is not consistent with an accounting perspective. I think that the paper would be clearest if it did not attempt to use terminology from other fields. But if it is going to do so, it should make a more substantial effort to do so consistently."}