{"title": "Limited novelty; Experiments are not enough", "review": "\n[Summary]\nThis paper proposed an algorithm for zero-shot translation by using both dual learning (He et al, 2016) and multi-lingual neural machine translation (Johnson et al 2016). Specially, a multilingual model is first trained following (Johnson et al 2016) and then the dual learning (He et al 2016) is applied to the pre-trained model using monolingual data only. Experiments on MultiUN and WMT are carried out to verify the proposed algorithm. \n\n[Details]\n1.\tThe idea is incremental and the novelty is limited. It is a simple combination of dual learning and multilingual NMT. \n\n2.\tMany important multilingual baselines are missing. [ref1, ref2]. At least one of the related methods should be implemented for comparison.\n\n3.\tThe Pseudo NMT in Table 3 should also be implemented as a baseline for MultiUN experiments for in-domain verification.\n\n4.\tA recent paper [ref3] proves that using more monolingual data will be helpful for NMT training. What if using more monolingual data in your system? I think using $1M$ monolingual data is far from enough.\n\n5.\tWhat if using more bilingual sentence pairs? Will the results be boosted? What if we use more language pairs?\n\n6.\tTransformer (Vaswani et al. 2017) is the state-of-the-art NMT system. At least one of the tasks should be implemented using the strong baseline.\n\n[Pros] (+) A first attempt of dual learning and multiple languages; (+) Easy to follow.\n[Cons] (-) Limited novelty; (-) Experiments are not enough.\n\nReferences\n[ref1] Firat, Orhan, et al. \"Zero-resource translation with multi-lingual neural machine translation.\" EMNLP (2016).\n[ref2] Ren, Shuo, et al. \"Triangular Architecture for Rare Language Translation.\" ACL (2018).\n[ref3] Edunov, Sergey, et al. \"Understanding back-translation at scale.\"EMNLP (2018). \n\nI am open to be convinced.\n\n==== Post Rebuttal ===\nThanks the authors for the response. I still have concerns about this work. Please refer to my comments \"Reply to the rebuttal\". Therefore, I keep my score as 5.\n\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}