{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper proposes a model under which to study social networks under attacks attempting to propagate misinformation. It proposes a theoretical model based on assumptions on what kinds of graphs are common in social media and what kinds of attacks take place. While this could be interesting, the work presented falls short of what it promises, i.e. to develop a practical model of fake news on social networks,  because many of the assumptions made about the phenomena under study are unrealistic. In more detail\n\n- There is a lot of research looking at social network graphs and analyzing them. As an example, here is a paper by Kate Starbird: https://www.aaai.org/ocs/index.php/ICWSM/ICWSM18/paper/view/17836/17028 \nI believe that there is little reason to generate data if one can collect them\n- Even if generating the data can be justified, the graphs on which the methods are studies are 10-12 nodes. I can't see why such a low number was chosen given that the data is simulated, but it doesn't allow to assess whether the methods proposed would be practical in a real social network\n- There is work suggesting that misinformation spreads faster than information: https://science.sciencemag.org/content/359/6380/1146\nThus it would make sense to take this into account in designing the graph theoretical model. Given this though, it is unlikely that the assumption that the social network will converge to the truth.\n- Assuming that the social network graph remains fixed over time is also unrealistic. One can study how Twitter networks evolve over time\n- The modelling of the users as merely voting on the truth or false value of a claim is not what happens in most social networks in which users fave/like, share, etc. Furthermore, it doesn't make that users want to prevent other from copying them. Being retweeted is a sign of influence, and users want to be influential.\n- The attacks described do not seem to be grounded in any evidence/research on how misinformation propagates and what attackers actually do, so I can't accept the results of the analyses that use them."}