{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "The authors described a complete system that can conduct natural language conversations with human in English. The system consists of multiple layers of state-of-the-art DNN models. There are a number of special consideration in additional to standard bidirectional RNN embedding. The syntactic long-distance dependency is captured by a graph convolution network; multi-head attention layer is used; external knowledge from one-hop wikipedia expansion is added as additional BERT embeddings; a memory module is used to capture conversation history; triplet loss is used to optimize the whole model with a positive and negative response sample for each user input. The resulted system is fairly complete and performs end-to-end conversations  well when evaluated by Persona-Chat dataset and human raters.\n\nThe paper described the system in great detail. Reviewer appreciates the completeness of the system and good evaluation. It can serve as a good reference paper for others to build.\n\nFeedback:\n\n1) The authors use \"multi-stream\" heavily in the introduction and claimed conclusion, but spent much less in the main body to explain why multi-stream is a key innovation or performance differentiator. Reviewer suggests either add more explanation or drop that term.\n\n2) in Section 4.1, authors mentioned self-loop in dependency tree is also included in the graph. Pardon my lack of recent knowledge but it could help other readers like me if you can give some examples of those self-loop dependencies and show why they are important to keep.\n\n3) In Section 53 second paragraph, the candidate set was created by using word-overlapping, is this about any word or some salient terms (I guess the latter). If so, this may exclude the candidates with no direct word overlap but still relevant, such as paraphrases or synonyms. Love to see some notes about the potential effects while acknowledging the difference might be minor.\n\n4) Reviewer didn't see any example conversations from the system. Given the difficulty in evaluating a dialog system objectively and quantitatively, it's equally important to highlight the actual conversations.\n\n5) Will the system be open-sourced? It's a great contribution of the paper if that's the case, otherwise it could be laborious for others to reimplement it as reference system or in real-world application which damages the long-term impact of the paper. \n"}