{"rating": "6: Weak Accept", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper proposes a scale-equivariant Neural Networks model to solve the multi-scale image classification task. The main contributions are the proposed joint convolution across the spatial and scale space, and the decomposed filters to reduce computation cost and improve robustness.\n\nThe paper is generally well-written and well placed in the literature. Different from existing work on the scale-equivariance CNNs, they build a more general model that allows different scale information to transfer through different layers. The experiments also suggest the model achieving scale-equivariance and the superior performance of the proposed method compared with several baselines. However, for the novelty part of the proposed method (the separable basis decomposition), it is not convincing enough because the differences between this paper and Cheng et al. (2019) and Weiler et al. (2018b) are not clear.\n\nQuestions:\n1. The authors claim that the joint convolutions across the space and the scaling group are both \"sufficient\" and \"necessary\". Although the experiments show that the proposed method achieves better performance, which might indicate the \"sufficiency\" of the architecture, however, how should the \"necessity\" be proved?\n2. How should \"K\" and \"K_\\alpha\" be selected (Table 1)? When data is enough (e.g., 5000), it seems that only some specific values can improve performance.\n3. How much can the model size be reduced compared with other multiscale image classification models? And could you provide some concrete comparisons about the computation cost?\n\nTypos:\n- 1st line in 2nd paragraph of Introduction: rotation-equivarianc(e)"}