{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "In this paper the authors present a new way to use autoregressive modeling to generate images pixel by pixel where each pixel is generated by modeling the difference between the current pixel value and  the preexistent ones. In order to achieve that, the authors propose a copy and adjustment mechanism that select an existing pixel, and then adjust its sub-pixel (channel values) to generate the new pixel. The proposed model is demonstrated with a suite of experiments in classic image generation benchmark. The authors also demonstrate the use of their technique in Image to Image translation.\nOverall, although the paper explain clearly the intuition and the motivation of the proposed technique, I think that the paper in its present state have low novelty, weak related work analysis review and insufficient experiments to support a publication at ICLR. \n\n\n\n**Novelty, contribution and related work**\nThe authors should highlight better their main contribution novelty of the proposed method compared to their baseline.\n\n\n**Result and conducted experiments**\nthe correctness of the proposed approach is not proved by the conducted experiment  in fact:\nThe experiments do not provide the details of the used architecture compared to your baseline. \nIn Table 1 you report the results using your technique on several computer vision tasks (generation, colorization and super-resolution) but you're not comparing with the SoA of each of these tasks.\nThe  results reported in Tables 1 and 2 are not convincing  when compared to existing approaches (using only CIFAR10 in Table2). \nThere are so many missing details specially to validate Image-To-image translation \nFigure 3 is confusing and  not clear  \n\n**Minor comments**\nIn  references section : (Kingma & Dhariwal, 2018) is not in a proper format (nips 2018)\nBad quality of illustrations and images \nBe coherent with the position of captions (figure 3)"}