{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "Summary：\nAuthors proposed adversarial attribute learning (AAL) that can directly exploit the attributes with negative transfer to improve the attribute prediction. The gradient reversal technique is adopted to solve the adversarial training problem. Experimental results reveal that AAL benefits from the negative transferred attributes.\n\n\nComments:\n1.\tWhy is the learned CNN representation, which is invariant to auxiliary attributes, more suitable for classifying the main attribute? The improvement of adversarial attribute learning compared to the single task attribute training is not significant (92.46% vs 92.33%).\n\n2.\tThe ablation experiments are conducted on the validation set. The authors should give the results on the test dataset.\n\n3.\tThe result of the multi-task is better than the single task, which means that some attributes are positively transferred. Thus, can these positive transferred attributes be exploited?\n\n4.\tIn the ablation study of “Multiple adversarial attributes”, it can be observed that the result of using all the negative attributes is worse than that only uses the most negative attribute. This result seems inconsistent with the assumption that negative attributes are helpful in the proposed AAL model. The authors should give a more detailed interpretation.\n\n5.\tIs the most negative attribute the most suitable for training the attribute learning model? The authors should verify this point.\n\n6.\tThe idea of the proposed adversarial attribute learning model is interesting and practical. While how to find the most suitable auxiliary attribute set is also important and can make this work more solid.\n\n7.\tSome writing issues should be improved.\n\n"}