{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper proposes an interesting idea: given that multi-task training of two tasks leads to poorer performance for the first task, one can perform multi-task training with the *inverted* gradients of the second task instead and obtain improved performance for the first task. This is motivated as follows: if features required for the second task induce worse performance for the first task, then becoming invariant to the labels of second task may induce better performance of the first task. This is applied to attribute learning settings.\n\nThe paper reports initial experimental findings indicating minor advantages to this approach: mean performance across attributes improves from 92.34% with single task training to 92.46% with the proposed approach on CelebA and from 92.19 to 92.32% mean accuracy on a recent person attribute dataset.\n\nI would find the empirical phenomenon interesting if confirmed more thoroughly, and worthy of closer study. However, as things stand, the findings are at best preliminary. Both negative transfer itself, and the gains from the proposed approach to exploit it to improve performance are very marginal at best, and no error bars are shown, leaving open the possibility of statistical insignificance.\n\nConceptually, the connection to Jayaraman et al 2014, which proposes to use different features to predict different semantic attribute groups, is not explained.\n\nI would be interested in a study of the various positive and negative task transfer groupings that emerge, in the spirit of work like Zamir et al, \"Taskonomy ...\".  Do these groupings have anything to do with semantic meanings and groupings of attributes?\n\nIn general, it feels like this work scratches the surface of some interesting empirical phenomena, but falls short of either providing conclusive evidence for them or of providing theoretical insight into them."}