{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "Summary:\nThis paper aims at classifying visual attributes. To overcome the performance dropping of training multiple attributes in one model since different attributes focus on different kinds of features, they propose to independently classify each attribute and leverage such \"negative\" attributes to boost the invariance of features for the target attribute. Specifically, the classifier should accurately classify for the target attribute, but cannot decide the right labels for its negative attributes, which resembles an adversarial learning manner. To this end, they turn to the reversal gradient technique proposed in domain adaptation area. \n\n+Strengths:\n1. The writing is easy to understand. Motivations, related works and techniques are clearly introduced. The Fig.1 of the method is also informative and clear.\n2. The idea of leveraging negative attributes to learn robust attributes is interesting and may give insights to other multi-task learning problems.\n\n-Weaknesses:\n1. My biggest concern is the performance of their method. They conduct experiments on the relatively easy solved face attributes and pedestrian attributes. We can find that the performance differences between baselines and SOTA are quite slight, which cannot draw convincing conclusions to support their claims in the paper. They'd better to do these on other more challenging attribute datasets, such as AwA dataset. Considering that the performance gain is quite slight while the training time and storage cost is increased obviously compared with multi-task training and traditional single task training, the value of this method is not high to this task. \n2. The first sentence in the Abstract is not idiomatic. Please make a verification. \n3. This paper seems not have obvious technical contributions. The significant component reversal gradient has been studied in the related domain adaptation works.\n4. The procedures to obtain the most negative attribute are not scalable and efficient when large scale of attributes need to be classified."}