{"title": "Usage of a standard GPLVM for covariance modeling of daily S&P500 time series to optimize portfolios and predict missing values.", "review": "Summary\nThe paper uses standard GPLVMs to model the covariance structure and a latent space representation of financial time series. On daily close prices of S&P500 data, the authors demonstrate that the approach is a useful covariance model.\n\nQuality\nAlthough the application is clear and the methodology is well established, the quality of the submission can be improved by a better connection to prior work in the finance domain. Being not an expert here, it seems that there should be more advanced methods one might want to compare to. In particular missing standard deviations in the figures make it hard to judge the relevance of the empirical evaluation.\n\nClarity\nThe manuscript is well written and the technical content and the experimental results are well accessible to the reader. A little bit more attention needs to be paid to properly defining all quantities. See \"Details\".\n\nOriginality\nThe application to financial time series is straight forward but I have not seen it before. The manuscript does not modify the standard GPLVM methodology.\n\nSignificance\nAs the application is obvious and as the evaluation of the methodology does only include very little comparison to existing algorithms, the significance of the presented work is limited.\n\nReproducibility\nThe data can be obtained from Yahoo finance, the implementation is based on scikit-learn. Although the authors do not provide code and data, the work should be reproducible with reasonable effort. Missing details of the GPLVM optimization and the unknown random split might prevent the exact replication of the results.\n\nPros and Cons\n1-) Non-stationarity is not dealt with.\n2-) Figure 1: standard deviations should be added.\n3+) The model is simple and well established.\n4-) Proper optimization can be cumbersome and is inherently plagued by local minima.\n\nDetails\na) Title: The paper is about GPLVMs rather than GPs\nb) Abstract: betas is an undefined term here\nc) Intro: w, r, K are not properly defined\nd) Intro: Gaussian Process -> Gaussian process\ne) Intro: In Bayesian framework -> In a Bayesian framework\nf) Sec 2.1: $f \\in R$ -> $f(x) \\in R$\ng) Eq. 5/6: this is only correct for m(x)=0 and no noise\nh) Sec 3.1: missing reference for CAPM\ni) Sec 4.1: please also mention N and D\nj) References: Neil Lawrence, ... Gaussian process latent ...\nk) References: Bayesian Gaussian", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}