{"title": "Lacks comprehensive results on real-world data sets, writing does not seem revised", "review": "This paper proposes using structured mini-batches to speed up learning of embeddings. However, it lacks sufficient context with previous work and bench-marking to prove the speed-up. Furthermore, it is difficult to read due to its lack of revision. Sentences are wordy and do not always have sufficient detail. \n\nArgument issues and questions:\n- Since the main claim is a speed-up in training, the authors should support with robust experimentation. Only a synthetic and small test are conducted. \n- Not being an expert in this subject, it was difficult to follow some of the ideas of the paper. They were presented without clear explanation of why they supported the conclusion. For example,  I do not understand Figure 4. It seems COO and IND change places. It is not always clear how the figures support the argument. \n- What impact does the size of the micro-batch have on the speed-up? \n- How does this approach compare to other embedding approaches in terms of speed? There are no benchmarks other than IND. \n\nFormatting issues:\n- On page one, the sentence \"We make a novel case here for the antithesis of coordinated arrangements,\nwhere corresponding associations are much more likely to be included in the same minibatch\" seems contradictory. It reads that you are arguing for \"the antithesis of coordinated arrangements, namely independent arrangements\" when you mean \"the antithesis of independent arrangements, namely coordinated arrangements.\"\n- The figures in this paper are all very small with minuscule text and legends. Only after zooming in 200% were they legible. Figure 3, 4, 5, 6, and 7 have no axis labels. It is sometimes clear from the caption what the axes are, but it is hard to follow. \n- Often references are cited in the text without being set off with parentheses or grammatical support. For example at the top of page three: \"One-sided updates were introduced with alternating minimization Csiszar & Tusnády (1984) and for our purposes they facilitate coordinated arrangements and allow more precise matching of corresponding sets of negative examples to positive ones.\" This interrupts the sentence making it hard to read. \n\n\n\n\n\n", "rating": "3: Clear rejection", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}