{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes to utilize Neural ODEs (NODEs) and the Level Set Method (LSM) for the task of image segmentation.  The argument is that the NODE can be used to learn the force function in an LSM and solve the contour evolution process. The authors propose two architectures and demonstrate promising performance on a few image segmentation benchmarks. \n\nWhile I like the attempt to combine deep learning with traditional CV algorithms, I do not think this submission is suitable for acceptance. My major critique is that both the two proposed models (Figure 2) are essentially two fully differentially NODE based architecture trained in a purely supervised way (by minimizing MSE). This makes the flavor of the proposed methods drastically different from what an LSM does, whereas the latter heavily rely on rich priors embedded in the design of the force function. To be more specific, the image evolution method (Figure 2(b)) essentially has nothing to do LSM. The contour evolution method bares more similarity to LSM but only in the sense that it learns to iteratively refine a contour estimation with an NODE. In the experimental evaluations, it seems that the image evolution model works favorably compared to the contour evolution method. This suggests that the main benefit of the proposed method comes from applying an NODE based architecture to a supervised learning task, rather than the inductive prior brought by LSM.\n\nGiven this, I think a much more proper way of presenting this work should be from the view of applying an NODE to the supervised image segmentation task. This reduces the novelty but increases clarity, and may still make the work a useful empirical reference for these benchmarks.\n\nSome more detailed comments:\n1. Equation 3&4 are not super easy to follow. For example, \\gamma^{(1)} is not defined or explained in main text.\n2. A related work section will be useful, especially for readers who are not familiar with LSM and NODE related literature.\n3. Experiments with more careful control needed. For example, from Table 1, it seems that the baseline Unet 15M performs inferior to the 5M model (explanation needed too), while Table 2 only compares against the 15M model. This makes it difficult to interpret the results."}