{"title": "Interesting inverse graphics model. Motivation and experiments are lacking.", "review": "This paper explored explaining scenes with surfels in a neural recognition model. The authors demonstrated results on image reconstruction, synthesis, and mental shape rotation. \n\nThe paper has many strengths. The model is clearly presented, the implementation is neat, the results on synthetic images are good. In particular, the results on the mental rotation task are interesting and new; I feel we should include more studies like these for scene and object representation learning. \n\nA few concerns remain. First, the motivation of the paper is unclear. The main advantage of the proposed representation, according to the intro, is its `implicitness’, which enables viewpoint extrapolation. I’d like to see more explanation on why ‘explicit’ representations don’t support that. A lot of the intro is currently talking about related work, which can be moved to later sections or to the supp material.\n\nThe paper then moves on to discuss surfels. While it’s new combine surfels with deep nets, I’m not sure how much benefits it brings over voxels, point clouds, or primitives. It’d be good to compare with these scene representations. \n\nMy second concern is the results are all on synthetic data, and most shapes are very simple. While the paper is called ‘pix2scene’, it’s really about ‘pix2object’ or ‘pix2shape’. I’d like to see results on more realistic scenes, where the number of objects as well as their shape and material varies.\n\nFor the mental rotation task, the authors should cite and discuss the classic work from Shepard and Metzler and include human performance for calibration.\n\nI’m on the border for this paper. Happy to adjust my rating based on the discussion and revision.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}