{"rating": "3: Weak Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper solves the problem of unsupervised domain adaptive object detection. They proposed a method on top of Strong-Weak alignment (Saito et al., 2019). In this previous work, two losses are proposed, a weak-alignment loss for global features and strong-alignment loss for local features. In addition, the previous work proposed to utilize context-vector for effective object detection. \n\nTheir contributions of this paper are summarized as follows.\n1, adversarial alignment losses for low-level features by adding domain classifier to many low-level layers\n2, adding context features from the low-level features \n3, they proposed to detach the gradient from the context features to avoid a negative transfer.  \n4, the effectiveness of their method is validated through extensive experiments on many object detection datasets. \n\nI lean toward rejecting this paper from the following weakness.\n\n1, Their method lacks technical novelty to accept. Adding many domain classifiers to lower-level layers and adding more context vectors are just minor modifications to Strong-Weak alignment (Saito et al., 2019). In Strong-Weak alignment (Saito et al., 2019), the idea of performing adaptation in multiple-layers and using context-vector are proposed. In Chen et al., 2018, using instance-level features for alignment is proposed. Although the use of these techniques is a slightly different from these existing works,  the difference is too minor. \n2, The presentation is poor, especially in the introduction. For example, they introduced COL in the introduction. However, I could not see a close connection with this paper. In \"Our key ideas\" part, it is also unclear what was the key idea and novel idea. \n"}