{"title": "Nice empirical study of invariants in modern CNNs, with quantitative support at all key points.", "review": "This paper describes an empirical study of translation and scale\ninvariance properties of modern CNN architectures. The authors conduct\na thorough study of translation invariance in VGG16, ResNet50, and\nInceptionResNet with respect to the Nyquist frequency and shift-\nversus translation-invariance properties of network layers as a\nfunction of depth and subsampling rate. Empirical observations are\nquantified using a variety of metric to measure the stability of\nfeature maps under geometric transformations of the input.\n\nThe paper has the following strong points:\n\n 1. It tells an interesting (and engaging) story about a largely\n    empirical study, and while doing this never pretends to be more\n    than it is.\n 2. Empirical observations are supported by quantitative measures that\n    give compelling evidence for most observations in the paper. The\n    discussion about shiftability versus translatability is\n    particularly interesting with its link to nonlinearity, smoothing\n    and Nyquist limits.\n\nThe paper has the following weak points:\n\n 1. The reliance on inpainting for almost all experiments is somewhat\n    worrying. It is not clear that this procedure isn't introducing\n    its own biases affecting translation and scale invariance. The\n    authors make reference to a separate protocol reported in the\n    appendices, but it isn't clear which results in the appendices\n    they are referring to. A more thorough control study seems in\n    order to verify that inpainting is a reasonable simulation.\n 2. Some figures are scaled down to the limits of legibility.\n\nIn summary: I like this paper a lot, and I think it adds useful\nelements and analytical tools (both theoretical and empirical) to the\ndiscussion on invariants in modeern CNNs.\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}