{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper aims to propose a new way of discovering a specific type of temporal abstraction, the pattern of actions. To achieve this goal, it applies the sparse coding method to discover an efficient encoding of the action sequences generated by the agent's interaction with the environment. The filters/dictionaries discovered by the method then represent certain patterns of actions.\n\nIn general, I think it proposes an interesting view of the temporal abstraction. Although this kind of temporal abstraction is only valid in the certain types of environment (For example, as it only represents certain patterns of action sequence, it suffers from non-optimality in stochastic environment where no fixed action sequence would be optimal for solving the problem), the paper, especially the experiment part, clearly tells its readers in what situation can we expect it to perform well. In this sense, I think it provides some scientific insights that benefit my understanding.\n\nHowever, there are many places in the paper making me confused. Therefore I can not fully understand the paper and can not accept it. My concerns are:\n\n1. Equations 1, 2, and 3 are loosey-goosey. For example, there is no definition of x_i, is it a vector or a scalar? Similarly, there is no definition of W and s.\n2. paragraph 3 in section 3 is extremely hard to understand. For example, the first sentence: \"At all stages, the size of the dictionary elements is set to 2-timesteps\". Where does the \"2-timesteps\" come? I have no idea what it is talking about.\n3. in the algorithm, T_i is not defined.\n4. in the experiment part, figure 4 only provides the termination of options/skills but doesn't provide corresponding policies/action sequence, which makes me hard to evaluate the result.\n5. figure 7 and 8 seems to be contradicted with the paper's claim. And the author didn't give a reasonable explanation.\n"}