{"title": "Contains a good overview and extensive simulations. Unfortunately poor technical writing.", "review": "\nComposing polyphonic music is a hard computational problem. \nThis paper views the problem as modelling a probability distribution \nover musical scores that is parametrized using convolutional and recurrent \nnetworks. Emphasis is given to careful evaluation, both quantitatively and qualitatively. The technical parts are quite poorly written.\n\nThe introduction is quite well written and it is easy to follow. It provides a good review that is nicely balanced between older and recent literature. \n\nUnfortunately, at the technical parts, the paper starts to suffer due to sloppy notation. The cross entropy definition is missing important details. What does S exactly denote? Are you referring to a binary piano roll or some abstract vector valued process? This leaves a lot of guess work to the reader. \nEven the footnote makes it evident that the authors may have a different mental picture -- I would argue that a piano roll does not need two bits. Take a binary matrix: Roll(note=n, time=t) = 1 (=0) when note n is present (absent) at time t. \n\nI also think the term factorization is sometimes used freely as a synonym for representation in last paragraphs of 4 and first two paragraphs of 5 -- I find this misleading without proper definitions.\n\nThe models, which are central to the message of the paper, are not described clearly. Please\ndefine function a(\\cdot) in (2), (3), (4), : this maybe possibly a typesetting issue (and a is highly likely a sigmoid) but what does x_p W_hp x x_pt etc stand for? Various contractions? You have only defined the tensor as x_tpn. Even there, the proposed encoding is difficult to follow -- using different names for different ranges of the same index (n and d) seems to be avoiding important details and calling for trouble. Why not just introduce an order 4 tensor and represent everything in the product space as every note must have a duration? \n\nWhile the paper includes some interesting ideas about representation of relative pitch, the poor technical writing makes it not suitable to ICLR and hard to judge/interpret the extensive simulation results.\n\nMinor:\n\nFor tensors, 'rank-3' is not correct use, please use order-3 here if you are referring to the number of dimensions of the multiway array. \n\nWhat is a non-linear sampling scheme? Please be more precise.\n\nThe Allan-Williams citation and year is broken:\nMoray Allan and Christopher K. I. Williams. Harmonising Chorales by Probabilistic Inference. Advances in Neural Information Processing Systems 17, 2005.\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}