{"rating": "1: Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper introduces a collaborative generated hashing (CGH) method to learn hash funcations of users and items from content data. The approach first provides a strategy to discover potential users by the generative step and inference through adding balanced and uncorrelated constraints. The experiments demonstrates some effectiveness on improving accuracy for both warm-start and cold-start recommendations.\n\nThis paper should be rejected because (1) this method only combines existing techs, such as Stochastic Generative Hashing (Eq.1 and Eq. 6), and lacks novelty; (2) lack of introduction to related work and baselines, (3) the experiments results can not support the claim, i.e. the effectiveness of CGH in marketing area, and (4) paper writing is awful and very hard to follow.\n\nMain argument\n\nAlmost every essential parts of the proposed method are from existing methods:\n(I) Eq. 1 and Eq. 6 are proposed by Stochastic Generative Hashing [1];\n(II) Eq. 2 and Eq. 5 are a multivariate Bernoulli distribution;\n(III) Eq. 3 is a normal distribution;\n(IV) Eq. 7 is proposed by [2];\n(V) loss function Eq. 9 is follow the Minimum Description Length principle [1];\nThe proposed method CGH is a combination of these techs and compared with these methods, there are few novel aspects.\n\nThis paper omits the related work part and does a rough introduction to two baselines (CDL and DropoutNet) in a confusing way in Section 2. A concise and precise introduction to other methods will help the reader to better understand the related works and the advantages and disadvantages of the proposed method.\n\nThe experiments do not provide convincing evidence of the corretness of the proposed method, especially in Section 3.3. In Section 3.3, Figure 3 shows the performance on Accyracy@k without any baseline. The results do not demonstrate the validity of the method and therefore cannot support the author's claim.\n\nThings to improve the paper that did not impact the score:\n1) page 1, 4th line in the 3rd paragraph, 'efficient' -> efficiently\n2) page 3, 1st sentence in Section 2.1\n3) page 3, hard to find the definition of the similarity function \n4) page 4, 2nd line 'similar for' -> 'similar to'\n5) page 6, 3rd paragraph 'From Fig. 2, we discosver the k nearest potential users for an item j'. What do you mean?\n\n\nReference\n[1] Bo Dai, Ruiqi Guo, Sanjiv Kumar, Niao He, and Le Song. Stochastic generative hashing. In Proceedings of the 34th International Conference on Machine Learning-Volume 70, pp. 913–922. JMLR. org, 2017.\n[2] Ke Zhou and Hongyuan Zha. Learning binary codes for collaborative filtering. In Proceedings of KDD’12, pp. 498–506. ACM, 2012."}