{"rating": "1: Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "The paper proposes new hashing schemes to learn hash codes to describe users/items for the purpose of recommendation.\n\nIt is claimed that doing so leads to three contributions\n(1) the new hash codes themselves, which can apply to various recommendation settings\n(2) the ability to better discover potential users in e-commerce settings\n(3) state-of-the-art performance on several datasets\n\nIn terms of (1), the paper contrasts with Collaborative Deep Learning and dropoutnet. The main difference compared to CDL is that the hashing-based method learns binary codes. Compared to DropoutNet the main difference is the use of a stacked autoencoder, rather than a different neural network architecture. This latter contribution is perhaps a little thin (really it's just a technical detail); the additional contribution of being able to be used as a marketing strategy I didn't really follow.\n\nThe \"mining potential users\" contribution (contribution 2) seemed a little ad-hoc to me. It ultimately seems like a variant of KNN, and seems like something similar could be attempted for other methods.\n\nTraining etc. looks fine, though I didn't fully check the details.\n\nThe experiments seem not totally convincing. Most critically, the method does not seem to exhibit state-of-the-art performance as claimed, but is somewhat lower (in terms of accuracy) than other baselines. It might be better in terms of speed but this doesn't seem to be thoroughly evaluated. The choice of accuracy as the only evaluation metric also seems unusual.\n\nThe selection of datasets is also quite limited. It's claimed that these are the only datasets with user and item content, but why are both needed to run an experiment? Can't this method work with either (in which case many other datasets would be appropriate)?\n\nOverall the actual results seem mixed, and thus the paper hinges on its statement that it has the \"advantage of applications in marketing area\". However this latter contribution seems handwavy.\n\nIn order to be accepted, I'd need to see\n-- More clearly stated and demonstrable contributions\n-- More compelling experiments, in terms of datasets, evaluation measures, and actual performance"}