{"title": "Less Novel and Lacking Baseline", "review": "In this paper, authors propose a deep structured model to solve the problem of learning graph decomposition. They formulate graph decomposition as a minimum cost multi-cut problem which can be regarded as the MAP problem of a properly designed high-order CRF. Authors further approximately solve the MAP by unrolling the mean-field inference. Experiments on MNIST and MPII Human Pose dataset show that the proposed method is promising.\n\nStrength:\n\n1, The idea of formulating the cycle constraint in the minimum cost multi-cut problem as a high order energy function is inspiring.\n\n2, The human pose estimation is an interesting application for the learning based graph decomposition method.\n\nWeakness:\n\n1, How does the formulation of binary cubic programming in Eq. (3) and (4) exactly relate to the energy formulation in Eq. (5)? Especially, it is not clear how the third order term in Eq. (4) is used in the high order term of CRF. Moreover, there is no explanation of what “the set of recognized label configuration” is and how it is constructed in the experiments. Since the high order term is one of the main contribution of the paper, I do think authors need to clarify in a detailed manner.\n\n2, This paper targets at learning graph decomposition. Authors did not introduce the problem setting in the beginning and directly discussed the minimum cost multi-cut formulation. I would imagine there are other formulations for decomposing the graph like spectral clustering. However, I did not see any discussion or comparisons of these alternative formulations. In particular, in the first experiment, since you are doing clustering of images, why not compare your method with some baselines of clustering methods which use the same deep feature?\n\n3, Mean field inference as an approximated MAP solver is itself very crude although it is easy to implement as a RNN. Authors should at least compare it with other MAP solvers like max-product to gain a better understanding of the approximation quality. Also, from Table 2, it is hard to tell whether the mean-field converges or not. It is better to plot the free energy vs. inference iteration.\n\n4, Some closely related work is not discussed. The following paper develops a message passing algorithm for solving the same inference problem.\n\nSwoboda, Paul, and Bjoern Andres. \"A message passing algorithm for the minimum cost multicut problem.\" In IEEE Conference on Computer Vision and Pattern Recognition, CVPR, vol. 3, no. 6. 2017. \n\nOverall, I would like to hear authors’ feedback.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}