{"title": "Review of \"Adaptive Convolutional Neural Networks\"", "review": "This paper presents a pretty cool idea for enabling \"adaptive\" kernels for CNNs which allow dramatic reduction in the size of models with moderate to large performance drops.  In at least one case, the training time is also significantly reduced (2x).\n\nThe best part about this paper is that the size of the models are much smaller; but the paper does offer any explanation of the value of this.  For example, even a 1% drop in accuracy can be unacceptable; but in some applications (like cell phones and IOT devices) model size is critical.  The authors' should add some wording to explain this value.\n\nThe \"adaptive\"kernels the the authors talk about are really a new class of nonlinear kernels.  It would be very interesting to see a discussion of the class of functions these nonlinear kernels represent.  This kind of discussion would give the reader  motivation for the choice of function, ideas for how to improve in this class of functions, and insight into why it works.\n\nThe method presented is interesting; but it is not clear that it is present with enough detail for it's results to be replicated.  It would be nice if the authors pointed to a git repository with their code an experiments.  More importantly, the results presented are quite meager.  If this is a method for image recognition, it would be better to present results for a more substantial image recognition problem than MNIST and CIFAR-10.  And the analysis of the \"dynamic range\" of the algorithim is missing.  How do performance and model size trade off?  How were the number of layers and kernels chosen?  Was the 5x10x20x10 topology used for MNIST the only topology tried?  That would be very surprising.  What is the performance on all of the other topologies tried for the proposed algorithm?  Was crossvalidation used to select the topology?  If so, what was the methodology. \n\nAdditionally, some readers may find this paper a little difficult to read due to (1) lack of clarity in the writing, e.g., the first three paragraphs in Section 3; (2) omitted details, e.g., how much overlap exists between kernels (Figs. 1, 2, and 4 suggests there is no overlap - this should be made clear); and (3) poor grammar and nonstandard terminology, e.g., the authors' use of the word \"energy\" and the phrase \"degradation problem\".  All of these issues should be addressed in a future version of the paper.\n\nNot sure why Eqns. 2 and 9 need any parentheses.  They should be removed.", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}