{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper aims to examine whether DNNs are a good model of infant\nbehavior and development.  The paper is very well written and easy to\nread.\n\nThe goal was to compare the development of object representations\nacross layers with the development in children and to compare the\norder of learning of different object classes.\n\nThe work did show that unsupervised training results in a different\npattern of layer learning than supervised learning, but neither form\nof learning was able to model the development in children.  Perhaps a\nself-supervised multimodal learning system should be tried?\n\n\nThe decision to train the DeepCluster type net in a supervised way for\na control on training method vs architecture type is nice, but it would also\nhave been good to try other kinds of networks.\n\n\nIt is not clear that age of acquisition of the verbal word should be\nrelated to age of acquisition of the visual concept.  The author's\nstate \"A number of linguistic factors are known to affect when words\nare first used, including the frequency of the word in language and\nits number of phonemes, but the second strongest factor is the\n\"concreteness\" of the word (Braginsky et al., 2015). This suggests\nthat the strength of the visual representation of a class has an\neffect on when its label is acquired.\"   It is not clear to me how the concreteness\nof a word relates to the strength of visual representation.\n\nI don't think there is enough new insight gained from this paper for ICLR publication\nat this stage.\n\nMinor comments:\n\nWhat are dashed lines in Figure 2 top left box?\n\nFunding acknowledgement (especially with grant number) should not be\nin an anonymous submission.\n\nmagenetic\n\n"}