{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper introduced a linear interpolation method that could be applied to the latent space of a generative model.  With their method, interpolating instances generated by those generative models all maintain high quality in terms of the realism index they proposed.\n\nThis paper first introduced the quantity realism index, which is a measure of how well a generated instance in the latent space is fitted to the ground truth manifold of the data space. The definition of realism index is the probability measure of the sublevel set of some f (f:latent -> R+) function threshold by the f(z) for some z. f(z) could be the density function of feature in the latent space. \n\nThere are two types of realism index which has analytic form introduced in this paper. The one based on normal density. Another is based on Frechet inception distance. If the density of latent feature is normal, normal density based index is used and it could be approximated with a analytic form; while if the density is not accessible, then f is the gaussian density of certain transformation of features in the latent space. \n\nIf an arbitrary f is used, a kernel density estimator is used to estimate the density of log(f). After the realism index is introduced, the optimal interpolation  is the one has the highest cumulative realism index along the interpolation curve. \n\nTo optimize, a linear interpolation is used as initialization. All the intermediate results are updated iteratively.\n\nResults show better interpolation than linear ones. But not many baselines are available.\n\nOverall, I think the problem is very interesting and important. The results seem reasonable although only beating an obviously flawed baseline.\n\nTypo in Equation (3): w->s?"}