{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "\nThe paper proposes a scheme to learn representations for sequences\nusing neural networks such that the Hamming distance in the embedded\nspace is close to the edit distance in the original representation of\nthe sequences. This is achieved through a 3-phase algorithm which are\nclearly motivated and technically sound. The empirical results clearly\ndemonstrate the gains from the representation learning on multiple\ndata sets and scenarios. \n\nGiven the clarity, technical soundness and the improved empirical\nperformance, I am leaning towards an accept. However, there are a\ncouple of open questions that, if addressed, would help me better\nunderstand the contributions:\n\n- The main concern is the need for the separated out phases instead\n  of directly minimizing some combinations of these different\n  terms. Is there any inherent reason why the loss function cannot be\n  combined to just train a single neural network in an end-to-end\n  manner instead of this phase-wise manner. The presence of these\n  distinct phases require the reader to figure out when to switch\n  phases, and how dependent the downstream performance is to the\n  phase change decision. \n- As expected, there is a cost to Phase 3. The text is Sec. 5.4 does\n  not appear to match up with the Table 5. The table indicates that\n  removing phase 3 actually improves performance in all but the top-10\n  and top-200 case. The text says something different. Please clarify.\n- Moreover, if there is a cost to Phase 3, can this be properly\n  explained? If there is a cost to it, could there be a way to decide\n  if/when we require the phase 3?\n\n\nMinor:\n\n- It would also be important to understand the effect of the network\n  architecture on the downstream performance. Why is a 2 layer GRU\n  necessary and/or sufficient? Some intuition regarding this would be\n  very useful and can indicate the ease of applicability of the\n  proposed scheme across different data sets.\n"}