{"rating": "3: Weak Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper considers the heterogeneous noise in Bayesian optimisation. The paper utilised the existing heterogeneous Gaussian process to model the surrogate function and proposes two acquisition functions from the Expected improvement to deal with such heterogeneous noise.\n\nThe proposed acquisition function is heuristic and straightforward from the existing ones, ie. augmented EI and EI. I would not count this as much in terms of novelty.\n\nThe idea of dealing with heterogeneous noise in BO is interesting.\n\nThe related background in Gaussian process is standard and could be omitted. \n\nThe experimental section is weak. The experiments are demonstrated using low dimensional functions (1-2 dim).\n\nThe experiment needs to compare with Random baseline. Under the noise setting, the Random approach performs very competitive to BO. \nThe y-axis in the experiment, the paper has considered the objective function value + noise. The reviewer suspects that the high/low performance is due to the high level of noise (?) rather than the better objective function value.\nThe released source code includes the Lidar, Scallop, Silverman datasets, but not the PHOSPHORUS soil. I would encourage the authors to check the source code before releasing.\nThe paper focuses on demonstrating the heteroscedasticity in the surrogate model using [1]. The reviewer is wondering what is the performance for other heteroscedastic GP approaches, such as [2,3,4] ?\n\nMinor points:\nPage 4, step number 2, what is $z_i$ and how can we get it in a new dataset D’.\n\n\n[1] Kersting, Kristian, et al. \"Most likely heteroscedastic Gaussian process regression.\" Proceedings of the 24th international conference on Machine learning. ACM, 2007.\n[2] Le, Quoc V., Alex J. Smola, and Stéphane Canu. \"Heteroscedastic Gaussian process regression.\" Proceedings of the 22nd international conference on Machine learning. ACM, 2005.\n[3] Binois, M., Gramacy, R. B., & Ludkovski, M. (2018). Practical heteroscedastic gaussian process modeling for large simulation experiments. Journal of Computational and Graphical Statistics, 27(4), 808-821.\n[4] Lázaro-Gredilla, M., & Titsias, M. K. (2011, June). Variational Heteroscedastic Gaussian Process Regression. In ICML (pp. 841-848).\n"}