{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper proposes an algorithm to visualize the features learnt by 3D point cloud classifiers. The paper extends the I-GOS algorithms to point clouds. To enable the extension, the authors propose a novel algorithm to smooth point clouds which gradually smoothens the point cloud to a shape with a constant mean curvature. This is a first perturbation based algorithm for visualizing classifiers on point clouds. \n\nThe proposed approach is experimentally validated on the smoothing capability of the novel point smoothing algorithm as well as the visualizations of point cloud networks using the extended I-GOS algorithm.  The results demonstrate that the proposed approach could be a practical and useful visualization tool for researchers working on point clouds as well as a good baseline for others to improve upon.\n\nMy main concern that the proposed approach seems ad hoc and the paper doesn’t establish the (formal) properties of the proposed approach. For example, it is not clear what sequence of smooth shapes will result from the smoothing algorithm and what the properties of that sequence will be. There are some other concerns about the writing clarity, technical material and inadequate discussions for the experimental results (see questions/ concerns below). \n\nOverall, however, the authors do propose a potentially useful point cloud visualization algorithm. If the authors can address the following concerns/ queries in their response and in the paper draft, I may be persuaded to revise my rating upwards.\n\nConcerns/ Queries:\n\n- Refer lines 92-103: “A close relative of visualization is adversarial attack”? The paragraph tries to shoehorn a comparison between visualizations and adversarial attacks which is irrelevant and distracting (tangential) to the objectives of this work. This should be appropriately rephrased. \n\n- What is anti-shrinkage? How is it defined? How are the proposed algorithms formally or empirically anti-shrinkage?\n\n- What are the properties of the proposed smoothing algorithm? One way of thinking about point clouds is that a point cloud represents a shape on a differentiable manifold of shapes and the path between two shapes is represented by a geodesic. Then a smoothing operator may move the point cloud along the geodesic (shortest path) on the manifold of shape. In this vein, what are the properties of the proposed smoothing operator? What optimization problem is it a solution of?\n\n- It seems that iterative smoothing gradually moves an informative shape to a non-informative shape in a sequence of steps. Is the final shape the same for all original shapes – a sphere (lines 270-272)? Does this property formally hold? If so, why the notion of ‘potatoes’ in the title? \n\n- In Figure 2, Taubin smoothing is shown to contain artifacts on a non-uniformly sampled ellipse. However, it is not clear if the sequence of shapes resulting from the application of the proposed smoothing algorithm in the right panel are ‘desirable’. Indeed, what properties should hold?\n\n- It seems that the \\phi operator makes the smoothing operation local, via a local mask M. Why should it be separately computed and not be a part of a single diffusion process which diffuses the local saliencies first and then operates more globally as the effective impact of a diffusion process spreads?\n\n- Section 3.2 is not clear. The formulation in lines 204-209 implies that M is a solution to an optimization problem defined by the loss in (11). To compute that loss, the operator \\phi needs to be defined which is implied to be done by (14). The eventual optimization problem to solve is never discussion, nor the difficulty and the nature of the solution. Finally, not providing a definition of \\phi directly but just implying it causes confusion. I suggest that the authors make this section more clear. \n\n- Figs. 3 &4: It’ll be good to contrast these with results from the proposed algorithm.\n\n- Table 1: The results for the DDS and MR metric should be discussed. What do the experiments show?\n\n- Figure 5: How the color coding is done using the mask computed using the modified I-GOS algorithm in Figure 2 is not discussed and should be clarified. \n\n- In general, the authors should provide more explanations, discussions and takeaways for the conducted experiments. \n"}