{"title": "Little novelty, there are prior works that have the same idea, but this paper fails to discuss any of them", "review": "Summary\nThis paper proposes to learn a neural network that predicts classifier weights of unseen classes from attribute embeddings in zero-shot learning or from averaged feature embeddings of  available samples in few-shot learning. The approch is validated on  established zero-shot and few-shot learning benchmarks and results show some significant improvement over the baselines.  \n\nPros\n-Well written\n-Good empirical results\n\nCons\n-Little novelty. This paper fails to discuss the following highly similar related works. [1] learns a nueral network (MLP) to predict classifier weights and convolutional filters from text features in the context of zero-shot learning. [2] predicts the classifier weights of unseen classes by doing graph convolution on top of the semantic knowledge graph and word embedding. [3] tackles few-shot learning by learning a MLP to predict classifier weights of novel classes from image features. In my point of view, the key idea of this paper is highly close to [1] and [3]. Unfortunately, this paper seems to be not aware of those important prior works. \n\n[1] Predicting Deep Zero-Shot Convolutional Neural Networks using Textual Descriptions.  Ba et al.  ICCV'15\n[2] Zero-shot Recognition via Semantic Embeddings and Knowledge Graphs. Wang et al. CVPR'18\n[3] Few-Shot Image Recognition by Predicting Parameters from Activations. Qiao et al. CVPR'18\n\n-Stronger zero-shot learning baselines are missing. The numbers in GBU have been improved significantly by some CVPR'18 papers, i.e. [4]. I suspect Table 2 is not current the state-of-the-art.\n[4] Generalized Zero-Shot Learning via Synthesized Examples. Verma et al. CVPR'18\n\nBased on the above analysis, I would rate this paper as \"Clear rejection\". In the rebuttal,  I suggest the authors to discuss the main differences between their approach and [1], [3].", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}