{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors analyze NN architectures from the perspective of network sciences and propose markers that correlate architectures and generalization performance. In addition to providing theoretical insight, these markers (e.g. NN-Mass) can then be used to help direct neural architecture search.\n\nGraph theoretical analysis of neural network architectures is conceptually appealing and will hopefully prove useful for improving topics such as NAS. Unfortunately, the authors' presentation does not instill the reader with confidence regarding their arguments. \n\nIdeally, the authors would start by analyzing simple multilayer perceptrons with random skip connections as a base case and derive theoretically sound principles from there. Instead, we jump directly into DenseNets. Similarly, the NN-density and NN-mass metrics (both of which are central to the piece) are introduced with little in the way of content or explanation. \n\nGiven the repeated reference to small-world networks, these choices of metrics seem unusual. Alternative characteristics, such as clustering coefficients and statistics regarding the distribution of geodesic path lengths, would seemingly be more natural. Together, these peculiarities make the work feel rushed and, at times, superficial. As a non-expert in topics such as network science, I fully admit that I could be mistaken here.\n\n\nQuestions:\n  - What is the purpose of \"contribution probabilities\" $\\alpha_{i,j}$ and in what sense are they \"probabilities\"?\n  - In Sect 4.2, how were clusters assigned?\n\n\nNitpicks, Grammar, and Spelling:\n  - I suggest using italics much more sparingly.\n  - The authors spend an inordinate amount of time pointing out things that they are the first to do and/or that related works did not do. This repeated exercise does not reflect well on them.\n  - Please explain how clustering was performed (shown in purple boxes and ellipses)\n"}