{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This work design a framework to predict valence and arousal values in the emotional impact. Although its performance is much better than previous works, I have some questions about the current submission:\n-- The writing is not clear enough. I have to guess the technical details based on the context. For example, in Equation 1, how to estimate y_{i}? And why put 1/m behind \\sum? Is there any particular reason for this? It is a classification problem here, why use MSE loss rather than cross-entropy loss?\n\n-- \"If modality i plays an important role, it would push the mapping to complete the f_{i-1} towards f_i to get better performance.\" Are you suggesting that sometimes H() will be about zero?\n\n-- Figure 2 is not clear enough for me. I still can not fully understand what ``progressive\" means here. I will appreciate it if the authors can make this more clear. \n\n-- What concerns me the most is the novelty of this work. It seems solid and effective. However, based on the current content, I can not fully appreciate its novelty. Using deep learning models to extract features from different modalities has been used before. Using deep learning to consider inter-clip and intra-clip relations also has been conducted. Using LSTM for fusion is not new, either. The authors claimed they propose a progressive training strategy for effectively training and information fusion. However, given the current version, I can not fully appreciate it.  \n\nI can change my point if the authors would provide more details and explanations later, which can help me to understand the novelty of this work fully. Thanks."}