{"title": "Nice geometrical observations, but not novel and have insufficient empirical evaluation of the quality", "review": "Attention!!! This submission contains Github and Google Drive links to author-related accounts (see e.g. the abstract). I do not think this is permitted or standard. I leave the decision regarding \"automatic rejection\" of the submission to meta-reviewers of the paper.\n------------------------------------------------\nThe paper presents a method for tweaking existing vector embeddings of categorical objects (such as words), to convert them to ball embeddings that follow hierarchies. Each category is represented as a Eucldiean norm ball in high dimensional space, with center and radii adaptable to data. Next, inclusion and exclusion constraints on each pair of  balls are imposed based on the hierarchical structure. These constraints are imposed via an algorithmic approach.  The empirical study includes investigating the consistency of the representation with the hierarchy and demonstrating nearest neighbors for a set of words.\n\nOn the positive side, the paper addresses an important problem. It is readable and well organized. The related work could be improved by adding a number of representative related works such as [3,4].  \n\nThe major concern about the paper is the originality of the method. Encoding hierarchies with high dimensional balls and encoding inclusion and exclusion as constraints on those balls is a neat and powerful idea from modeling perspective. However, it is not novel, since the approach is already established for example in [1, 2 Chapter 5]. \nThe next major concern is regarding the evaluation of the quality of embeddings.\nThe empirical evaluation does not sufficiently evaluate the quality of tweaked embeddings. In contrast, the quantitative evaluation is more concerned with if the embeddings being consistent with the given hierarchy. In particular, not enough quantitative evidence that the proposed embeddings are actually effective in capturing semantics or in prediction tasks is provided. It should be noted that, the first aspect, ie consistency of the feasible solutions with hierarchy, can be theoretically established (see e.g. [1]).  The first paragraph of 3.2 seems unclear or wrong. See for example [2] for a gradient based solution for the problem.\nFinally, using an algorithmic approach as opposed to learning method for constructing embeddings, makes the method not directly related to the topic of ICLR conference.\n\nOverall, due to the above reasons, I vote the paper to be rejected. (The poor anonymization makes it a strong case for a reject.)\n\n[1] Mirzazadeh, F., Ravanbakhsh S., Ding N., Schuurmans D.,  \"Embedding inference for structured multilabel prediction\", NIPS 2015.\n[2] Mirzazadeh, F.\"Solving Association Problems with Convex Co-embedding\", PhD thesis, 2017. (Chapter 5)\n[3] Vilnis, Luke, and Andrew McCallum. \"Word representations via gaussian embedding.\", ICLR 2015.\n[4] Vendrov, I., Kiros, R., Fidler, S., Urtasun, R. \"Order-embeddings of images and language.\" ICLR 2016.", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}