{"title": "Well-motivated problem, but the presentation is unclear.", "review": "This paper describes a signal separation method called neural egg separation (NES).\nThe separation problem is tackled in a semi-supervised setting where the observed mixture contains a target signal and a background noise, with access to the distributions of target and mixture signals.\n\nThe strength of the paper is that it describes the importance of the problem setup for practical use with some motivating examples. \nHowever, some unclear notations weaken the claim of the paper.\n\nSpecific comments follow.\n* The loss in (1) is unclear.\nAssuming latex grammar, \\| \\| is usually used to denote a vector norm, but (1) has two values inside. \nI would write \\ell(T(y_i), b_i) to show a loss function, instead of the \\| \\| style.\nMore importantly, the loss should be explicitly defined. Does this mean the l2 error?\n\n* The iterative separation process of (2) is even unclear.\nDoes T^m(b_j + x_i^m) share the parameter of that from previous iterations like T^{m-1}?\nOr are the parameters fixed throughout the iterations?\n\n* Use of \\cdot.\nThere may be a confusion between the inner product and element-wise product with the \\cdot operator.\nRight after (5), there is an inequality z \\cdot z \\leq 1, which is meant to be the inner product.\nOn the other hand, the use of \\cdot in (8) looks like the element-wise product to describe a masking operation.\n\nClarifying the objective and overall procedures is necessary for presenting the proposed method.\n\n=================================\nEDIT: I confirmed the revisions regarding the notation issues, but there still have confusing parts.\n* Definitions of norm operator \\| \\| is unclear.\n  * L_1 is mentioned below (1), and used other parts (3) or Algorithm 1. Equation (12) in Appendix uses |W1|_1^2, which looks like the l1 norm as well. Use consistent notations.\n  * Equations (12, 13, 14) uses \\|\\|_2 or \\|\\|_1 to specify the type of norm, whereas (5), (6), (7) and other parts after (15) use \\|\\|. This confuses me. What do you mean by \\|\\| without subscript?\n  * \\|\\| operator taking to symbols is a weird notation for me. Usually, norm is defined for a single vector (or a matrix). For example in (5), I would write \\| b - G(z_b) \\|, if you want to measure the difference between b and G(z_b).\n\nThe experimental result is impressive, as the other reviewers mention. I strongly recommend clarifying the notation to better deliver the method.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}