{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "Title: Good work, requires some edits.\n\n1. Summarize:\n\nThis paper proposes a new problem setting in visual relation detection which is called “Predicate Zero-shot Learning (PZSL)”. They provide a clear motivation and description of this setting. They propose a solution to this problem which leverages linguistic priors and knowledge bases. Furthermore they propose an unbalanced sampled-softmax to tackle the long tail distribution of predicates.\n\n2. Clearly state your decision. One or two key reasons for this choice.\n\nI will go for a weak accept for the paper at this stage. (+) I think the proposed problem setting is well-motivated and useful. Also, (+) the proposed initial solution to this problem is interesting. However, (-) they propose a “fast graph convolution network” which seems to be precisely equivalent to a PinSage.  Also, (-) the paper requires to be polished as it lacks clarity.\n\n3. Main discussion\n\nMy first argument is: I’m not sure why the authors have changed the name of PinSage and just mentioned that “their” “Fast Graph Convolution Network” is “inspired” from PinSage. To me it looks exactly the same. If there are any differences, it should be stated clearly. In fact, I would not be against using PinSage as a part of their approach. However, trying to rename it without clear reasons is not a good idea.\n\nMy second argument is that the paper lacks clarity in writing (for detailed suggestions please refer to comments and feedbacks). Specially the evaluation section lacks details and clarity: a) In the beginning of this section (page 7), the authors talk about “generalized” and “traditional” settings without properly defining them. b) The descriptions for Table 1 and Table 2 fail to provide enough details to help understand the difference between the results in these two tables (one of them states “Accuracy of unseen predicate recognition” and the other one “Accuracy of recognition of triplets with unseen predicates”). \n\n4. Comments and feedback.\n\nIntroduction: \n\nParagraph one in the: \n1. The relationship recognition methods are mainly supervised “that” → “to”.\n2. last line: …. and do not study “on generalizing” → “the generalization of”.\n\nParagraph two:\n1. no manual annotations or “real samples” → “image samples”. (a real sample is ill-defined)\n2. For example, no instance of chew → For example “given” no instance of chew.\n\nParagraph three:\n1. … is difficult since predicates are often abstract not as specific →   is difficult since predicates are often abstract “and” not as specific.\n2. Furthermore, unlike many object ZSL methods … → This line to the end is very complicated and hard to understand.\n\nRelated Works:\n\n1. Visual Relationships: I would cite “Graph R-CNN for scene graph generation” since it is the most relevant work regarding the similarity of pipeline (using GCNs).\n2. External Knowledge bases  (KB): I would cite “Improving Visual Relationship Detection using\nSemantic Modeling of Scene Descriptions” since it is one of the most relevant works using knowledge graph modelings to improve visual relation detection.\n\nProblem Setup:\n\nDo you plan to provide the proposed dataset splits so others can work on this setting? I consider this very important given your paper’s contribution. Maybe it is better if it is also mentioned in the paper.\n\nPipeline:\n\n1. Paragraph 2: … the output of which is fused with …: Given Figure 2, it does not seem like $V_p$ is being created by fusing $V_s$ and $V_o$. It looks more like it is extracted directly from the image (union of bounding boxes).\n\n2. In Figure 2: In the representation of Pipeline (A), the graph is colored by dark blue for objects and light blue for predicates. The represented graphs show Object to Object and Predicate to Predicate connections which I’m not sure if it is correct. Shouldn’t we always have a light blue between every pair of dark blue connections?\n\nEvaluation:\n\n1. Please consider the mentioned points in the Main Discussions.\n2. In Table 1, I suggest re-naming “embedding” to “initial embedding”.\n3. In Table 1, Hit@k should be Hits@k.\n4. Please define the metrics clearly (Hits@k).\n\nExtra: I have a question regarding the ablation studies with GloVe, Normal and InferSent initialization. The question is whether this initialization is necessary? It seems like in the setting “W/O KG”, even though the embeddings are initialized with GloVe, there is no gain (all of the Hits@k values are 0.0). So GloVe embedding without KG bring no external semantic knowledge? Then why use them? Regarding that, I can see that a GCN, initialized with normally distributed embeddings (row 14 in Table 1) has given 0.0 accuracies, but I find this very counter intuitive, as graph convolution layers already have trainable weights capable of compensating for the lack of ‘proper’ initialized embedding and getting 0.0 does not make sense to me.\n\nConclusions and Future Work:\n\n1. two lines before the last: please use “\\citep”.\n\n"}