{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "N/A", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "Summary: The paper provides certain basic guarantees on when manifolds can be written (exactly or approximately) as the image of a map approximated by a neural net. This is couched as answering the question of when GANs can approximate certain distributions, though in fairness, distributions aren't really ever considered -- only the images of the maps approximated by the neural net of the GAN.  \n\nTechnical contributions: The paper mostly stitches together known theorems from (differential) geometry of manifolds, as well as standard universal approximation results. For instance, the result about differentiable connected manifolds proceeds by essentially using known results about the exponential map of such manifolds (Lemmas 5.1 and 5.2), and subsequently approximating this map in a black box way via known universal approximation results. \n\nVerdict: The paper unfortunately doesn't pass my ICLR bar -- the techniques are essentially known, so there is very little new mathematically; additionally, the question is in some sense the \"wrong\" one: one needs to approximate *distributions* with support over a low-dimensional manifold, rather than only worry about the range of the map from the latent space to the domain of the GAN. Additionally, much in the way Neural Net approximator has been studied, and one tries to determine which factors require larger nets (e.g. Fourier domain sparsity in Barron's theorem, etc.) the interesting thing here would be to determine what geometric properties of the manifold determine the size of the GAN needed  (e.g. curvature, complexity of the exponential map) and potentially how these properties interact with the distribution over the manifold considered. \n\n\n\n\n"}