{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper has proposed a bottom-up approach for multi-person pose estimation. This method integrates the part detection and association stages together to form a differentiable model. The memory footprint while training the model is kept low by constraining the back-propagation steps within a small number of time steps. \n\nWhile the proposed method Doesn’t seem to show a big improvement on the COCO dataset, the authors gave a convincing reason that there are fewer occlusions in the COCO dataset, and in the harder task of OCHuman where only the harder poses are present, the proposed approach has shown its advantage over other models.\n\nAs for the multi-scale setting, could the author provide some more recent baselines? Newell et al. was proposed in 2016-2017, which is almost 3 years old. And the proposed method doesn’t seem to have anything preventing it from being applied on newer bottom-up models. \n\nThe authors pointed out in the motivation that the thresholding process causes problems in deciding if a new person is detected. However in the Stop criteria proposed by the authors (Page 4), they are still using a threshold. \n\nThe writing of the paper needs to be significantly improved. The paper seems to be submitted in rush. There are a lot of places with typos or vague descriptions that significantly impedes understanding of the paper, for example:\n\n1. Page 2, “bottom-down approach” -> bottom-up approach\n2. Page 3, “Bests fits” -> best fits\n3. Figure 1, “first raw” -> first row\n4. Page 3, “Convolutional (Long) Short-Term Memory”\n5. Figure 5, some scripts need to be removed here.\n6. The heat maps in all the figures are too small to decipher. I can’t see the poses clearly. \n7. Section 3.1.2, The authors are introducing related works while describing their model.\n8. While motivating the learning-based model (Section 2.2) It seems to be hard to follow the long paragraph, and many terminologies are not consistent.  \n9. In the training procedures section, there are still descriptions of the model structure. "}