{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review": "This paper considers how we can train image classification models so that they can ignore task irrelevant features.\nFor this purpose, the authors considered a situation where task relevant parts of the images are annotated as masks by the human experts.\nThe authors then proposed using Actdiff loss, Reconstruction loss, and Gradmask loss that are designed to suppress the effect of irrelevant features. \n\nI think the problem considered in this paper is interesting and important.\nAs the authors pointed out, the medical images taken from different hospitals may contain hospital-specific features which is irrelevant to the targeting task.\nThus, we need a way to train image classifiers that can ignore such irrelevant features.\n\nMy major concern on this study is the experiments.\nThe authors mention that part of their methods sometimes did not work (see below).\nThis makes the effectiveness of the proposed losses a bit questionable.\nIf I understad correctly, in practice, the users need to tune the weights of several losses carefully until they can obtain a good model.\nIf this is the case, I am not very sure if the proposed losses are essential, or tuning a right weight can occasionally provide good models.\n\n* (Sec4) \"Gradmask proves to be too powerful a regularizer for this task, and never produces a model with good generalization performance.\"\n\n* (Sec5) \"For the Cardiac dataset, the best performing method was classification with gradmask for the Convolutional AutoEncoder and with actdiff for the UNet, and each achieve similar performance.\"\n\n* (Sec5) \"The gradmask and combination actdiff and gradmask models improved over baseline, but there is no clear reason why this would be true from the saliency maps.\"\n\n* (Sec6) \"Both actdiff and gradmask improve performance of the model, but only actdiff scores above chance, and performs similarly to a model trained with the areas outside of the mask completely removed.\""}