{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper attempts to tackle the overfitting problem due to the focusing on the distracting information. By utilizing the dataset with masks, the authors propose a simple method to ignore the distracting features. By designing actdiff loss and reconstruction loss, the authors demonstrate that classifiers are likely to predict using features unrelated to the task and their losses can mitigate this problem.\n\nPros:\nThis kind of study can make us understand deeply what is going on in deep learning and thus to make it better, which shows this work’s high significance.\n\nCons:\n1.\tThe presentation of this paper is not clear. For example, in Table 1, the experiment name is so confusing. The authors mention that “Conv AE Actdiff” is the one using both actdiff loss and reconstruction loss. Then what does “Conv AE Reconstruct Masked” mean? Does Conv AE means they implicitly contain reconstruction loss? The authors should elaborate them clearly. The corresponding double quotation marks should be revised. Figure 3 is also confusing. At first, I thought different lines represent different input data (one without mask and one with mask) and different columns represent different methods. However, this is not the case. Furthermore, the fourth column is more confusing. I do not see any red circles in the fourth column. Why the reconstruction of distractor is far away from the original one. Does the right top picture show the advantages of UNet Reconstruction or its drawbacks?\n2.\tIn fact, the training data with masking is not sufficient (may only available in some medical images). It is hard to utilize these data to generalize to various other tasks including large amounts of images without masking.\n3.\tFrom the experiments on real tasks, I barely see improvements by the proposed method, which makes the conclusion unconvincing.\n\n"}