{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "I have two general concerns, the first is related to the presentation and the second to the relevance of the results.\n\n(1) Presentation is confusing at many points, for instance:\n\n* It is unclear if theorem in Eq. 4 is original or belongs to Shuman et al 2013. (no proof is given)\n\n* Eq. 8 seems an arbitrary decomposition of the original NonLocal operator that could have been proposed without any reference to the Chebyshev expansion (which, on the other hand, is truncated to 1st order with no extra explanation).\n\n* The point of Fig. 1 and Fig 4 is not clear. Fig. 1 explains how SpectralNonLocal reduces to NonLocal and NonLocalStage, but we can see this from the formulas. I dont see how this discussion on the Ws relates to the regions highlighted in the bird.\nThe same applies to Fig. 4. What are we supposed to see in Fig. 4 (and, more importantly, why?).\n\n* What is the CFL condition? (is it the Courant-Friedrichs–Lewy sampling condition?). How is that related to the values of Ws. Can we take those arbitrarily small as suggested in that proof?\n\n* The upper limit in the sums after Eq. 10 is unclear.\n\n* First time table 4.2 is cited there is no context to understand it. (actually there is no table labeled as \"Table 4.2\") Where do we see the different number of NonLocal units?. This is only clear when you arrive and read text of page 9 (but not when cited the first time from page 6).\n\n* Explanation of experiments is a little bit confusing (e.g. what does it mean top1 and top5 in tables?). The only explanation of \"top-something\" I found in the text has to do with eigenvectors in fig. 5. This also apply to the \"topX\" in the figures?\n\n(2) Nevertheless, the main concern is the scarce relevance of the results: differences of behavior in all tables are about 1%. Then, what is the real advantage of the proposed modification? \n"}