{"title": "A very well written paper with substantial and well organized experimental content, but overall a bit too narrow in scope and technical contribution", "review": "The authors present a technique to exploit low resolution labels from a space Z to provide weak supervision to a semantic segmentation network which predicts high resolution labels from a different space Y, assuming that a joint distribution of Z, Y is known a-priori.\n\nThe paper is very well written and easy to follow, the main contribution is clearly and rigorously explained in the technical section.\nThe technical contribution is somehow limited, but it is substantially validated by a very well organized and convincing experimental evaluation.\nOverall, I have three main points of criticism (detailed in the following), which however aren't enough to not recommend this paper for acceptance.\n\nMain cons:\n\n1) At points, the paper reads more like a technical report about solving specific problems in land cover estimation and lymphocyte segmentation than a machine learning paper.\nMany paragraphs are devoted to describe the specifics of these two problems and to design methods to overcome them.\nThe main technical contribution of the paper seems to be specifically tailored to solve the particular setup encountered in land cover estimation, i.e. two different sets of labels with different resolution on the same segmentation data, which ties to the next point.\n\n2) One important limitation lies in the fact that the distribution p(c|z) needs to be known a-priori and somehow derived from additional problem-specific knowledge.\nThis is not an issue in the two tasks considered in the paper, but in my opinion it could severely limit the applicability of the proposed approach.\nI think the paper would benefit from the inclusion of some discussion about how this limitation could be overcome.\n\n3) It's not very clear to me why the gaussian approximation with the specific mean and variance values defined in eq.4 would be a good approximation for p_net(c_lk|X).\nCould the authors expand on this?", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}