{"title": "Very little awareness on latest research on unsupervised word segmentation", "review": "This paper proposes a neural architecture for segmental language modeling\nthat enables unsupervised word discoveries. The architecture employes a \ntwo-stage architecture that a word might be a type, or a sequence of characters\nof its spellings. \nThis idea is basically similar to Nested Pitman-Yor language models \n(Mochihashi et al. 2009) and two-stage language models (Goldwater et al. 2011),\nbut the authors seem not to notice these previous work.\nExperimental results show some improvements on naive baselines, but clearly \nbelow the state-of-the-art in unsupervised word segmentation.\n\nAs noted above, the crucial drawback of this paper is that the authors are\ncompletely unaware of latest achievements on unsupervised word segmentation\nand discovery, rather than old, simplistic baselines such as Goldwater+ (2009,\nidea is based on Goldwater+ ACL 2006) or Berg-Kirkpatrick (2010).\nThe idea of using characters and words is already exploited in Mochihashi+\n(ACL 2009) in a nonparametric Bayesian framework; it has a better F1 than this\nwork by a large margin. Moreover, it is recently extended (Uchiumi+ TACL \n2015) to also include latent word categories as well as segmentations to yield \nthe state-of-the-art accuracies on F1=81.6 on PKU corpus, as compared to 73.1 \nin this paper. \nNote that they employ a prior distribution on segment lengths as a (mixture of) \nPoisson distributions or negative binomials whose parameters are \nautomatically learned during inference, as compared to a post-hoc regularization\nused in this paper.\n\nIn a Bayesian framework, interpolations between words and characters are\ntheoretically derived and quite carefully learned, and regularizations are\nautomatically adjusted. While neural architectures have some potentials \nto improve over them, current heuristic architectures that have lower \nperformance does not have any advantage over these methods, \nboth theoretically and empicially.\n", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}