{"title": "Interesting observation, needs further clarification", "review": "Summary: The paper provides a unified view of the weight assignment strategies for pairwise similarities in DML. The authors analyze the weights assignment methods for multiple commonly used methods and provide a weighting scheme called RAW which combines the lifted structure with the binomial deviance approach. They also propose a hard mining triplet selection strategy for sampling informative triplets. The experiments indicate the advantage of combining these approaches.\n\nComments:\n- The Theorem 3.1 should merely be stated as an observation. It is a trivial observation that the partial derivative of the parameters at every step will depend positively on s_ik and negatively on s_ij. Although the transition from line 2 to 3 in Equation (3) is very unclear and needs further expansion (how do you introduce indicator variables?). Moreover, there is no need to define the concept of gradient equivalence. The whole observation can be asserted as the fact that the partial derivative of the loss at every iteration can be seen as a weight. Additionally, to make the derivations mathematically sound, you should state that the weights in (2) are updated using the new similarity values at every iteration and are kept fixed during the next iteration.\n\n- The proposed weighting strategy is a combination of two previous approaches. Although there is not much novelty in combining the two, the experiments indicate that the performance of DML can improve using the new approach. The triplet mining on the other hand is a bit dubious. Sampling only hard triplets, in my experience with triplets, may cause the loss to be saturated by unsatisfied hard triplets. Also, the embedding might not learn anything about the global structure of the dataset (i.e. how are the clusters relatively located w.r.t each other, which points are outliers, etc.). It would be nice to have a visualization of the learned embeddings to get an idea about the separability of the clusters.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}