{"title": "review of the paper", "review": "This paper talks about music translation using a WaveNet-based autoencoder architecture.  The models are trained on diverse training sets and evaluated under multiple settings.  What reported in this paper seems to be interesting and the performance sounds good. However, I have following comments/concerns. \n\n1. The paper is not clearly written. Its exposition needs significant improvement.  There are numerous inconsistent definitions and vague descriptions that make the reading sort of difficult. \n    a)  It would be very helpful if the authors can put up a figure for the description of  the WaveNet  autoencoder instead of just using words in Section 3.1\n    b) The paper itself should be self-contained instead of referring readers to other references for the details of model architectures.\n    c) The math symbols are poorly defined.  What is the definition of C in Section 3.3?   It is defined or referred to as \"domain classification network\" and also \"domain confusion network\" but nowhere to find in Fig. 1.\n   d) \"C is minimizes\" -> \"minimizes\"\n   e)  In Section 4,  it says that \"Each batch is first used to train the adversarial discriminator\".  Which adversarial discriminator? Where to find in Fig. 1 as it is the only description of the network architecture?  \n\n2.  The authors mentioned a couple of observations that left unanswered.  \n    a)   I am surprised to see that without data augmentation, the training does not even converge. \n    b)  The conversion from unseen domains is more successful than the learned domains.\n    c)  The decoder starts to be creative when the size of the latent space is reduced. \n   I sense that these observations seem to point to some (serious) generalization issues of the proposed model.  I would like to hear explanations from the authors. \n\n\nAfter reading the rebuttal:\nThe authors have addressed my major concerns with regard to this paper.   I have lifted my score.  Thanks for the nice response.", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}