{"title": "A conditional deep generative model that lacks in comparison with the state of the art and some experimental results are not convincing", "review": "In this paper,  a conditional deep generative model is proposed for disentangling structure (more precisely shape)  and appearance.  The architecture of the proposed system is very similar to that in [A], however, in this paper different applications are considered. The paper is relatively well-written and a number of experiments are presented. However, they are that convincing.\n\nI have two main concerns regarding this paper.\n\n1)\tThe authors have not taken into account recently proposed deep generative models for disentangling shape and appearance along other modes of visual variations. A non-exhaustive list is as follows:\n\n*GAGAN: Geometry-Aware Generative Adversarial Networks\n*Geometry-Contrastive GAN for Facial Expression Transfer\n*Cross-View Image Synthesis using Conditional GANs\n*Deforming Autoencoders: Unsupervised Disentangling of Shape and Appearance\n*Neural Face Editing with Intrinsic Image Disentangling\n\n\nThe authors should discuss how the proposed method is different from the above-mentioned ones and compare the performance of the proposed model against that obtained by GAGAN and Deforming Autoencoders, which are very relevant to the proposed one models.\n\n2)\tSome of the experimental results are not convincing. For example, in Fig. 6 it seems to me that all the chairs produced by the proposed method are identical. In the same figure, Jakab’s method seems to produce more meaningful results than the proposed method which appears to implement texture style transfer, rather than shape transfer.\n\nConsidering all the above, I believe the paper needs substantial improvement prior to being considered for publication.\n\n\nReference\n\n[Α] Tomas Jakab, Ankush Gupta, Hakan Bilen, and Andrea Vedaldi. Conditional image generation for\nlearning the structure of visual objects. NIPS, 2018. \n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}