{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "This paper presents an approach to playing imperfect information games, an “Incomplete State Solver Network” (ISSN) within the domain of contact bridge. The paper’s primary technical contributions are the network, and a large dataset of contact bridge games, which the authors make publicly available. \n\nI believe that the work that the authors did in regards to this paper is valuable. However, I had a very hard time following along with the paper. The major issue is the language, which I mean both in terms of particular phrases or terms going unexplained, and the grammar and phrasing of the sentences. \n\nThe most clear early example of terms and phrases going unexplained is the second section describing contract bridge. Many terms are used without any explanation. For example, what a target contract is or what a trump means in the case of contract bridge. This made the remainder of the paper, including the results difficult to understand. \n\nAs an indication of the grammar and phrasing issues in the paper I have below included issues from just the first page of the paper: \n- “In real world”-> “In the real world”\n- “have to made decision” -> “have to make decisions”\n- “researchers steers towards” -> “researchers have focused on”\n- “Chess, best action” -> “Chess, the best action”\n- “it is independent of opponent and action history” -> “it is independent of the opponent or action history”\n- “history actions” -> “action histories”\n- “In early ages there are heuristic based system to assign different prior” -> “Early approaches employ heuristic based systems to assign different priors”\n- “try to convert the problem to a perfect” -> “try to convert the problem into a perfect”\n- “explicitly with neural networks, and try to optimize it” -> “explicitly with neural networks, trying”\n- (not a phrasing issue but I would have appreciated a citation for the claim at the end of the third paragraph of the intro)\n- “Simulation based approach usually requires large” -> “Simulation based approaches usually require a large”\n- “sequences of existing player and opponent” -> “sequences of the existing player and opponent”\n- “a few underlying complete information state” -> “a few underlying complete information states” \n\nThis issue of readability came up in the figures as well. The figures in the paper are dense and very difficult to parse. There is little explanation in the text, and I found them difficult to glean anything from without an understanding of contact bridge.\n\nFrom what I can gather from the paper this is good and valuable work. However, I think the paper is not yet ready for publication as a communication of this work. \n"}