{"title": "Interesting paper, promising results", "review": "* Summary\n\n  This paper extends the skipgram model using one vector per sense of a word. Based on this, the paper proposes two models for training sense embeddings: One where the word senses are marginalized out with attention over the senses, and the second where only the sense with highest value of attention contributes to the loss. For the latter case, the paper uses a variant of Gumbel softmax for training. The paper shows evaluations on benchmark datasets that shows that the Gumbel softmax based method is competitive or better than other methods. Via a crowdsourced evaluation, the paper shows that the method also produces human interpretable clusters.\n\n* Review\n  This paper is generally well written and presents a plausible solution for the problem of discovering senses in an unsupervised fashion.\n  \n  If \\beta=0, then we get SASI, right? How well does this perform on the non-contextual word similarity task? Also, on the crowd sourced evaluation? The motivation for the hard attention/Gumbel softmax is to learn sense representations that are distinguishable. But do the experiments test this? \n\n  There's something strange about Eq 6. If I understand this correctly, \\tilde{c_i} is the context and c_j^i is the j^th context word. Then P(c_j^i | w, \\tilde{c_i}) should be 1 because the context is given, right? While the motivation for the right hand side makes sense, the notation could use work.\n  \n  The description of how the number of senses is pruned in section 3.1 seems to be a bit of a non sequitur. It is not clear whether this is used in the experiments and if so, how it compares. The appendix gives more details, but it seems a bit out of place even then because the evaluations don't seem to use it.\n\n\n* Minor comments\n  There are some places where the writing could be cleaned up.\n  - Eq 16 changes the notation for the sense embeddings and the context words from earlier, say Eq 12.\n  - Parenthetical citations would be more appropriate in some places Eg: above Eq 3, in footnote 3\n  - Page 6, above 6.2: Figure-Figure?\n  - Page 9, Agreement paragraph: hight -> highest\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}