{"title": "ok paper; an important question on upscaling image crops", "review": "Thanks the authors for an interesting work!\nThe paper studies the differences between human and DNN vision via means of minimal images (i.e. smallest image crops that can be correctly classified).\n\nThere are a few notable take-away messages:\n1. DNNs are not invariant to even tiny (1-2 px) translations of small image crops.\n    - It would be more insightful if authors added comparison between DNN sensitivity to tiny translations of small image crops vs. full-size images (i.e. translation-based adversarial examples https://openreview.net/forum?id=BJfvknCqFQ ).\n2. The smaller the image crops, the more sensitive DNNs become (here, more FRIs)\n3. DNNs and human vision misclassify the image crops differently: (1) DNNs have almost twice more FRI(s) and (2) FRIs of human and DNNs differ in location.\n\nQuestions:\n\n- \"After extracting the region from the image, the region is resized to be of the size required by the network.\"\nWould upscaling say a small 28x28 crop into 224x224 image here naturally negatively impact the DNN predictive performance?\nThat is, because typically image classifiers are trained on one (or a few) fixed resolution(s) of images.\n\nOne hypothesis here is that fragile recognition may be because the test image resolution does not match the training image resolution.\nHuman on the other hands, have been trained on images of variable resolutions.\n\nAn alternative to upscaling here is to zero-pad the crop region. Can you help us understand your choice of upscaling here?\n\n+ Originality\nThe originality is limited as it is a close extenstion work of Ullman et al. 2016\n\n+ Clarity\nThe paper is well written and presented.\n\n+ Significance\nThis work extends our understanding of the differences between DNNs and human vision.\nHowever, given what we learned from the adversarial example research area, the contribution of this work is low because results might not be too surprising.", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}