{"experience_assessment": "I have published one or two papers in this area.", "rating": "8: Accept", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "title": "Official Blind Review #3", "review": "The paper explores and experiments on extrapolating attributes of images produced by GANs by manipulating their representations in latent space. Attribute manipulation is done by predicting latent space walks (linear or non-linear) and is learned in a self-supervised way by using augmented outputs of a pretrained GAN as target images.\nAuthors experimentally show dependence of range of possible attribute manipulations on the diversity of the dataset in terms of that attribute as well as propose techniques to improve it.\n\nSuggested concepts are explained in a clear way with extensive experiments confirming the findings. Techniques proposed for improving \"steerability\" of GANs are backed up by both qualitative and quantitative analysis, although missing experiments on more sophisticated datasets than MNIST.\nOverall,  I recommend to accept this paper.\n\nSeveral questions I would like the authors to address to make some details more clear and the paper more complete:\n1. Why the color distribution of generated images is evaluated on a sampled subset of pixels, not full images? (\"Quantifying steerability\" section.)\n2. On Figure 6, which classes are outlying on transformation limitation / data variability plots (bottom-right corner) and how it may be explained?\n3. While StyleGAN can not preserve geometry of objects for shift in location-based attributes, when walks are learned in the W space, have you experimented on manipulating those attributes with z space? What are the results?\n\nOther minor flaws include\n1. Pictures in Fig. 2 are mixed up between G(z) and G(z + \\alpha w)\n2. In Fig. 2 edit(G(z, \\alpha)) -> edit(G(z), \\alpha))\n3. In eq. (2) f^n(z) -> G(f^n(z))\n4. In eq. (6) +\\alpha^* -> -\\alpha^* ", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory."}