{"rating": "6: Weak Accept", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper shows that deep-nets can actually learn to solve the problem of \"what is inside a curve\" by using a sort of progressive filling of the space outside the curve. The paper suceeds in explaining that and in pointing out the limitations if standard learning to address this problem.\n\nHowever, \n(1) the proposed demonstration is based in ideal (continuous, noiseless) curves. What would happen in actual (discontinuous, noisy) curves?. What implications does this has in the requirements of the network.\n(2) I think more connections to classical and current algorithms are required. For instance:\n(2.1) The proposed demonstration (and the arguments of Ullman) reminds me of classical watersheed algorithms [see 2.1]. What is the gain of using deep networks with regard to rather old techniques?. Advantages are not clear in the text.\n(2.2) What about connections to recent algorithms of automatic fill-in of images of contours based on conditional GANs [see 2.2]. It seems that these recent techniques already solved the \"insideness\" problem and even learnt how to fill the inside in sensible ways...\nThen, what is the gain of the proposed approach?. \n\nREFERENCES:\n\n[2.1] Fundamenta Informaticae 41 (2001) 187–228\nThe Watershed Transform:  Definitions, Algorithms and Parallelization Strategies\nJos B.T.M. Roerdink and Arnold Meijster\nhttp://www.cs.rug.nl/~roe/publications/parwshed.pdf\n\n[2.2] Unpaired Image-to-Image Translation using Cycle-Consistent Adversarial Networks\nJun-Yan Zhu, Taesung Park, Phillip Isola, Alexei A. Efros\nICCV 2017 https://arxiv.org/abs/1703.10593"}