{"title": "Multi agent RL with self interesting agents: New formulation and solution in simple environments.", "review": "Summary:\n\nThis paper proposes a way to train a manager agent which would manage a bunch of worker agents to achieve a high-level goal. Each worker has its own set of skills and preferences and the manager tries to assign sub-tasks to these agents along with bonuses such that the agents can even perform tasks that are not preferred by them. Authors achieve this by training a manager which tracks the skills and preferences of the agents on the fly. Authors have done an extensive analysis of the proposed approach in two simple domains: resource collection and crafting.\n\nMajor comments:\n\nThis paper focuses on multi-agent settings with self-interested agents. The problem formulation and the solution are novel enough. Experiments are on toy domains with very few goals and sub-task dependencies. However, authors have done a good job in doing an extensive analysis of the proposed approach.\n\n1.\tCan you comment about the scalability of the proposed solution when the number of possible subtasks increases? When the sub-task dependency graph size increases?\n\n2.\tWhat is the reason for using rule-based agents in all the experiments? It would have been more useful if all the analysis are done with RL agents rather than rule-based agents. It would also make the paper stronger.\n\n3.\tAre the authors willing to release the code? Overall the model looks complicated and the appendix is not sufficient to reproduce the results in the paper. I would increase my rating if the authors are willing to release the code to reproduce all the results reported in the paper.\n\n\nMinor comments:\n\n1.\tPage 3, line 9: “typical” -> “typically”\n2.\tPage 3, “intention” section: “Based on the its reward ..” Check grammar.\n3.\tPage 5, last line: “the total quantitative is 10” check grammar.\n4.\tPage 8, conclusions, second line: “nad” -> “and”\n5.\tPage 8, conclusions, 4th line: “combing” -> “combine”\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}