{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "Summary of the Paper:\n  \nThis paper describes a method for training Bayesian neural networks in the context of stream data. The method proposed is based on using a quantization approach with some techniques to estimate the change in probability distributions. The proposed approach is compared on some tasks, including real and synthetic datasets.\n\nDetailed comments:\n\nThe paper needs to improve the writing. For example, the sentence \"it has been unable to estimate the uncertainty of the predictions until recently\" sounds awkward.\n\nThe authors have to better explain the features and challenges of stream data.\n\nThe paper is unclear. There are several steps of the proposed method that are not well described.\n\nHow is the posterior distribution of the weights computed?\n\nThe notation x_0 and x_1 for the test point and the NN weights is confusing.\n\nFigure 2 is not clear.\n\nThe description of the baselines the authors compare with is not clear.\n\nWhat do you mean by degenerated in section 5.1.?\n\nThe paper is missing a related work section describing state of the art methods to address stream data.\n\nIt seems the real experiments of section 5.1. only consider one baseline MU. I believe this is insufficient.\n\nIn table 2 the benefits of the proposed approach are not very significant.\n\nThe experiments are missing error bars. It is not possible to extract conclusions of significance without them.\n\nMy overall impression is that the paper needs to better explain the approach followed and improve the notation to facilitate the reading. I believe that this paper needs for work and is not yet suitable for acceptance.\n"}