{"title": "a promising representation paradigm that requires more extensive study ", "review": "It is very refreshing to see a submission that investigates the fundamental question of representation: what is considered as a good representation. This works argues that is it the representation learned through a community of autoencoders.  The idea is very well motivated, taking inspiration from linguistic development. The idea is quite intuitive to understand, and makes sense. The narrative is fluent, with some accidental syntax errors. \n\nI believe this line of thinking is original to some extent, although bears some similarity with ideas in Dropout, DropConnect, however, motivated differently. It is, as pointed out by the authors, indeed a generalization of the co-adaption idea.\n\nHere is a list of questions that I have in mind:\n1. The use of the cross-entropy regularization deserves more attention. It is not clear how important this regularization is experimentally. Is there a coefficient to control its contribution?\n2. Experiments on MNIST and CIFAR require some more clarification. First of all, the use of SCG as a metric is OK, but experiments seem to only focus on early iteration comparisons. I would like to see, for example, the entire classification error (or reconstruction error) curve on the test set, epoch by epoch, with standard AEs and your proposed CbAEs side by side. \n3. Secondly, it is not clear from the text of how your test error is obtained from the community as it contains many models. It is important to factor out the effect of model averaging in comparison with standard AEs (or a community of size 1). \n4. Lastly, the negative effects of increasing community size is not clearly explained. I would like to gain more explanation of its source, especially on CIFAR100.  \n\nOverall, I think the premise of this work could be more substantiated by some semi-supervised (for transfer learning) tasks with a more realistic setup and public benchmarks. ", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}