{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper promises efficient training of spiking neuron models using back-propagation. The authors say that this is important because spiking networks offer significant energy savings, yet they typically perform poorly compared to prevalent artificial neural networks (ANNs). They aim to support this with several synthetic and one real-world task.\n\nI selected to reject the paper based on the support for the main claim of the paper being weak and inadequately demonstrated. No comparisons are to baselines are presented in the text. Reproducibility is hampered by a great deal of the experimental details missing.\n\nOn the experimental results:\n* In section 4.1, some justification is needed for why these experiments are relevant. \n* In sections 4.4 and 4.5, experiments are discussed, but results are not presented.\n* If space is a limitation, I would strongly prefer a table of actual results for sections 4.4 and 4.5 rather than Figure 2.\n* Since the encoding of the task in the spiking and non-spiking cases is so drastically different, making that crystal clear would be great.\n\nOther comments:\n* The goal of energy savings is very appealing, so it would help to give *some* quantitative measure of savings promised.\n* Similarly, the claim about the poor performance of spiking neurons would benefit from some quantitative measures.\n* A figure showing the operation of the novel SigmaDelta neuron, compared to the standard aI&F neuron, would be welcome.\n\nOverall I think the paper would benefit from focussing much more on the results, making the claims as quantitatively apparent as possible. \n\n"}