{"title": "A connection between training with noisy images and the adversarial training is not convincing", "review": "The paper suggests a connection between training with noisy images and the adversarial training. The observation is original to me. It has several cons.\n\n1. The paper is hard to follow because of  too many vague descriptions and unnecessary contrast clauses. Here are some.\n 1) The title of section 4: ERRORS IN NOISE IMPLY ADVERSARIAL EXAMPLES FOR NOISY IMAGE.  \n 2) \"The discussion of high-dimensional geometry suggests that adversarial examples may actually not be in contradiction to high generalization performance. Indeed, high generalization performance does not mean perfect generalization\" The uncertain tone \"may not\" and the vague statement \"does not mean perfect generalization\" make readers hard to get the solid understanding about what the paper tries to say. \n 3)  \"Adversarial training on small perturbations on CIFAR-10 also improved generalization in noise, and training on noise improved robustness to small perturbations.\" \nMany other sentences like the above make the paper not technically sound.\n\n2. It is problematic that the paper uses Euclidean l2 distance to measure the error set and its surface as it is believed that the dataset lives on low-dimensional manifold. Moreover, the adversarial examples often constructed by moving the legal images towards a specific direction rather than adding the Gaussian isotropic noise. \n3. The advocates that using test error in noise as a measure of adversarial robustness  is misleading  as test error in noise has a large number of different combinations: noise type, noise amplitude. One may find one type of test error in noise coinciding with adversarial robustness but  in general it is not a good measure for adversarial robustness because of its varying nature.\n4. Several terms are referred without definitions: errors in noise,  adversarial robustness. From the definition of E_epsilon, it should include the interior of E.\n", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}