{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The authors propose a multi-task learning method that uses attention mechanism to identify relations between the tasks.  \n\nMethod:\n\n- The authors motivate the use of attention mechanism for identifying a sample-dependent measure  of task relatedness by that \"task dependency can be different for different data samples..\" At the introduction stage this argument was not clear to me. I would suggest to expand this part of the paper by providing a stronger motivation for the proposed approach.\n- what kind of mappings are used in (2)?\n\nExperiments:\n\n- it seems that all the datasets used are for multi-label learning. Thus, in the evaluation procedure, could the same input X appear both in the training and the test data sets (but in different tasks)? If yes, I believe it might make the evaluation less thorough. In either case it would be helpful to have this information in the description of the setting\n- since use of attention is the main contribution of this work, but not the only part of the method,  I would recommend adding to the evaluation a method which is equivalent to the proposed one, but doesn't involve attention (i.e. only uses D). \n\nAdditional comments:\n\n- in its current form the manuscript is rather hard to follow, it requires a thorough proof-reading\n- it is unclear what Figure 1 on page 2 is for\n- on page 2 phrase \"... the label ratio is imbalanced.\" is confusing. I believe the authors meant that the data (not label) proportions between the tasks are uneven\n- on page 3 the authors say that minimisation of the empirical risk (eq. (1)) is \"the goal of multi-task learning\". This sentence needs rephrasing, because from the point of view of empirical risk minimisation any multi-task approach is worse than the corresponding single-task version (i.e. its empirical risk is higher). Only in terms of the generalization performance one can argue that information sharing is beneficial.\n- notation in (3) is confusing - index i is used in two meanings\n- it's unclear what k in eq. (4) is\n- it seems that a few references are broken\n\nTo my knowledge the idea of making amount of transfer between tasks dependent on the particular sample at hand is new. Therefore, in my opinion, with improved presentation (and in particular motivation at the beginning of the manuscript) and additional evaluation demonstrating effects of the attention component the manuscript could be recommended for acceptance."}