{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "Writing\nOverall, the readability of this paper is far from the acceptance criteria of ICLR. there are just way too many grammatical errors or typos throughout the entire paper that prevent me from understanding this paper, such as\nSec.1\nAlthough…, however…\nIn neural network -> neural networks\nThey lack understanding -> it lacks understanding\nNumerical and quantitative reasoning is their r fundamental capability -> are .. capabilities…\n...\nJust too many to print all of them here. Please proofread your paper before submission.\n\nThe introduction is poorly written that I cannot get a full picture of what goals this paper tries/has achieved after reading it.\n\nAlgorithm 1 and 2 seem to be very poorly formatted but only illustrate minimal useful information.\n\n\nMotivation\nI don’t see clear usage nor convincing results based on the current shape of this paper -- what application could this work enable or what theoretical insights it reveals?\n\nMethod\nThis paper proposes to use neural nets to do arithmetic operations (though I don’t see convincing motivations to do so). A new idea the paper proposes is to train a few networks to first learn/fit basic operations, and then use these trained NNs to assemble large NNs which are supposed to form more complex arithmetic operations. Unfortunately, the writing of this paper prevents me from fully understanding the technical details of this paper.\n\nResults\nThe results in this paper are currently minimal. Many details about the experiment setup or how different methods are compared are not clear.\n"}