{"title": "Interesting approach but motivation is not clear.", "review": "This paper proposes to construct multiple classification tasks from unsupervised data.\n\nQuality:\nThe detail of the proposed method is not mathematically presented and its performance is not theoretically analyzed.\nAlthough the proposed method is empirically shown to be superior to other approaches, the motivation is not clearly presented.\nHence the overall quality of this paper is not high.\n\nClarity:\nThe readability of this paper is not high as it is redundant or unclear at several points.\nFor example, Sections 2.1, 2.3 and Sections 2.2, 2.4 can be integrated, respectively, and more mathematical details can be included instead.\n\nOriginality:\nThe proposal of constructing meta-learning based on unsupervised learning seems to be original.\n\nSignificance:\n- The motivation is not clear. The proposed method artificially generates a number of classification tasks. But how to use such classifiers for artificially generated labels in real-world applications is not motivated.\n  It is better to give a representative application, to which the proposed method fits.\n- There is no theoretical analysis on the proposed method.\n  For example, why is the first embedding step required? Clustering can be directly performed on the give dataset D = {x_i}.\n- Although the paper discusses using unsupervised learning for meta-learning, only k-means is considered in the proposed method.\n  There are a number of types of unsupervised learning, including other clustering algorithms and other tasks such as outlier detection, hence analyzing them is also interesting.\n- The proposed method includes several hyper-parameters. But how to set them in practice it not clear.\n\nPros:\n- An interesting approach to meta-learning is presented.\n\nCons:\n- Motivation is not clear.\n- There is no theoretical analysis.\n", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}