{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper presents a graph neural network for drug-to-drug interaction (DDI) prediction, which explicitly models link type correlation. Basically, the drug-to-drug interaction prediction problem is a specific type of link prediction task, with drugs as vertices and interaction as edges, and the authors propose a graph neural network with an energy-based formulation where the link types are encoded as the graph edges. The authors validate their method against feedforward GNNs on two DDI prediction datasets, and achieve significantly improved performances.\n \nPros\n- The drug-to-drug interaction prediction is a relatively less explored application of deep learning with growing interests.\n- The proposed energy-based formulation that considers link type correlation intuitively makes sense and performs significantly better than some of the existing GNN approaches. \n \nCons\n- Using energy-based formulation for graph neural network is not novel, and thus the paper lacks novelty in methodology point of view. Thus this paper seems to fit better for a pharmaceutical journal or a journal rather than a top-tier deep learning conference such as ICLR. I do not think the paper will be of interest to a large audience.\n \n- The experimental validation is limited. The authors only compare against GNN and GLENN, without even mentioning other relevant baselines such as GCN and GAT. Thus I suggest the authors to perform a more extensive comparative study.\n \n- The qualitative analysis is insufficient, even as a domain-specific empirical study paper. It would be better if the authors included actual examples of drug-drug interaction predicted by the proposed model and an existing model, for further analysis and interpretation.\n \nIn sum, while I believe that DDI prediction is an interesting application of deep learning with growing interests, I do not believe the paper has sufficient novelty or experimental validation / qualitative examples to be a meaningful contribution to ICLR. I suggest the authors to work on the experimental validation and qualitative analysis part and submit it to a workshop or a pharmaceutical journal instead.  \n"}