{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "Abstract:\nUnderstanding drug-drug interactions (DDI) is an important task in drug development and prescription management. The authors proposed a new graph energy neural network (GENN) for DDI prediction. Comparing to the existing Decagon model (Zitnik et al. 2018), the proposed new model considered correlations between DDI types and used a new energy function to capture this information. By comparing to the previous baselines, the authors demonstrated their approach was able to achieve the SOAT performance in terms of prediction accuracy, be more robust to missing DDI data, and better capture the correlations between DDI types.\n\nMajor comments:\nThe authors succeed in combining graph neural networks and structure prediction to capture correlations of DDI types between drug-drug pairs.   They used an energy function based on graph neural networks to capture the dependencies among edge types in DDI graphs.  \n\nHowever, the description of training cost-augmented inference network and test inference network is convoluted. The authors didn't elaborate on why trained cost-augmented inference network cannot be directly used for test inference, and why the prediction for unknown DDI type is different in test inference.  In addition, the notations used in the last sentence of the second paragraph of section 4.3 seem to be inconsistent with Eq. (4)\n\nThe authors compared their model (GENN) with multiple baselines and demonstrated superior performance only in PR-AUC. In the description for Table 1, the authors claimed: \"GENN largely outperforms others with respect to all metrics in both datasets.\"  However, this conclusion can not be supported by Table 1, in which GENN only shows trivial improvement comparing to GNN for the most reported metrics.\n\nLast but not least, the authors did not provide any limitations of their work. \n\nMinor comments:\nIn general, the paper is well written and easy to follow, except for sections 4.2 and 4.3.  As mentioned above, the notations used in the last sentence of the second paragraph of section 4.3 seem to be inconsistent with Eq. (4)"}