{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper proposes a simple extension to the training of emergent communication protocols in multi-agent settings. \nThe central hypothesis is that learnability will favor more 'compressible' and therefor more compositional languages to emerge. \n\nThis hypothesis is tested by training a population of listens and speakers in an emergent communication task and comparing a number of different strategies for reinitializing agents in the population. Since the new agents start from a random initialization, they provide a learning signal that reinforces protocols which can be learned quickly. \n\nExperiments:\nWhile the experimental results largely confirm the hypothesis there are a few issues:\n-all of the plots show mean and standard deviations, rather than error of the mean. This makes it difficult to understand which differences are statistically significant and which ones are not. \n- The replacement strategy 'epsilon-greedy' replaces agents based on their validation loss, which seems like an unfair advantage. \n- It is currently unclear how much we can learn from Section 5.2: Naturally, agents trained in the same population will develop more similar protocols than those trained independently. This result is obvious and it is unclear whether reinitializing the agents makes any significant difference to the similarity. Again, confidence intervals would help.  \n- The experiments are also extremely toy. I would be more convinced if the authors tested their method on a more challenging task, though I am aware this is a common problem in this field. \n\nNovelty:\nThe single biggest issues with the current form of the paper is the related work section. In this section two papers [1,2] are mentioned as \"concurrent\" when at least one of them [1] has been available online since June 2019. I think it is important to clearly point out the novelty of the current work compared to those two previous papers. \nIn particular [1] seems to be extremely close to the ideas and methods proposed here. Saying that these papers \"confirm the hypothesis\" simply is not enough. \n\nReferences:\n[1]: \"Ease-of-Teaching and Language Structure from Emergent Communication\", Funshan Li et al\n[2]: \"Co-evolution of language and agents in referential games\", Gautier Dagan et al \n"}