{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "Contributions: this submission proposes a generative framework which employs a hierarchical decomposition of scene, objects and parts. It modifies the SPAIR framework (Crawford & Pineau) and replaces the recurrent generation with parallel generation, by assuming the number of objects is known and fixed. Results are presented on two synthetic datasets with 2D or 3D shapes.\n\nAssessment:\n- The proposed model and learning framework are closely related to previous work (AIR, SPAIR). The authors replaced the \"sequential processing ... with single forward pass\", which requires the number of objects to be fixed.\n- In the proposed model, there is no constraint on the part-object hierarchy, and it is unclear whether it can learn to discover such hierarchies directly by reconstructing single static images. It is also not evaluated in the submission.\n- There are no comparisons with AIR or SPAIR on the two datasets the authors created.\n- The authors are recommended to compare with previous work on hierarchical generative modelings with objects and parts, such as (Xu et al, ICLR 2019), and other related work, such as SPIRAL (Ganin et al.)\n\nDue to the limited contribution, lack of comparison with related work and limited empirical evaluation, I recommend rejection of the submission.\n\n[1] Xu el al, Unsupervised Discovery of Parts, Structure, and Dynamics, ICLR 2019.\n[2] Ganin et al., Synthesizing Programs for Images using Reinforced Adversarial Learning."}