{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "[Summary]\nThis paper proposes an image translation method that generates images of missing domains from images in multiple available domains. i.e., ReMIC. For achieving this, the authors employ using separated latent codes for content and style from shared representation. They compare the proposed model with StarGAN, MUNIT, CollaGAN on two medical datasets (BraTX, ProstateX) and RaFD datasets, using NRMSE, SSIM, and oracle GT.\n\n[Pros]\n- Task is novel and important, in particular, in medical domains.\n- Experiments are extensive and the results on medical data look promising.\n- Well written.\n  \n[Cons]\n- Technical novelty of the method is incremental. Most components are from previous work.\n- Even if the authors argue that their model uses disentanglement, it is overclaiming that to separate style and content is disentanglement. There exsist several previous studies to separate style and content. To claim disentanglement, it is required that more specific information should be separated from styles such as hair-style and lip color. \n- The experimental setting is not consistent with task definition. Task definition assumes k-missing domains among n domains, i.e, (n-k)-to-k. However, experiments cover k=1 case only: (n-1)-to-1. This setting is similar to that of CollaGAN. I think it is not trivial to extend k to multiple missing domains.  \n- Figure 1 can be improved. StarGAN performs 1-to-n mapping with target style one-hot encoding (The authors also refer to that in page 6), unlike Figure 1. \n- Experimental results on RaFD are not impressive. Could you evaluate the proposed model on high-resolution data such as CelebHQ? Also, for RaFD, other conventional metrics can be used such as FID.\n- A figure on the detailed architecture can help to understand the method. \n"}