{"title": "Reasonable approach with good results; incremental novelty ", "review": "This paper proposes an extension to the continual learning framework using existing variational continual learning (VCL) as the base method. In particular, it proposes to use the weight of evidence (WE) (from Zintgraf et al 2017) for each task. Firstly, this WE can be used to visualize the learned model (as used in Zintgraf et. al. 2017). The novelty of this paper is:\n1. to use this WE from the current task to generate a silence map (by smoothing the WE) for the next task.  This is interpreted the learned the learned attention region. Such an approach is named Interpretable COntinual Learning (ICL) \n2. The paper proposes a metric for the saliency map naming FSM which is an extension of existing metric SSR. The extension is to take pixel count to compute the area instead of using rectangular region area, as well as taking the distance between pixels into account. This metric can be used to evaluate the level of catastrophic forgetting.\n\nPro:\nIn general, the idea is very intuitive and make sense.  The paper also demonstrates superior performance with the proposed method on continual learning on all classic tasks comparing with VCL and EWC. \nThe presentation is very easy to follow. \nIt seems like a valid and flexible extension that can be used in other continual learning frameworks.\n\nCons:\nThe theoretical contribution is very limited. The work is rather incremental from current state-of-the-art methods. \nThere should be a better discussion of related work on the topic. The paper currently only mentions the most related work for the proposed method,  using the whole section 2 to describe VCL and use section 3 to describe FSM and half of section 5 to describe SSR. A general overview of related work in these directions are needed.  \n\nOther:\n1. The paper should also consider more recently proposed evaluation metrics such as discussed in https://arxiv.org/pdf/1805.09733.pdf \n2. The author should try to avoid using yellow color in plots. ", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}