{"title": "The method proposed in the paper may have poor generalization and scaling performance", "review": "This work considers a version of importance sampling of states from the replay buffer.  Each trajectory is assigned a rank, inversely proportional to its probability according to a GMM. The trajectories with lower rank are preferred at sampling.\n\nMain issues:\n\n1. Estimating rank from a density estimator\n\n- the reasoning behind picking VGMM as the density estimator is not fully convincing and (dis)advantages of other candidate density estimators are almost not highlighted.\n\n- it is unclear and possibly could be better explained why one needs to concatenate the goals (what would change if we would not concatenate but estimate state densities rather than trajectories?)\n\n2. Generalization issues\n\n- the method is not applicable to episodes of different length\n- the approach assumes existence of a state to goal function f(s)->g\n- although the paper does not expose this point (it is discussed the HER paper)\n\n3. Scaling issues\n\n- length of the vector grows linearly with the episode length\n- length of the vector grows linearly with the size of the goal vector\n\nFor long episodes or episodes with large goal vectors it is quite possible that there will not be enough data to fit the GMM model or one would need to collect many samples prior.\n\n4. Minor issues\n\n- 3.3 \"It is known that PER can become very expensive in computational time\" - please supply a reference\n \n\n- 3.3 \"After each update of the model, the agent needs to update the priorities of the transitions in the replay buffer with the new TD-errors\" - However the method only renews priorities of randomly selected transitions (why would there be a large overhead?). Here is from the PER paper \"Our final implementation for rank-based prioritization produced an additional 2%-4% increase in running time and negligible additional memory usage\"\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}