{"title": "In-depth discussions and improvements on MAML", "review": "In the work, the authors improve a simple yet effective meta-learning algorithm called Model Agnostic meta-learning (MAML) from various aspects including training instability, batch normalization etc. The authors firstly point out the issues in MAML training and tackle each of the issue with a practical alternative approach respectfully. The few-shot classification results show convincing evidence.\n\nSome major concerns:\n1. The paper is too specific about improving one algorithm, the scope of the research is quite narrow and I'm afraid that some of the observations and proposed solutions might not generalize into other algorithms;\n2. Section 4, \"Gradient Instability → Multi-Step Loss Optimization.\" I don't see clearly why the multi-step loss would lead to stable gradients. It causes much more gradient paths than the original version. I do see the point of weighting the losses from different step;\n3. The authors should have conducted careful ablation study of each of the issues and solutions. The six ways of proposed improvements may make the the performance boost hard to understand. It would help to see which way of the proposed improvement contribute more than others;\n4. Many of the proposed improvements are essentially utilizing annealing mechanisms to stabilize the training, including 1) anneals the weighting of the losses from different step; 2) anneal the second derivative  to the first derivative;\n5. For the last two improvements about the learning rate, there are dozens of literature on meta-learning learning rate and the proposed approach does not seem to be novel;  \n \nMinors\n1. The reference style is inconsistent across the paper, sometimes it feels quite messy. For example, \"Batch Stochastic Gradient Descent Krizhevsky et al. (2012)\" \"Another notable advancement was the gradient-conditional meta-learner LSTM Ravi & Larochelle (2016)\";\n2. Equation (2) (3) the index b should start from 1, size of B should be 1 to B;\n", "rating": "6: Marginally above acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}