{"title": "Review of Kmer2vec method finds both method and evaluations unsuitable for stated aim, also lack of domain knowledge.  ", "review": "The stated contribution of the paper is the development of a model to learn continuous representations of k-mers from RNA sequencing experiments in an annotation-free manner. The paper motivates this model by considering analysis challenges faced in cancer genomics. This introduction serves well to frame the paper towards addressing these challenges. In particular, the authors highlight challenges faced in recognizing and quantifying patient/tumor-specific RNASeq based expression estimates involving structural variants and indels, which have and continue to be a challenge for existing tools. \n\nDespite this, we are not enthusiastic about the paper for the following reasons:\nNarrow and incomplete view of commonly used modern RNA-seq tools/pipelines and their application/use in biomedical research.\n\nThe proposed computational method is computationally intractable and is unlikely to ever scale to the genome-wide context.\n\nDescribed experiments are without context to the existing literature of tools designed to address the biological challenge and by construction are not annotation free.\n\nWe further describe these reasons in the following subsections. Overall, we do not believe that the described model/experiments demonstrate utility for either the specific problems in cancer genomics that motivate the paper or the biomedical research field in general.\n\nNarrow and incomplete view of RNA-seq tools/pipelines/application:\n------------------\n“Reducing this rich data to only the detection of annotated genes [...] is not appropriate for analysis”. Modern RNA-seq pipelines also perform quantification and differential analysis at a minimum.\nThe description of the standard RNA-seq experiment is problematic:\nSequencing is of cDNA after reverse transcription, not RNA.\nIgnores paired end reads (especially with longer insert sizes for fusion detection)\nShredder poor analogy given multiple distinct reads from same sequence, known biases in process\n“[...] multiple sequence alignment is an NP-hard problem”. This is true but irrelevant.\nChromosomal translocations are indeed hard to detect by RNA-seq, but not impossible. There are strategies implemented in commonly used tools such as STAR, kallisto, and others to detect these and other structural variants. Individual reads do not have to themselves cover the sequence where translocation occurs, instead read pairs can imply that the insert contains a translocation -- in this case, sequence similarity is much higher. Regardless, cheaper orthogonal assays exist that can detect these events.\n“The standard RNA-Seq analysis pipeline has a mean processing times of 28 core hours for mapping with software TopHat, followed by an additional 14 hours of quantification”. See “Please stop using TopHat” (https://twitter.com/lpachter/status/937055346987712512?lang=en) by one of the authors of TopHat and the senior author of the cited paper. Standard pipelines use newer aligners like STAR which are substantially faster.\n“Reference based methods yield a relative abundance measurement of genes, which are by definition, hand crafted features”. Relating results back to genes is important to be able to connect sequencing results back to known biology. We see the fact that there is no obvious map from the proposed method back to genetic information as a weakness.\n\nProposed computational method computationally intractable and unlikely to scale to genome-wide context\n------------------------\nPlus:\nPaper does acknowledge that scalability is a limitation.\nMinus:\nLower bound of range of unique kmers per sample without pre-filtering is 10 billion; note that storing counts uncompressed as 32-bit integers corresponds to over 37GB per sample.\nExperiments are for only four genes, two at a time with a 2-dimensional embedding. Unclear how patterns will hold when considering k-mers from more genes simultaneously or how embedding could scale. Model formulation suggests that k-mers from co-expressed genes will have similar embeddings, which could complicate visual inspection.\nAbstract states that “learned representation both useful for visualization as well as analysis”. Unclear what is done with model/embeddings besides visualization -- non-visual analyses are performed with k-mer counts before embedding. Identification of abnormalities are described only by visual inspection, which is unlikely to scale as more k-mers are added and/or if the dimensionality of the embedding increases.\n\nExperiments without context to existing literature and are not annotation free\n----------------------------------------\n\nThe paper describes that existing methods are limited by their dependence on annotations. The paper does not describe existing methods using annotations designed to address tasks/applications suggested for the new model. The paper does not compare developed model to these existing methods. To make the experiments performed in the paper computationally tractable, RNA-seq reads are aligned to the reference genome (annotations of sequence) and sequences in specific regions, defined with respect to genes of interest (annotations of genes). The experiments are therefore dependent on annotation although they lose their information/interpretability in this context. The paper notes that many kmers are not included in exonic sequences according to exact matches to annotations of coding sequence. Nonetheless, these reads are in this dataset, which means they are also identified by standard tools/annotations despite their differences. In Figure 3, embedding overlap between kmers in the annotated coding sequence of ZFX and ZFY are illustrated. It would be helpful to show the proportions of reads that were used for this analysis that mapped uniquely vs not to genomic intervals in these genes (reads rather than kmers). In this regard, the absence of any note or methods describing how reads were mapped (what method, with which parameters) to reference (which reference genome, which gene annotations) is a serious limitation.\n\nOther notes\n---------------------\nThe heatmap in Figure 5A is ambiguous and could be improved by better annotating what is on rows/columns, perhaps also including numeric information textually in addition to by color.\nIdentification of kmers spanning translocation region (illustrated in embedding space by 5B) was done entirely without kmer2vec (identifying exclusive kmers, assembly of kmers, BLAST alignment to two chromosomes). Thus, claim that, as a consequence, “kmer2vec captures real genomic abnormalities and allows to extract directly from the kmer embedding space the abnormal sequence” is unsubstantiated.\n\n", "rating": "2: Strong rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}