{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes a novel training method based on group DRO that makes it possible for overparameterized neural networks to achieve uniform accuracy over different groups of the data, where the data is required to obey a mixture distribution composed of these groups. In addition, the authors identify that increased regularization plays a critical role for worst-group performance in the overparameterized regime by a series of empirical studies. The authors also compare  their method with the traditional importance weighting method. Finally, they introduce a stochastic optimizer for their group DRO method.\n\nPros: \n\n* The experiments are well designed and the results show the effectiveness of the approach.\n* Most parts of the paper are well written and easy to follow.\n\n Cons:\n* The title is a little bit vague and may overstate the paper's contribution. In fact, the problem addressed in the paper is not as general as the title suggests and has little to do with the generic DRO framework.\n* In the group DRO setting the data is distributed as a mixture of different groups. However, the groups need to be chosen using prior knowledge of \"spurious associations\", which may arouse doubts about the algorithm's actual effectiveness and undermines the value of the algorithm on the application side.\n* Some terms used in the paper are ambiguous. For example the concept of  \"group\" is not defined properly. Sometimes it refers to a subset of the dataset while sometimes it denotes a sub-distribution in the mixture distribution. The authors should use more precise terminology.\n* There is a typo in Proposition 1, where the uncertainty set Q should be a set of probability distributions,  not a subset of R^m."}