{"title": "Riemannian ADAM", "review": "I have enjoyed reading this paper. The paper is accessible in most cases and provides a novel optimization technique. Having said this, I have a few concerns here,\n\n\n- I am not sure why the notion of product manifolds is required in developing the technique. To me, all the arguments follow without that. Even if the authors are only interested in manifolds that can be constructed in a product manner (say R^n from R),  the development can be done without explicitly going along that path. Nevertheless I may have missed something so please elaborate why product manifolds. I have to add that in many cases, the underlying Riemannian geometry cannot be derived as a product  space. For example, the SPD manifold cannot be constructed as a product space of lower dimensional geometries. \n\n- I have a feeling that finding the operator \\Pi in many interesting cases is not easy. Given the dependency of the developments on this operator, I am wondering if the method can be used to address problems on other manifolds such as SPD, Grassmannian or Stiefel. Please provide the form of this operator for the aforementioned manifolds and comment on how the method can be used if such an operator is not at our disposal.\n\n- While I appreciate the experiments done in the paper,  common tests (e.g., Frechet means) are not presented in the paper (see my comment below as well).  \n\n- last but not least, the authors missed the work of   Roy et. al., \"Geometry Aware Constrained Optimization Techniques for Deep Learning\", CVPR'18 where RSGC with momentum and Riemannian version of RMSProp are developed. This reference should be considered and compared.\n\n\nAside from the above, please\n\n- define v and \\hat{v} for Eq.(5) \n\n- provide a reference for the claim at l3-p4 (claim about the gradient and Hessian)\n\n- maybe you want to mention that \\alpha -> 0 for |g_t^i| at the bottom of p4\n\n- what does [.] mean in the last step of the algorithm presented in p7\n\n- what is the dimensionality of the Hn in the experiments\n \n\n\n\n", "rating": "7: Good paper, accept", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}