{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "In this paper, the authors propose the EfferenceNet, which first exploits some pre-trained network to obtain a continuous representation of the state, the dynamics model, which is parametrized as a neural network, will be learned by matching the temporal difference. Then, a best-first search algorithm with a heuristic criterion is conducted to plan in the latent represented space. \n\nOne of my major concerns of this paper is the novelty. Planning in latent space has been investigated for a long time with rich historic literature. Each component in this paper can be dated back to the classic text-book. The Koopmann operator [1], which considered to use 'infinite-dimension' pre-fixed nonlinear mapping to obtain the latent continuous representation, has been invented in 1932. Using temporal-difference to fit the dynamics also appears in classic textbook. The 'best'-first searching is just a variant of Breadth-first search with a heuristic ranking criterion. Maybe the only novel part of this paper is the connection to the efference copy and sensory reafference theory in neuroscience. However, this part is not clearly and rigorously justified. \n\nThe other major concern of mine is that experiments. The proposed method has neither been evaluated appropriately on the current benchmark, nor been compared with current state-of-the-art algorithms. The benefits of the proposed algorithm is not convincing. \n\nIn sum, I think this paper is not ready to be published.\n\n\n[1]  B. Koopman and J. v. Neumann,  “Dynamical systems of continuous spectra,”\nProceedings of the National Academy of Sciences of the United States of America\n, vol. 18, no. 3, p. 255, 1932. "}