{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper proposes a hierarchical structure for decomposing the image enhancement problem into multiple steps that can be better learned separately. While the method in the paper is intriguing I think it needs further study. The experiment analysis and comparison to baselines on a different image resolution seem a little unfair. As well, given the current writing in the paper, many of the components of the method do not appear to be overly novel. \n\nMore detailed comments:\n-\tWhile the quantitative improvement for the method is important, it is difficult for the reader to understand how significant these quantitative improvements are, relative to image improvement. It could help to include more image examples in the appendix for the paper. The user study experiment does help with this analysis. If it was also performed on the weekly supervised case it would support the improvements provided by the method even more.\n-\tThe paper proposes a perception-based division. How is this perception-based division motivated?\n-\tIn the abstract, there is a confusing sentence? What does the \"dimension-based division\" do? It should be explained a little better before it is introduced in the abstract.\n-\tFor the divide part of the method, things are split into a hierarchy. Will this learning system be combined into a system that will be able to train the levels of the hierarchy together? What is the final loss function that is used to train the network are equations 4 and 5 added together? It might be better to include an algorithm to help understand how the system is trained.\n-\tThe sentence “On one hand, learning additive map is encouraged by the success of residual learning on image colorization and super-resolution et cetera.” Needs a reference.\n-\tFOr equation 1 where the additive and multiplicative advancements are described has a chained version of this been considered instead of the addition of these two maps? This might align more with the methods used in computer graphics to create renderings.\n-\tI find the application to weekly supervised learning very interesting. If more results can be shown on this problem it would help show the impressiveness of the method.\n-\tThe use of cycle GAN for the reconstruction loss does not appear to be very novel. Is its use in some way unique as to make it more novel?\n-\tA reference for equation 5 would be helpful to the reader. Currently, it is a bit unclear where this equation comes from?\n-\tAn ablation for equation 6 is important if the authors are claiming this as an important feature to add.\n-\tUp to the end of section 2, it still seems like this work is a combination of recently used methods. They are combined in a way to make use of an interesting hierarchy but this does not seem to be very novel. For example, the use of multi-scale design on a U-Net feels like a small improvement over current methods. If the authors can further explain the complexity of this combination or the large improvement it has on the results it would help convince the reader of the novelty of this combination.\n-\tIt is noted in the paper that the experiment studies a higher resolution image enhancement data set that the baseline methods were not originally evaluated on. While it is good progress to show that the proposed method in the paper works well on this higher resolution dataset it is important to compare the proposed method to the baseline methods on the lower resolution dataset the baselines were originally evaluated on. This will allow the reader to have a more fair comparison of the improvements of the proposed method.\n"}