{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "N/A", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper describes a large-scale ECG dataset that the authors intend to publish. Along with the to-be-released dataset, the authors also provide some unsupervised analysis and visualization of the dataset. \n\nThe data is collected using the author’s company’s single lead ECG devices. The dataset is collected from 11,000 patients and contains over 2.7 billion peaks. According to the cited works in section 2, the scale of this proposed dataset is unprecedented and will be beneficial to the ECG community.\n\nI think this is an interesting dataset for the ECG machine learning community. Some recent advances in this field are based on non-public dataset. However, this dataset seems to require additional curation before it is ready.\n\n\n\nQuestions. \nIn section 3, the authors discuss the potential concerns regarding privacy, what are the measures taken by the authors when collecting & distributing this dataset? I didn’t find this question addressed in section 3.\n\nLike the authors stated in 2nd paragraph under section 4, this dataset is biased in the sense that it is collected from patients. The subjects are in the age group of 62.2 +/- 17.4. Do the authors recognized various chronicle conditions that often appear in that age group? Is that information part of the to-be-released dataset?\n\nSince this work focuses on releasing  a dataset, I find the current experiment section unnecessary & somewhat unrelated. What would be interesting to see is whether the authors use ML techniques to facilitate the curation of the dataset. For example, in paragraph 3 under section 4, it says each segment data is labeled by 3 technologists. How many technologist are involved in total? and what measure are taken to address the variances among different technologists?\n"}