{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper introduces a residual learning approach to visual odometry, learning an error correction term to complement traditional visual odometry pipelines. In contrast to existing work, which tends to use a correction network following a zero mean Gaussian error model, this work proposes a Gaussian error correction term using a full covariance matrix, and non-zero mean error model, introducing a modified loss to do so. This makes this work somewhat incremental. However, well calibrated visual odometry systems with a measure of uncertainty are crucial to downstream processes in robotics, so this is an important topic.\n\nMinor:\nThere are some language choices and typos that make the paper somewhat difficult to follow. For example, the paper repeatedly uses the phrasing \"... deep learning can be sided to classifical visual odometry\" to indicate learned error correction. I think the paper would be clearer if the contribution was described in the context of residual learning, and the paper proof read to correct other typos.\n\nThe paper uses a 3 sigma outlier test to assess the quality of the learned error model. While I appreciate the fact that the paper does evaluate the uncertainty model, this is a weak test, and a better test for normality would be more useful.\n\nMajor:\nTraining process, tests were conducted on held out sequences from the Kitti dataset. Were the sequences captured in areas previously seen during training, or on similar routes?\n\nI am concerned about the scope of the work and it's potential interest to an ICLR audience. Visual odometry is a very specific application, and a more general paper on uncertainty estimation for residual learning would be better aligned to ICLR, with the addition of experiments in other settings, than this paper which is very specifically focused on VO. As it stands, the paper seems better suited to a robotics conference like ICRA or IROS.\n\nThe paper does a good job of providing detail on experimental architectures and parameter settings. However, in the experimental results, the paper states that the proposed NLL loss and the prior work lie algebra formulation are similar, but the 2 degree yaw error is quite a bit larger than the prior work. By my reading, the table seems to indicate that the lie formulation is actually better at correction, or that the greater expressiveness of the error model reduces the residual corrections ability to correct the odometry.\n\nUnfortunately, given the incremental nature of this work and the lack of particularly strong results, I lean towards rejecting this paper."}