{"title": "The paper is not providing a clear presentation of the proposed approach. Experiments involve few data. Seems a preliminary paper.", "review": "As a reviewer I am expert in learning in structured data domains. I am not an expert in chemistry or related areas.\nThe paper proposes a GAN-based system for the generation of ternary compounds of interest starting from observations on binary compounds. \nTo me the paper is not providing sufficient details and explanations/justifications to allow a full comprehension of the relevance and validity of the proposed approach.  For example, it is not clear to me what is the aim of the first step of the approach. The author(s) claim it is needed to generate \"...new data with increased complexity\".  How is complexity defined ? Why this is needed to reach the final goal ? How can the proposed approach guarantee that it will lead to a \"good\" increase in complexity ? \nI am not stating that  the proposed model for the first step is not achieving the intended purpose, but that from the current presentation in the text I was not able to understand that. \nSince I am not an expert in chemistry, I was not able to grasp what are the properties from A and B which are merged. In general, I found presentation to assume specific domain background knowledge that probably is not known by most of the ICLR attendees.\nSince I was not able to understand the first step, I had difficulty also to follow the second step.\nIn addition to the presentation issue, I think that the experimental part needs to be improved by enlarging the set of used data. The current assessment involves a single dataset of a relatively small size. Moreover, the number of returned valid ternary compounds is, in proportion to the size of the dataset, very small. \nOverall I see the paper as a preliminary report of a preliminary work, which potentially could contribute in a novel way to a relevant problem in the design of advanced materials.\nAs already said before, I think that the paper could be understood and of interest for only  a small fraction of ICLR attendees.\n", "rating": "4: Ok but not good enough - rejection", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}