{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This paper analyses the shortcomings of GANs that have been observed in previous research, proposing and testing two potential reasons for the observed shortcomings, and proposing methods to mitigate these. The two proposed causes (sample insufficiency and pixel wise combination) are tested both empirically and theoretically. Sample inefficiency relates to batch size, and the authors show that the FID scores are lower when larger batch sizes are used. Pixel wise combination refers to the idea that if the discriminator picks up pixel wise combinations of training items as positive samples, then the generator will generate pixel wise combinations as well, despite these being not similar to the samples.\n\nThe paper is well written and contains both theoretical justifications for the hypotheses as well as empirical verification. The arguments presented are convincing.\n\nThe solutions presented are not convincing to me though. The authors propose pixel-wise combination regularisation and sample correction.\n\nPixel-wise combination regularisation generates pixel wise combinations and adds them to the negative training set. A concern here is that it is possible that some pixel wise combinations are in fact valid positive samples. In particular, one could envision that two very similar input images would have a combination that looks coherent. Adding this to the negative set may cause problems.\n\nI think I may have been missing something in terms of sample correction. The paper proposes removing realistic negative samples without providing any indication of how this could be done in general. I think it makes sense that increasing the distance between the positive samples and negative samples would make the discriminator's job easier. But this is easier said than done, and I feel that this is perhaps not meaningful enough as a contribution.\n\nOn the whole, I think the work is good, and I look forward to reading the author's explanations and responses to these concerns.\n\n"}