{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The authors present architectural changes to existing automatic music transcription models (AMT) to incorporate more expert knowledge/bias about the harmonic structure of musical notes. The use a variable-q transform (VQT), instead of a constant-q transform (CQT) or mel-spectrogram, as the input to the convolutional acoustic model. They compare performance on the MAPS dataset and find improvement over other convolutional acoustic model baselines. \n\nWhile the paper is clearly written and straightforward, the broader relevance to the ICLR community is not very well supported by the experiments. Incremental improvements are made on a smaller domain-specific dataset with feature engineering and minor architecture tweaks. The results are clear, but perhaps more appropriate for a domain-specific conference such as ISMIR. The paper could be strengthened by performing an apples-to-apples comparison to the sota model of Hawthorne et al. (2019) on the larger and more difficult MAESTRO dataset. The authors claim that only focusing on MAPS better tests generalization (because of the lack of instrument overlap between train and test), but MAPS is composed of more synthetic data, and it is not clear if the specific biases introduced by the authors just align better to those peculiarities of the dataset, or if they would transfer to more realistic data such as MAESTRO. The authors seem to have a comparable setup (with data augmentation and LSTM), and showing compelling results on MAESTRO would greatly support their claim that the harmonic input representation is not just injecting bias that could be compensated for with a larger network. If they did so I would be open to changing my rating.\n"}