{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This paper tries to design an effective and economical model which spots keywords about pests and disease from community radio data in Luganda and English. The author collected keywords from both radio and online newspapers, set up a Siamese convolutional neural network, which includes input 1 and input 2, Resnet 50, Flatten, five-layer dense and L1 distance, trained the model on a total of 18426 samples and validated on 4607 and tested on 5759 samples via a K80 GPU on Google Colab.  \n\nThe paper should be rejected because:\n(1) The generalizability to different use cases needs to be shown. The approach is too applied.\n(2) The fit to ICLR is not perfect. I would expect a stronger focus on representation learning.\n(3)\tModel\nThe paper lacks necessary explanation and clarification for the model, which is the core of the paper. For example, the part “Dense” in Siamese convolutional model is not well explained. The number of layers is up to 5, if there is no dropout, the model may have overfitting and gradient vanishing problems. \n(4)\tResult\nAs can be seen from both model accuracy and model loss curves in Figure 1, the part of 21st -30th epochs shows an increasing accuracy of training data while that of validation data does not increase anymore and a declining loss of training data while that of validation does not decrease. This is a tendency of overfitting, which means the model should adopt 20 epochs rather than 30 epochs. \n(5)\tIncompleteness \nCompared with the detailed depiction of the first three parts, part 4, part 5 and part 6 are insufficient. It is necessary to complement these three parts with interpretation, explanation and discussion. \n\nThings to improve the paper that did not impact the score:\n(1)\tLanguage problems such as in page 3 paragraph 2: “To compliment the keywords captured from radio talkshows, we also scrapped an online local newspaper.”  Here “compliment” should be “complement”, and “scrap” is semantically incorrect. \n(2)\tPage 4 part 4.1: “…according to a hierarchical feature extraction given by equation 3.” It should be equation 2. \n(3)\tFormat in references: fonts are not uniformed."}