{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper presents methods for linking language reasoning with 3D spatial reasoning. These methods are demonstrated on \n- spatial reasoning: an image is created to evaluate if a natural language utterance about objects is possible in 3D;\n- referential object detection: given the description of an object and an image, localise the object in 3D;\n- instruction following: given an instruction in NL and an image, predict the initial and final 3D locations of the object to be moved.\n\nThe main contribution is to introduce 3D features to several problems involving vision and NLP -- the 3D features come from some previous work (50). 3D understanding is clearly needed to solve properly these problems while most previous work attempted to solve them \"in 2D\", and this is a very interesting and important contribution.\n\nThe work itself is thus very interesting. There is some manual supervision involved to link nouns with 3D bounding boxes (section 2.1) but the approach remains attractive. My concern is that the paper is difficult to follow,  with limited technical details: The paper is very dense, as it tackles several problems, and the links between the different parts are not always clear. This also does not leave much  space for technical details and only high-level descriptions of the methods and the experiments are given. This unfortunately makes the paper difficult to accept as it is, as the work is difficult to understand in detail and not really replicable.\n\nI would suggest the authors to sacrifice one part (maybe the last one, which is close to the referential problem, even if it corresponds to the ultimate goal of the work), to get more space and give a better formalization and technical description of the work.\n"}