{"title": "Interesting task and simple approach but experiments are not formulated well and are not convincing", "review": "This work proposes to explain classification decisions via quantitative estimates of the contributions of individual visual concepts to the classification score. It learns an explainer model on top of a performer model (as distillation); the explainer returns the contributions of different concepts. To prevent the model from only selecting a few concepts for the explanation, the authors use a prior-enforcing loss. \n\nThe approach is clear but evidence that the proposed work will have an impact in practice is not convincing. The quantitative results don't show the proposed method is useful. Table 1 shows entropy over concept contributions, but the authors don't convince the reader that this is the right metric to use. They argue using too few concepts (which of course leads to low entropy) is undesirable, but there is no evidence/proof why this is undesirable. Table 2 uses prediction accuracy, which does not seem to be in line with explainability. The qualitative figures are somewhat interesting, but they are not sufficient. It is easy to look at a qualitative figure and say \"sure, this makes sense\" but this does not mean the proposed method is useful, especially when there is no result from a baseline, whose output might also make perfect sense. Finally, the authors claim pixel-level visualizations aren't useful, but there's no proof of why that is. A user study of what's useful, or a quantitative evaluation of the usefulness of different visualizations for downstream tasks, would be good. \n\nIn terms of writing, the first few pages tend to be repetitive yet vague about what exactly will be done (generally ok for introduction, but a bit too vague). It is not clear what \"subjectively visualizing\" means. Finally, I found the end of second para in Sec. 3 unclear.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}