{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper proposed  a so-called diagonal GCN method with adaptive neighborhood aggregation rules., namely, each node will be associated with an individual importance factor to re-scale the output signal  of the graph convolutional operator, and also an adaptive encoder function is adopted. This is achieved by adding a left diagonal matrix P and a right diagonal matrix Q to the standard message passing of GCN H’ = sigma(AHW), as H’(PAQHW); P and Q are parameterized based on the HW part (node features). Multihead attention and multi-hop versions are also derived. Connection of this formulation to the existing GAT method is also discussed. Empirical results on transductive node classification and inductive node classification are reported against state-of-the-arts.  \n\nOverall I feel that the novelty of the proposed method is quite limited. Adding a rescaling on each node seems a minor structural change based on existing GCN framework. Although the authors claim that the GAT method can be deemed as a special case of the proposed methods, the main contribution of inductive attention in GAT should not become a credit of the proposed method. Actually the empirical performance of the proposed method has only a small margin compared with the GAT, on the three node classification benchmark datasets, where the accuracies are around 80%, the improvement of the best version of the proposed methods is only around 0.3%, 0.7%, and 0.1%, respectively. This is somehow predictable since the proposed method does not exploit any extra useful information (such as graph structure) but simply base the new parameters on the existing components of the GCN message passing procedure. \n\nThe motivation of the paper is that the diffusion process on the graph should depend on the nodes’ status and influence (for example, some opinion leader nodes should have an amplified spread than other nodes), while existing GCN dies bit examine such ``difference’’ between the nodes. However, the roles or status of the nodes in a network are usually unavailable in practice; and if they can be ever be inferred, one has to use structural clues, Unfortunately, the extra parameters added here, namely the matrix P, Q, are dependent only on the features of the nodes (namely HW part), but not the graph structures,  therefore I do not think such parametrization would lead to significant benefit in improving the diffusion process. Indeed,  the original Gat method (graph attention network) has already achieved adaptive aggregation of the neighborhood information, by learning an inductive attention function  based on the node features; therefore the authors claim that existing GCN “ignores the difference between nodes” sounds very vague, since their new parameters are not capable enough to reflect “node differences” either (as a function of the node features).\n\nSome minor comments \n(1)\tFigure~1 is not easy to read while it is supposed to visualize the main idea clearly in one picture\n(2)\tIs there proof that if multi-hop version is used, the results can be improved?\n(3)\tWhat is the extra number of parameters compared with the standard GCN message passing？"}