{"title": "Transferring SLU Models in Novel Domains", "review": "Summary: The authors present a network which facilitates cross-domain\nlearning for SLU tasks where the the goal is to resolve intents and\nslots given input utterances. At a high level, the authors argue that\nby fine-tuning a pre-trained version of the network on a small set of\nexamples from a target-domain they can more effectively learn the\ntarget domain than without transfer learning.\n\nFeedback:\n\n* An overall difficulty with the paper is that it is hard to\ndistinguish the authors' contributions from previous works. For\nexample, in Section 3.1, the authors take the model of Goyal et al. as\na starting point but explain only briefly one difference\n(contatenating hidden layers). In Section 3.2 the contributions\nbecomes even harder to disentangle. For example, how does this section\nrelate to other word-embeddings papers cited in this section? Is the\nproposed method a combination of previous works, and if not, what are\nthe core new ideas?\n\n* Some sections are ad-hoc and should be justified/explained\nbetter. For example, the objective, which ultimately determines the\ntrained model behaviour uses a product of experts formulation, yet the\nauthors do not discuss this. Similarly, the overarching message, that\nby fine-tuning a suitable model initialisation using small amounts of\ndata from the target domain is fairly weak as the authors do not\ndetail exactly how the model is fine-tuned. Presumably, given only a\nsmall number of examples, this fine-tuning runs the risk of\noverfitting, unless some form of regularisation is applied, but this\nis not discussed.\n\n* Lastly, there are some curious dips in the plots (e.g., Figure 2 bottom left, Figure 3 top left, bottom left), which deserve more explanation. Additionally, the evaluation section could be improved if the scores were to show error-bars. \n\nMinor: All plots should be modified so they are readable in grey-scale.", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}