{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "\n\n\nThis paper proposes domain adverarial approaches modified to address covariate shift \neven in the case of shifting label distributions. The paper is interesting and the authors\nare looking at an important problem, but the paper suffers several major misconceptions\nand the exposition is full of errors.  \n\nThe paper proposes a method called “self training” to “estimate and align” the  target label distribution\nand a “prototype-based method” for conditional alignment.\n\nThe paper purports to introduce a new problem: “generalized domain adaptation”\nbut actually this is just covariate shift. \nThey confuse the term “label shift” and the colloquial “shifting label distribution”.\nMoreover when they describe the method formally they fail \nto even state the covariate shift assumption (that p(y|x) = q(y|x) ).\nAbsent this statement, the problem is unfdamentally underspecified.\nThey have stated only that p(y) \\neq q(y) and that p(x|y) \\neq q(x|y).\nThus the claimed contribution is to solve an impossible (more accurately, underspecified problem).\n\nThe proposed method leverages a “similarity classifier”\nThe thing that the authors call a similarity-based classifier\nisn’t well explained. It looks like an ad-hoc variation on a standard\nsoftmax prediction layer. \nHere, not that similarity means similarity between x and the label weights w,\nnot similarity between examples and each other.\nMoreover this classifier is trained as a classifier using a \nstandard cross-entropy objective on the target domain.\nThe paper lacks any formal justification for what this is offering\nthat we do not get from a standard classifier.\n\nThe next component of the model is \"Prototype-based Conditional Alignment by Minimax Entropy”\nand it is also confusingly explained.\n\nThe paper attempts to make some reference to the theory of Shai Ben David\nwhich has been badly misapplied in the deep domain papers\n(see discussion by Johannson et al 2019 and Wu et al 2019).\nStrangely, the authors misattribute the theory to Zhao 2019.\n\n\nThere are some nice ideas in the paper and the experimental results \n(flaws in domain adaptation benchmarks notwithstanding)\nappear to be promising.\n\nHowever the paper is written too confusingly, is outright wrong in many places\nand runs the risk of badly misleading readers over even the most basic of definitions.\nI encourage the authors to give the paper a gut rewrite\nand do not believe that it can be published while resembling its current form.\n\n“only aligns the covariate shift”\n>>> \tBe more formal, not clear what it means to “align the shift”\n\tMoreover, note that owing to lack of shared support , it’s not clear \n\twhat precisely the current methods (domain-adversarial) do\n\tor according to what principles they work.\n\n\n“the covariate shift needs to be minimized”\n>>> \tThis is not a coherent way of describing the problem.\n\tThe covariate shift is a property of the data.\n\tYou cannot “minimize the shift”\n\n“label shift (p(y) ̸= q(y))”\n>>> \tActually this is a “shfit in label distribution”. \n\tNote that you can have a shift in label distribution \n\teven under the covariate shift assumption.\n\tLabel shift is the reverse assumption that p(x|y) = q(x|y).\n\n\n“minimizing the label shift”\n>>>\tAgain, this doesn’t make sense. The practitioner doesn’t get to choose the data\n\tthat they will face at test time. The “shift” refers to the data. \n\n\n\"Specifically, we assume p(x|y) ̸= q(x|y) and p(y) ̸= q(y)”\n>>>\tThe problem described in this paper is called Generalized Domain Adaptation”\n\tbut actually it is just “covariate shift” this is not a new problem. \n\tThe use of new terminology for old problems and misapplication of old terminology,\n\te.g. “label shift” make this paper a potential danger to readers \n\twho then will be confused in their subsequent interactions with \n\tthe wider literature on distribution shift.\n\n“These methods have achieved state-of-the- art performance on several domain adaptation benchmarks“\n>>>\tIt’s worth pointing out that benchmark SOTA is a dubious way to assess performance out of sample.\n\tThe point is that in supervised learning you get to know that your target is the same as your source,\n\tso it’s ok to have a whole community smash the validation set and then see if we push the leaderboard on test data\n\tWith domain adaption, the relevant sample size is the number of shifts, no the number of images.\n\tHaving the community pound on 2-3 shifts tells us virtually nothing.\n\n\n\"our approach diminishes covariate and label shift”\n>>>\tAgain this is not the accurate way to describe what you do.\n\tYou attempt to salvage classifier performance under these shifts,\n\tyou cannot “diminish the shift”. \n\n“Recently, Azizzadenesheli et al. (2019b) propose a regularized algorithm to correct shifts in the label distribution by estimating the importance weights using labeled source data and unlabeled target data. Lipton et al. (2018b) introduce a test distribution estimator to detect and correct for label shift.”\n>>>\tThis is not exactly the right characterization of the related work.\n\tThe method proposed by Lipton 2018 is precisely what \n\tAzzizadeneshelli 2019 build upon (by adding a regularizer) \n\n“Conventional domain adaptation approaches … only align marginal feature distribution”\n>>>\tAgain, the authors speak about “aligning the marginal feature distribution”,\n\tbut this is confusing, Representations are aligned, not features.\n\t\n\n“This motivates us to align the conditional feature distribution, i.e. p(x|y) and q(x|y)”\n>>>\tAgain these are not things that can be “aligned”. They are properties of the data.\n\tThe entire paper needs to be re-written to be semantically coherent."}