{"title": "Need  justification of privacy", "review": "The privacy definition employed in this work is problematic. The authors claim that \"Privacy can be quantified by the difficulty of reconstructing raw data via a generative model\". This is not justified sufficiently. Why larger reconstruction error achieves stronger privacy protection? I could not find any formal relationship between reconstruction error and privacy. \n\nThe proposed method is not appropriately compared with the other methods in experiments.  In Fig. 3 the author claim that the proposed method dominates the other methods in terms of privacy and utility but this is not correct. At the specific point that the proposed method is evaluated with MNIST and Sound, it achieves better utility and better \"privacy\". However, the Pareto front of the proposed method is concentrated on a specific point. For example, the proposed method does not achieve high \"privacy\" as \"noisy\" does. In this sense, the proposed method is not comparable with \"noisy\". In my understanding, this concentration occurs because the range of \\lambda is inappropriately set. This kind of regularization parameter should be exponentially varied so that the privacy-utility Pareto front covers a wide range. \n\n--\nMinor:\nIn Eq. 1, the utility is evaluated as the probability Yi=Yi'. What randomness is considered in this probability?\nIn Eq 2, privacy is defined as maxmin of |Ii - Ii'|. Do you mean privacy guaranteed by the proposed method is different for each data? This should be defined as expectation over T or max over T. \n\nIn page 4. \"The reason we choose this specific architecture is that an exactly reversed mode is intuitively the mode powerful adversarial against the Encoder.\" I could not find any justification for this setting. Why \"exactly reversed mode\" can be the most powerful adversary? What is an exactly reversed mode?\n\nMinimization of Eq. 3 and Eq. 4 contradict each other and the objective function does not converge obviously. The resulting model would thus be highly affected by the setting of n and k.  How can you choose k and n?", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}