{"title": "Misleading claims and unjustified assumptions", "review": "The authors proposed a family of ODEs and claim the ODEs’ straightforward discretization generates Nesterov’s AGD method. They also claim to prove convergence with discrete Lyapunov equations. The continuous ODE design seems interesting but it is not clear to me how it could be useful/insightful.\n\nOne broken link in the paper's argument is that the discretized algorithms provided in the paper are not straight-forward discretization of the continuous ODEs. For example, at the top of page 4, the (FE-SC) algorithm is not a discretization of (1st-ODE-SC) because the usage of variable y as an interpolation between v and x. However, no discretization scheme would make such a choice. Hence, such discretization is not straightforward without back engineering from Nesterov’s method and do coefficient matching. Further, it’s not clear whether the continuous limit of the discretized algorithm corresponds to the original ODE. Same argument applies to all cases.\n\nAnother problem is that the Lyapunov type of proof is not generalizable. In other word, it’s not easier to come up with them compared to known proof techniques (e.g. estimated sequence, Ashia’s Lyapunov paper, Gupta’s potential function approach). Consequently, the significance of proving a known theory in this particular way is not clear to me.\n\nLast, the stochastic algorithms proved in this paper assumes that the gradient noise go to zero. It might make sense to prove that gradient noise go to zero (by noise proporitional to sub optimality/distance to optimal etc) and use that as a lemma in proving main theorem. However, simply assuming noise go to zero basically means any convergent deterministic algorithm will converge.\n\nIn summary, this paper has some interesting point, but I failed to understand the significance/impact provided by these claims.", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}