{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "The paper tries to analyze LSTM and GRU through differential equations and proposes an alternative formulation.\n\nI vote to reject this paper. I think the analysis has many flaws and only minor connection to performance of RNNs, and empirically the success is marginal at best.\n\nThe paper main point is based on re-writing the discrete dynamical system as a discrete integration of a ODE.  The way it is formulated in the paper has several flaws.\n First, the mixed timestamp is unnatural for ODEs. if s'=a then the Euler integrator would be s_t=s_{t-1}+h*a_{t-1} not s_t=s_{t-1}+h*a_t (eq.2). \nSecond, the timescales isn't part of the continuous ODE but part of the discrete integration. Integrators with dynamic step size defiantly do exist, but the step size does not depend on the data like in GRU/LSTM but based on approximation accuracy. In any case even if there was a real strong connection, I didn't see \"an illuminating perspective\" from the ODE connection.\n\nDetailed remarks:\n- I didn't get the connection of the Newton-Rapson method and ODEs, as the Newtow-Rapson is an iterative algorithm that has nothing to do with ODEs (or no connection was made in the paper).\n- In 3.4 you claim to do theoretical work and make strong remarks such as \"In other words, LSTMs have the potential to have more equilibrium states\" but I didn't find any support in the work itself. There was not even a clear well defined theorem/claim let alone a proof.\n- Comparing the EINS to LSTM regarding the number of parameters is a bit misleading, as the right comparison is with GRU which is the common \"slim\" alternative.\n- Experimentally the work only shows (table 1+3) very little improvement over LSTM and no comparison to GRUs.\n\n\nMinor remark:\n- In the first sentence, \"difficult to interpret\" is not really related to the paper.\n"}