{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "In this work, the authors proposed an energy-based model (EBM) to capture the conditional distribution P(y|x), where x is the input data and y is the regression target. To train the model, the author used a Monte Carlo importance sampling strategy. The proposed method has been evaluated on several standard tasks and achieved convincing numerical results. \n\nThe following are some detailed comments:\n\n1. Once the method is trained, to get the optimal y given x, the author used gradient descent. I found this a little problematic since the energy landscape is not convex in general. As a result, several tasks are evaluated based on an initialization from the baseline and use DCTD for refinement. So I'm convinced that the model behaves well close to the optimal point. However, I think one necessary experiment is to use a sampling method and start from a random initialization to evaluate the energy landscape in a larger range. \n\n2. The introduction & background is well written, personally I enjoy reading them. But I suggest making it more compact for a conference paper since the technical material of this paper only starts to appear on page 4. \n\n3. I feel the proposed method heavily depends on that the task y to perform is low dimensional since the importance sampling method only handles a low dimensional space. How well does this model behave for a high dimensional regression task?\n\nOverall, I think the idea is interesting and clean and the work is certainly valuable. If the authors can address some of these comments, it should be considered for publishing."}