{"title": "Interesting model, but results are not convincing", "review": "This paper proposes an unsupervised model for grammar induction by drawing an analogy between a tree-like anto-encoder and the computation from the inside-outside algorithm. The claimed novelty of the proposed model are two-fold: (1) it can extract syntactic information with any supervision or downstream task; (2) it can build representations for internal constituents that obey syntactic and semantic regularities. Although this is an interesting work, the experimental results are not convincing enough to support the claims, especially the second one.\n\nBefore giving my comments on the experiments, here are the ones for the technical content\n\n- It was a little surprise to me that the inside vectors in the training objective are only from word level. In this case, the whole training signal seems to be biased to the outside part. Therefore, I am wondering whether the inside part (compat and compose functions) can get sufficiently trained.\n- It is interesting to see that this work directly employs the CKY parsing without any justification, since the way of computing scores in the proposed model is not \"context-free\". Besides, it is not clear to me what the last sentence in section 2.3 means?\n\n\nAbout experiments\n\n- In section 3.1, there are two depth columns in table 2, which are not discussed in this paper.\n- In section 3.2, is there any explanation about the mixed results? For example, why DIORA performs better then PRPN-UP on VP but worse on NP?\n- In section 3.3, (1) why choose the tasks of CoNLL 2000 and CoNLL 2012? (2) how to obtain phrase representations? From inside vectors, outside vectors or their mixtures? (3) results in table 4 seems not convincing about DIORA can capture some syntactic and semantic regularities. Or how should we understand the results?\n\nAdditional comments:\n\n- W_in in equation (1), S^in in equation (5) and S^out in equation (12) is left unexplained\n- Eq. 6 has a typo\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}