{"title": "Interesting idea, missing related work, missing results discussion and overall poor presentation", "review": "The paper explores the very interesting and relevant problem of universal node representation.  It points out that although powerful models for representation learning on graphs exists, most existing works require to pre-define a pairwise node similarity or to specify model parameters. Hence, the authors propose a novel model that doesn’t require to pre-define neighbors nor to specify the dependence form between each node and its neighbors.\n\n\nPros:\n- This work studies the important question of universal node embedding model that require minimal user-defined specifications.\n- It proposes an original and novel solution to achieve universal node embedding based on partially permutation invariant function.\n- Provides theoretical guarantee. \n\nCons:\n- Some recent works on structural node embedding are directly related to this work but missing in the related work section: struc2vec [1] and GraphWave [2].\n- In the experiment section, it would be necessary to provide the values of the tuned hyper-parameters for each model for reproducibility. \n- The results are not really analysed nor discussed beyond noticing that P^2IR performs better than other models in most cases. For instance, the authors don't discuss the complexity of the different models, or don’t give intuition as to whether the improvements are significant.  \n- It would be relevant to include some node embeddings models (such as [1,2]) in the baseline methods as they have been shown to outperform node2vec/deepwalk in some classification tasks.\n\nminor comments on the text:\n- on page 2, WFS instead of BFS\n- on page 5, please spell out 'NN function'\n- on page 6, in the last equation characterizing the mapping of node v, it is not clear why the subscript k  in phi_k is there. (similarly for eq. (3) and (4) and subsequent mention of phi). \n- on page 7, Table 1 is useless.\n\n1. Ribeiro, L. F., Saverese, P. H., and Figueiredo, D. R. (2017). Struc2vec: Learning node representations from structural identity\n2. Donnat, C., Zitnik, M., Hallac, D., and Leskovec, J. (2018). Learning structural node embeddings via diffusion wavelets.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}