{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper proposes a consistency regularization method, called AdvMixup, for semi-supervised learning tasks. The approach enforces similar predictions between an unlabeled sample and its neighborhood samples. Each sample of the latter is generated by mixing an adversarial sample and a synthetic sample created by linearly interpolating a real sample pair. \n\nThe paper is easy to follow, and the experiments on both the Cifar10 and SVHN datasets show promising results. Nevertheless, I consider the idea here is a minor modification of the approach introduced in Verma et al., 2019. Additional, the experimental section is weak in its current form. \n\nMain Remarks:\n\n1. The proposed AdvMixup is very similar to ICT as introduced in Verma et al., 2019, where the neighborhood samples are created by interpolating a pair of real samples. In addition, the experimental results as shown in the last two columns of Table 2 for the SVHN data set indicate that the improvement of AdvMixup over the ICT method is less than 1%. Similar patterns can be seen in Table1 for the CIFAR10 dataset. In this sense, I consider the proposed AdvMixup approach has limited technical novelty and with minor improvement over the exist methods. \n\n2. The proposed method is evaluated on two small, easy image tasks, namely CIFAER10 and SVHN, using a 13-layer CNN. Experiments on a variety of data sets such as CIFAR100, ImageNet, and MNIST and with some other network architectures such as DenseNet and  wideResNet could significantly improve the quality of the paper. \n\n3. The way the synthetic samples are created in the proposed AdvMixup approach seems a bit similar to that of the 3-fold Mixup as discussed in Guo et al. 2019 (Mixup as Locally Linear Out-Of-Manifold Regularization), where a synthetic sample is created by interpolating three real samples. Ideally, using a 3-fold Mixup as the comparison baseline for evaluating the AdvMixup makes more sense to me.  \n"}