{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper focuses on the super-resolution (SR) task: to get better super-resolution images from compressed JPG inputs. They propose a two-stage pipeline to first recover the details that were lost during the compression of low-quality JPG images (called as JPG recovering), second to generate SR with satisfactory visual quality (called as SR generating). Finally, they added a hybrid loss function to support an integrated model and the results of their experiments showed good SR generation. \n\nMy decision is weak accept, considering the below aspects. \nPositive points: (1) Recovering model methodology is quite novel compared to traditional noise- elimination-based approaches. (2) Experimental results showed better results compared to state-of-the-art methods. Cycle loss seems to be working well. Also, visualizations in the appendix showed better SR generation. (3) The paper is well organized.\n\nFor the experiments, the following should be addressed:\n1.\tCould you explain what does it mean, “Our model is trained over 1 × 10^3 times until reaching its convergence in training settings.”\n2.\t“In order to remove ring, checkerboard effects, as well as other noise, the former half sub-model is trained with pre-processed C-JPG LR images as inputs.” May I know preprocessing is employed here?\n3.\tCan you provide further explanations to statements in 4.2.1, 4.2.2? - “The huge difference in supervised information leads to large variance among middle layers, which represent ideal details serving the final SR model.”, “Denoising only makes these C-JPG inputs clearer, while recovering brings accurate information to C-JPG images.” are there any empirical results to support these statements”\n"}