{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper presents an interesting use of a knockoff framework similar to that of model-X knockoffs (Candes et al., 2018) in generative models like VAE and GPLVM for feature selection in supervised learning. \n\nOn the flip side, it is really hard to tell from the experimental results (Fig. 2) what performance benefits their proposed designs bring over the state of the art. I would encourage the authors to provide a more detailed analysis of the conditions under which their proposed designs would outperform the state of the art (or not). The author should consider presenting their results through other means that can better highlight the performance benefits of their proposed designs.\n\nBesides applying their knockoff designs to a softmax classifier, can the authors provide examples of applications to other supervised learning models?\n \n\nProof of Lemma 1: Without further assumptions from that stated in the lemma, can the authors provide a derivation (or result that they've used) and explanation for the mean vector and covariance matrix of the joint probability p(z,x_n|x_{−n}) = p(z|x)p(x_n|x_{−n})? In particular, why are z and x_n conditionally independent given x_{-n}, as reflected in their zero covariance value?\n\n\nPage 2: The authors say that \"they must be independent from the labels to be predicted\". Shouldn't it be conditionally independent (2nd paragraph, page 3) instead?\n\n\n\nMinor issues\nPage 5: The notation of tilde{bold{x}}_n is ambiguous since the subscript is used to index the data sample (page 2). Is it intended to be without a bold?\n\nStep 3 of Algorithm 1: I would have preferred that it is stated consistently with that in the main text (step i in 2nd paragraph of Section 3).\n\nPage 5: This sentence is difficult to parse: \"the training dataset for the generative models used to compute new knockoffs sample values is trained over the original data samples\".\n\nPage 5: SInce?\n\nPage 6: I cannot find Figure 1(g) and Figure 1(h)."}