{"title": "This paper proposes a framework to fully utilize the training data for zero/few-shot learning. The improvement is notable and the motivation for few-shot learning is great. The reference needs improvement.", "review": "## There seems to be no response by the authors. Thus, my score stands unchanged. ##\n\n\nPros:\n\n1) The paper points out the issue of learning feature extractor in existing few-shot learning. Such an observation is crucial and the proposed method leads to significant improvement. The authors also include the ablation studies w/ and w/o training features using the dataset-wise information to support the claim.\n\nCons:\n\n1) While the authors tend to sell the idea for both zero-shot (ZSL) and few-shot learning, the novelty to ZSL is actually much small. First of all, the features are pre-trained from ImageNet, so the episode-based issue is not applied. Second, learning a mapping from attributes to classifier weights have already been proposed but not cited or discussed at all. The authors should compare to them and adjust the claim.\n\nJimmy Ba et al., \"Predicting deep zero-shot convolutional neural networks using textual descriptions,\" CVPR 2015\nXiaolong Wang et al., \"Zero-shot Recognition via Semantic Embeddings and Knowledge Graphs,\" CVPR 2018\n(Changpinyo et al., 2016)\n\nThird, the issue of generalized ZSL is raised in the following paper, not in (Romera-Paredes 2015). The following paper has also pointed out a framework for zero-shot and few-shot learning similar to what the paper proposed.\n\nWei-Lun Chao et al., \"An empirical study and analysis of generalized zero-shot learning for object recognition in the wild,\" ECCV, 2016\n\n2) Some implementation details seem to be missing:\n2-1) What is the architecture of g_\\phi? for both ZSL and FSL.\n2-2) Do the authors fine-tune the resnet features for ZSL?\n2-3) Do the authors use the same architecture of f_\\theta as other methods in Table 3? If not, the comparison might be unfair. The authors should explicitly point out what architectures have been used for different methods.\n2-4) The authors should include Ours with episode-based training in Table 3.\n\n3) Improvement on ZSL needs more analysis. Specifically, many zero-shot learning methods do not use the training procedure mentioned in Section 4.1. The authors should thus compare the proposed method/architecture w/o this training procedure to show the difference. This study would benefit the ZSL community.\n\nOther comments:\nI would suggest the authors focusing on FSL.", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}