{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This paper proposes to analyze the loss of neural networks in the Fourier domain. Since this is computationally expensive for larger-dimensional datasets, the analysis instead first projects the data onto the principal component of the data, and then using a Gaussian kernel estimation (which has nice properties in the Fourier domain). The analysis finds that DNNs tend to learn low-frequency components before high-frequency ones.\n\nOverall I quite like the analysis of this paper. I think it could be clearer and contain more experiments but it is otherwise rather convincing proof that DNNs learn low-frequency patterns first.\n\n\n- More experiments: in particular, analyzing this phenomenon over more than a single principal component or through non-linear transformations of the data.\n- It's not always clear how $\\mathbf{k}$ is calculated or where it comes from, whether it is implicit through the Gaussian metric or chosen randomly. The paper would benefit from always making this clear in the text and figure captions.\n- It's well known that different optimizers seem to learn differently both in terms of speed and features that end up being learned (thus generalization), repeating this analysis for Adam, RMSprop & friends would be great.\n\nThe paper is mostly easy to read, but there are a few mistakes here and there that slow down reading. Here are a few:\n- \"variation problems\" you mean \"variational\"?\n- \"This difference implicates\" -> \"implies\"\n- \"by the Parseval's theorem\" -> \"by Parseval's theorem\" (occurs multiple times)\n- \"difference of\" -> \"difference between\"\n- \"in previous section\" -> \"in the previous section\"\n- \"to verify F-Principle\" -> \"to verify the F-Principle\""}