{"title": "Interesting well done paper", "review": "Following the suggested rubric:\n1. Briefly establish your personal expertise in the field of the paper.\n2. Concisely summarize the contributions of the paper.\n3. Evaluate the quality and composition of the work.\n4. Place the work in context of prior work, and evaluate this work's novelty.\n5. Provide critique of each theorem or experiment that is relevant to your judgment of the paper's novelty and quality.\n6. Provide a summary judgment if the work is significant and of interest to the community.\n\n1.  I work at the intersection of machine learning and biological vision\nand have worked on modeling word representations.\n\n2. This paper develops a new representation system for object\nrepresentations from training on data collected from odd-one-out human\njudgements of images.  The vector representation for objects is\ndesigned to be sparse and low dimensional (and ends up being about\n49D).  Similarity is measured by dot products in the space and\nprobabilities of which pair of items will be paired are modeled as the\nexponential of the similarity.\n\n\n3,5  The resulting embedding\tdoes a good job\tof predicting human similarity\njudgements and seems to cover similar features to those named by\nhumans.  They also explain typicality judgements and cluster semantic\ncategories well.   The creation of the upper limit based on noise between \nand within subjects was a nice addition.\n\n\n4. Some relevant related work is discussed and this seems like a novel\nand interesting contribution.  The authors might also want to compare\nto similar work that looked at similarities among triplets (Similarity\nComparisons for Interactive Fine-Grained Categorization\nhttp://ttic.uchicago.edu/~smaji/papers/similarity-cvpr14.pdf;\nConditional Similarity Networks https://arxiv.org/abs/1603.07810 ).\n\n\n6. While this paper is not especially surprising or ground breaking, the\nnumber and quality of the comparisons make it a worthwhile\ncontribution and the resulting embeddings are worth further exploration\nand could be very useful for future research.\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}