{"title": "Behavioral experiment on human representations - Manuscript has improved -revison", "review": "This is a paper that communicates a large scale experiment on human object/semantic representations and a model of such representations.   The experiment could have been more carefully controlled (and described in the paper) and the modeling work is inconclusive.\n\nQuality, \nThe experiment design is conventional, based on rating pair-wise similarity among triplets. Compared to earlier experiments, this data has more objects and more triplets.  Additional control experiments on smaller subsets have been carried out to further address hypotheses.  The description of the experiment could have been more careful: What are the precise instructions, how are the object/images presented (it is well known that relative positions, asymmetry, etc can play an important role), are there any temporal/learning effects (how clear is the task to the workers?).\nThe modeling work is basic and contains a number of steps that have unknown influence on the final outcome. For example model dimension: Is you claim that \"D=49\" is a law of human nature?  Model predictive performance seems excellent, that is interesting! But we do not know how robust this is to the many heuristics\n\nClarity, \nThe presentation of the inference process is clear. Not so clear what the uncertainties are\n\nOriginality \nLimited. Mainly related to scale. But the data quality is unclear. The modeling approach involves a number of untested heuristics (non-negative, exponentiation etc). \n\nSignificance \nMostly related to the data.  I did not understand if it is planned to release the data.\n\nPros and cons \n\n+Large scale experiment\n+simple model, seem to have good accuracy\n\n-experiment needs more careful description\n-too many heuristics in model and inference, unclear how general the conclusions are\n\nOther comments:\nReferences have many issues\n\nThe authors have done a good job in the revision and have clarified points that were unclear in the first version. \nI have remaining reservations on significance, but move rating up a notch to reflect the extensive improvements and  the authors' confirmation that they will release the data.\n\n\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}