{"title": "Interesting paper, Inspiring theory, but need more experiments", "review": "[Summary]\n\nThis paper proposes a differentiable framework to learn to augment data for image classification. In particular, it uses spatial transformer and GANs as parametric data augmenters, and it formulates the validation set loss with respect to the data augmenter in a differentiable manner. \n\n[Pros]\n\n1.\tThe proposed method does not require many trials of model training under different training data, and it learns the data augmentation directly using the final classification objective.\n2.\tIt is inspiring to extend the differentiable form of influence function across the training and validation set and then across the original and augmented data. This paper also makes use of the most recent related advance to enable stochastic learning. The theory of the paper is nice.\n3.\tThe experimental results on MNIST (with less labeled data) and Cifar-10 are encouraging.\n\n[Cons]\n\n1.\tExperimental results can be stronger. Especially when compared to Ratner et al., this proposed method results in marginal performance gain. Given that Ratner et al.’s method trained the data augmentation module without supervision, the supervised learning in this paper does not show strong results. In addition, the paper did not report results on a more practical dataset (such ImageNet and Places). Even for Cifar-10, the reported numbers are away from the state-of-the-art. It is important to show the practical significance of the proposed method.\n2.\tData augmentation is naturally expected to be random, but the proposed method seems to learn a deterministic parameter for the augmenting transformation, which looks unnatural and limited. (Please clarify if I missed anything.) \n3.\tThe proposed method requires a parametric model (e.g, STN, GAN). However, differentiable parametric models are not always easy to design. This probably can be the biggest obstacle to apply the proposed method widely.\n\nOverall, the proposed method is very interesting. However, the experimental results are limited, and more discussions are needed. \n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}