{"title": "Promising idea that requires substantial improvement in analysis and presentation", "review": "The authors conjecture that convolutional downsampling is an underlying mechanism behind sample memorization in over-parameterized convolutional autoencoders. They claim that this effect leads the system to converge to a low-rank solution in contrast to the theoretically possible identity mapping. They support their claim with numerical experiments on linear and non-linear convolution autoencoders.\n\nStrengths:\n- The authors develop their idea in close connection to commonly used architectures.\n\nWeaknesses:\n- The main statements concern the architecture; however, the experiments do not account for the many confounding factors such as initialization or the chosen optimizer. The paper itself states on page 4 that the results depend on the initialization and cite Gunasekar et al. in the conclusion for an analogy, which, however, explores the implicit regularization effect of a gradient descent optimizer.\n- There is no clear and proved statement despite the suggestive mathematical nature of the writing (Conjecture, Proposition). The claimed 'proof' of the Proposition is conducted via experiment. In light of the above mentioned confounding factors, the current phrasing of the Proposition will not allow a formal proof as it is unclear what the system 'linear Network DS' even is.\n- The boundary between conjectured and inferred statements is very vague. For example, the meaning of  'prefers to learn a point map' is unclear.\n\nOverall, the exposition is insufficient in supporting the conjectured effect. The methodology could be strengthened in two directions:\n1) experimentally: designing numerical experiments that exclude confounding factors and surface the conjectured effect\n2) theoretically: abstracting the idea into a clear mathematical statement that can be proved\n\nI encourage the authors to extend their work for submission to a future venue.", "rating": "3: Clear rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}