{"rating": "8: Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper studies the problem of detecting outliers using generative models (specifically VAEs) in the detail and describes the condition in which VAEs can be used for outlier detection. The paper is well-written and has a very detailed description of its claims. \n\nI found the paper insightful and clear overall, and I believe we need more papers like this in the area of deep generative models. I have some questions and comments which I think addressing them can increase the impact of the paper:\n\n- The interaction between the encoder/decoder seems to be important based on the latest papers in this area and just assuming “that the encoder network maintains sufficient complexity to produce a reasonably tight variational bound given the decoder” may not be enough for making conclusions about VAEs (see for instance “Tighter Variational Bounds are Not Necessarily Better” by Rainforth et al. 2019). Are there any experiments that you can add to show the robustness of your results with respect to the encoder network. \n- It was mentioned that for choosing the right capacity “it can be increased until there is a significant gap between train and test NLL values on the inlier data”; however, this was not shown in the experiments. Can you add the columns in Table 1 and Table 2 that after some point there will be a gap between the train and test NLL? \n- The current version of the paper seems to be ended abruptly and without any summarization of the contributions, it would be nice to have a discussion/conclusion section which discusses the main assumptions and limitations of the arguments in the paper. "}