{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "Summary:\n\nThe paper proposes to evaluate 9 different pooling function to replace the global average pooling in the fine-grained classification domain, and reveals that max-pooling out-performs average pooling.\n\nThe technical novelty of this paper is trivial. By using the known pooling function. However, it is uncertain to me if the survey paper is necessary in this domain, since the best results achieving via their study, is inferior to the state-of-the-arts bilinear pooling. Paper is composed in a poor, informal, oral-spoken manner. Related work is heavily mixed with introduction and make decipher the core contribution hard.\n\nThe major concern about this paper is lacking novelty and impact on this field. Only evaluating some known operations on some datasets is insufficient for a conference paper. In addition, recent work based on bilinear pooling [1] yields 88.0% accuracy with ResNet-50, which is significantly higher than the ones in Table 1. \n\nThe only interesting is about the visualization in Figure 1, showing max-pooling focus more on the local details on one given example. However, only one qualitative example is not enough, CUB dataset includes the partial bounding box, I suggest author further compute some numerical metrics based on the location information and extend to all the state-of-the-art global pooling methods. \n\n\nStrength:\n+ Good visualization in Figure 1.\n+ Discrete entropy is reasonable.\n\nWeakness:\n- Trivial technical novelty.\n- 9 evaluated methods are not the current interest in the research field. best results are much lower than the state-of-the-art. \n- Writing is not in good shape and hindering to grasp the main contribution.\n"}