{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "Paper contributions\n=================\n- This paper proposes a method for constructing representations using a matrix of Wasserstein distances. These distances measure the discrepancy between each class and each environment, that is a random combination of some classes.\n- The paper evaluates this approach on a task of image retrieval.\n\nGeneral notes\n============\nThe general idea of measuring the distribution divergence for a set of classes is interesting and seems to be novel. But I argue that this representation can be limiting:\n- A set of divergences doesn't contain any pixel-level information, only divergences to some predefined classes\n- As a consequence, this representation will not be able to discover information that is not covered by the labels\nBecause of these limitations, it seems that this particular representation may be less useful for some applications than others.\n\nI don't follow why the paper proposes to use 'environments'  -- random combinations of classes. It seems that a square matrix (n_c x n_c) with all classes should do the same job.\n\nThe experimentation is very weak and does very little to support the claims. The paper considers only one substantial task to test the representation. This task is image retrieval by image query. The paper doesn't provide any comparison to existing methods or simple baselines.\n\nThe second contribution that the representations are interpretable and composable is not addressed.  I seems that it should be hard to interpret a large vector of distances to randomly chosen subsets of classes. There is no experiment demonstrating interpretability of the proposed approach. The compositionality is not addressed either. The samples provided in the appendix are not convincing.\n\nThe paper is generally well written and it is easy to follow. The literature review can be improved by providing prior work where \"approaches use hidden state vector of LSTM\" and \"features extracted from CNNs\" instead of generic references. \n\nSome of the claims are vague and excessively broad:\n- The proposed technique can be used with any task, but the paper is clearly limited to the retrieval task\n- The environments are too vaguely described and can be misinterpreted in the introduction\n\nConclusion\n=========\n\nI recommend to reject on the basis that \n- the approach is more limited than the paper advocates\n- the experimentation is weak\n- some claims are not addressed\n\nOther notes\n==========\nI recommend using term divergence instead of distance when it is not symmetrical."}