{"title": "a paper with a good potential but difficult to read and missing recent baselines", "review": "This paper deals with the difficult problem of novelty recognition which is the core issue in open set learning and generalized zero-shot learning. Indeed a method able to separate samples between known and unknown domains in these settings would clearly indicate the direction for their solution. The idea proposed here consists in starting from the extreme value theory and then using bootstrapping to model the confidence score for a sample of belonging or not to a certain class. Through a probabilistic evaluation (based on K-S test) on the trustworthy of each category classifiers, the domain separation is extended to consider also an uncertain domain and the separation threshold is progressively refined. Once the domains are separated, classification can be performed disjointly in each of them.\n\n+ Having a way to define known/unknown and uncertain samples on the basis of which one can\nthen proceed to solve OSL and GZSL sounds as a very effective strategy. Moreover, all the parts of the method are \nbased on reliable probabilistic principles.\n \n- Unfortunately the text is not easy to read. There are several repetitions and disordered lists (same numbers used multiple times or mixing names and numbers for the items) which distract the reader. As a side note, it would be better to avoid mentioning dataset names without their description and definition ('aPY' appears out of the blue in the introduction). \n\n- The experiments extends over different datasets and the ablation study is valuable. However to understand how the proposed method advances over the current state of the art it is important to consider and discuss the most recent publications  on OSL and GZSL. See for instance\nOpen Set Learning with Counterfactual Images, ECCV 2018\nFeature Generating Networks for Zero-Shot Learning, CVPR 2018\n\n\n\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}