{"title": "Interesting observation and dataset, but more analysis would be necessary", "review": "Summary\nThis paper studied video classification and video caption generation problem.\nEspecially, the paper tried few baseline architectures datasets used from pretraining features on recently proposed Something-something-V2 dataset and another newly proposed dataset.\nThis paper argues that fine-grained annotation helps learning good features and enhance transfer learning results\n\nStrength\nThere are some interesting observations in terms of transfer learning.\nEspecially, comparison of fine-grained and coarse-grained dataset for transfer learning (Table 2), and effect of using caption and newly collected dataset for transfer learning (Figure 5) is interesting and the result is worth to be shared to the community.\nIn addition, a new dataset that are carefully collected for transfer learning might be useful to make progress on video classification and captioning.\n\nWeakness\nTo many tables with different neural network parameter settings look distracting and does not provide much information. Instead, focusing more on effect of dataset for transfer learning and providing more analysis on this aspect would make the main argument of this paper stronger.\nFor example, effect of transfer could be studied on different dataset. If transfer learning with proposed dataset containing find-grained annotation / captions is useful, it might help boosting performance on other video recognition dataset as well.\nProviding analysis on understanding the effect of fine-grained / captioning dataset for feature learning might help understanding as well.\n\nOverall rating\nThis paper suggest interesting observations and useful dataset, but provides relatively less analysis on these observations. I believe providing more analysis on the dataset and effect of transfer would make the main argument of this paper stronger.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}