{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper proposes a new task for text style transfer, based on the idea that the the surrounding context of a sentence is important, whereas previous such tasks have only looked at sentences in isolation. Two new crowd-sourced datasets are created, and a combination of now fairly standard neural components is shown to outperform some strong baselines on the new datasets, on a variety of evaluation metrics. An ablation analysis of the components - including some auto-encoding auxiliary losses  - shows that all the various parts are helpful to performance.\n\nOverall I don't see a lot wrong with the technical content of the paper, and it is well-written and easy to understand. I also feel that the collection of the data is a contribution, and this could be a useful dataset to the community. But the main problems I have with the current version - and the reason I am unable to recommend acceptance as it stands - are twofold:\n\n1) the task doesn't make a lot of sense to me. If I have a paragraph written in a particular style, e.g. Shakespearean (an example in the paper), why would I want to rewrite a single sentence in e.g. modern English? Likewise, if I have a paragraph that's largely negative in sentiment (assuming for now this is a kind of style; see below), why would I want to change one of the sentences to a positive sentiment? I can understand why I might want to take a whole paragraph, or document, and rewrite it in another style, but not a sentence in isolation. Now it may be that the proposed method could be used consecutively to rewrite a larger unit, but it's not obvious how that would work and it needs some discussion.\n\n2) it's not clear to me what is meant by \"style\" in this paper. No definition is provided, and the authors rely on references to previous papers and various examples throughout the paper for the reader to grasp what is meant here. Examples include: informal/formal, offensive/inoffensive, Shakespearean, sentiment, political slant. The first three look fine as examples of style; the latter two I'm not sure, since they are likely to change the semantic content. A minor point related to this one is that in the Text Style Transfer related work subsection, there's even a reference to an MT paper as an example.\n\nHaving said all that, I think the new corpus could potentially be a useful resource (assuming the authors can utilise it for a meaningful task). I would have liked to see more details of how the corpus was collected. Putting the style guidelines in an Appendix would be a possibility. But more details could be given in section 4, for example: how are the offensive sentences identified? (which classifier?) How did you manually remove wrong annotations, and what does wrong mean here? (presumably not by checking all 14k examples?) \n"}