{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "Summary:\n\nThe paper discusses relational reasoning for visual question answering, e.g. encode image-region-pairs conditioned on relevancy to question.  The paper approach is novel: The use of FiLM architecture to condition relevancy to question. The decoding is done using a multi-step graph reasoning directly pooled from the graphs. The model is evaluated on several datasets (e.g., GQA, CLEVR, VQA-CP)\n\n\nStrengths: \n\n    1. The model is novel. Although follows  Norcliffe-Brown et. al.; The proposed approach adds a multi-step graph reasoning and also replaces the idea of attention mechanism for question conditioning with FiLM. \n\n    2.  Evaluation includes major datasets. Model achieves SOTA performance in VQA-CP,  and performs well in other major datasets, e.g. GQA and CLEVR.\n\n\nWeakness: \n1. I find it peculiar to not include VQA2.0 dataset. \n2. Ablation study is  weak, several new concepts are proposed, but there is no ablation analysis. Does FiLM is the best approach for conditioning over a graph? How is it compared to attention, or other types of Hypernetworks? Does the old approach of graph as image representation is wrong? Currently,  it’s not clear what is the direct cause for performance boost on VQA-CP for instance.\n3. Qualitative evaluation is extremely important for this type of paper, observing differences between question-condition techniques. Here it is completely missing.\n\n \nTo conclude: The proposed architecture is intuitive, and more dependent  on  the relation graph. Unfortunately a good study is missing (e.g., ablation/qualitative), which lowers the quality of the paper.  \n\n\nTypos:  espressive -> expressive , also in the end of the paragraph the Section missing a number.\n"}