{"title": "Paper contains only little novelty and the experiments are not sufficiently thorough", "review": "The paper shows that Bayesian neural networks, trained with Dropout MC (Gal et al.) struggle to fully capture the posterior distribution of the weights.\nThis leads to over-confident predictions which is problematic particularly in an active learning scenario.\nTo prevent this behavior, the paper proposes to combine multiple Bayesian neural networks, independently trained with Dropout MC, to an ensemble.\nThe proposed method achieves better uncertainty estimates than a single Bayesian neural networks model and improves upon the baseline in an active learning setting for image classification.\n\n\nThe paper addresses active deep learning which is certainly an interesting research direction since in practice, labeled data is notoriously scarce. \n\nHowever, the paper contains only little novelty and does not provide sufficiently new scientific insights.\nIt is well known from the literature that combining multiply neural networks to an ensemble leads to better performance and uncertainty estimates.\nFor instance, Lakshminarayanan et al.[1] showed that Dropout MC can produce overconfident wrong prediction and, by simply averaging prediction over multiple models, one achieves better performance and confidence scores. Also, Huand et al. [2] showed that by taking different snapshots of the same network at different timesteps performance improves.\nIt would also be great if the paper could related to other existing work that uses Bayesian neural networks in an active learning setting such as Bayesian optimization [3, 4] or Bandits[5].\n\n\nAnother weakness of the paper is that the empirical evaluation is not sufficiently rigorous: \n\n1) Besides an comparison to the work by Lakshminarayanan et. al, I would also like to have seen a comparison to other existing Bayesian neural network approaches such as stochastic gradient Markov-Chain Monte-Carlo methods.\n\n 2) To provide a better understanding of the paper, it would also be interesting to see how sensitive it is with respect to the ensemble size M. \n \n 3) Furthermore, for the experiments only one neural network architecture was considered and it remains an open question, how the presented results translate to other architectures. The same holds for the type of data, since the paper only shows results for image classification benchmarks.\n \n 4) Figure 3: Are the results averaged over multiple independent runs? If so, how many runs did you perform and could you also report confidence intervals? Since all methods are close to each other, it is hard to estimate how significant the difference is.\n \n\n\n\n[1] Simple and Scalable Predictive Uncertainty Estimation using Deep Ensembles\nBalaji Lakshminarayanan, Alexander Pritzel, Charles Blundel\nNIPS 2017\n\n[2] Gao Huang and Yixuan Li and Geoff Pleiss and Zhuang Liu and John E. Hopcroft and Kilian Q. Weinberger\n    Snapshot Ensembles: Train 1, get {M} for free}\n    ICLR 2017\n\n[3] Bayesian Optimization with Robust Bayesian Neural Networks\n    J. Springenberg and A. Klein and S.Falkner and F. Hutter\n    NIPS 2016\n \n[4] J. Snoek and O. Rippel and K. Swersky and R. Kiros and N. Satish and N. Sundaram and M. Patwary and Prabhat and R. Adams\n    Scalable Bayesian Optimization Using Deep Neural Networks\n    ICML 2015\n\n[5] Deep Bayesian Bandits Showdown: An Empirical Comparison of Bayesian Deep Networks for Thompson Sampling\n    Carlos Riquelme, George Tucker, Jasper Snoek\n    ICLR 2018", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}