{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This work presents an approach for training policies to generate match plans using reinforcement learning. Match plans are used in search engines to retrieve documents for a given user query. One of the challenging features of this problem is that the action space is a mix of discrete and continuous parameters. This work formulates the task as an RL problem, and proposes a number of design decisions for training an effective policy.\n\nThis paper presents an interesting application of RL, but overall the technical innovation of the method is fairly modest, and mainly consists of different components that are already commonly used in previous work. The writing also has a fair bit of awkward phrasing and grammatical errors that hurt the clarity of the exposition. For these reasons, I do not think this work meets the bar for ICLR in its current form.\n\nMore specific notes:\n\nAs someone who is not familiar with search engines, I have some trouble understanding the concept of a match plan from the description provided in the paper. I’m not sure how the rewrite process works. Perhaps adding more details of this, maybe in the appendix, can help readers better understand the task.\n\nThe captions for the figures are not very informative.\n\nIn Table 2, what is the difference between “prioritized” and “prioritized sample”?\n\nIn Figure 3, it is not clear why it is necessary to show the embedding. Most samples seem to show similar performances and it’s not clear if there is any obvious structure. Perhaps this figure can be simply replaced with a history of performances. While Section 4.2 suggests that some clusters with worse or better performance exists, this is not really evident in the plot itself. I’m also not sure what “We guess the reason is that the baseline with hand-crafted rules do not consider the embeddings, thus it is less affected by embeddings.” means. How does the fact that the baseline does not use the embedding affect any structures in the embedding?\n\nThe paper provides a fairly thorough review of a lot of different design decisions, but perhaps it is not necessary to go into such excruciating details for all of the different components. Some details such as padding short episodes with zeros are probably not vital for the overall narrative. It might be appropriate to relocate some of these details to the appendix."}