{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The paper proposes a cross-lingual data augmentation method to improve the language inference and question answering tasks. The core idea is to replace a port of the input text (such as one of the sentence in a sentence pair in the language inference tasks) with its translation in another language. The authors empirically show that deploying the XLDA data augment improves the baseline methods for both the XNLI language inference data sets and the SQuAD task. \n\nThe paper is generally easy to follow and the experiments show promising results. Nevertheless, I have a concern with the comparison baseline used in the paper, as follows.\n\nThe authors indicate that their work is close to back-translation at the end of the related work section. Also, the authors provide their hypotheses about the possible disadvantages of using back-translation as data augmentation, compared to the proposed work here. However, the authors did not provide experimental studies to support that. To me, the proposed data augmentation strategy is very similar to the back-translation, so I would expect the authors to use that as a comparison baseline in their experimental studies. Without those results, it is difficult to judge the contributions of the proposed approach. \n\nAlso, the paper could be significantly improved if the authors could provide some analysis/observations on why replacing one of the sentences in the sentence pair for the inference tasks helps? In this sense, using some other data augmentation methods as comparison baselines would be very helpful. For example, simply drop some words in the sentence pair. \n\nI found the observations in the paper interesting, but the lack of comparison baselines makes me think the paper in its current form is not ready yet.\n"}