{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #5", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "Summary: This paper demonstrates the importance of labels at various levels (no label, basic level label, and superordinate level) as well as in combination to determine the importance of semantic information in classification problems. They train an identical CNN architecture either as an autoencoder (no labels), with the basic label, with the subordinate label, with the basic and subordinate labels, and with basic labels which are fine-tuned with one-hot encodings of superordinate labels, as well as with word vectors. Classification accuracy, t-SNE, cosine similarity matrices and predictions on a human behavior task are used to evaluate the differences across labels types. The authors find that superordinate labels are helpful and important for classification problems. \n\nMajor comments:\n- Authors need to include more related work and describe the main related paper they mention (Peterson et al 2018) as well as describe how their work fits in with previous work\n- While the idea here is novel and impactful, the experiments used to explain the importance of superordinate labels do have not much compelling information and are not well described\n- 4.2 plots for visualization are mentioned to be in the appendix, but are not there\n\nMinor comments:\n-\tFig2 large subordinate group text would help\n-\tLots of typos throughout and grammar mistakes \no\tTypo ‘use VGG16’ and then ‘Vgg16’ in same paragraph bottom of page 4 \no\tTypo top of page 2 “Convolutional neural network(CNN)”\no\tAppendix list – ‘banna’ typo under Fruit\no\tPage 1 intro ‘for both behavioral and computer vision’ doesn’t really make sense \no\tPage 3 top section ‘new one’ should be ‘new ones’ \no\tBottom of page 3 ‘room from improvement’ \no\tLast line of conclusion – ‘classificacation’\n\nConsensus: This is a very interesting and potentially impactful idea, but the experiments used to defend and explain the importance of superordinate labels are relatively weak. Significant work on writing and experimental side should be complete, but because this is novel and important work for classification, with some serious revisions, I would suggest accepting this paper. \n"}