{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper introduces a new method for Multi-Source Domain Adaptation (MSDA) based on generative adversarial networks (GANs). The proposed method is called TriGAN. The authors assume that the appearance of an image depends on the content, the domain, and the style. Specifically, the proposed method progressively removes the style and domain-specific statistics from the source data. Then it re-projects obtained invariant representation onto the pixel space using the target domain and style.\n\nThis paper should be rejected because (1) the proposed method seems ad-hoc, and (2) the performance gain over another competitive method is marginal.\n\nThis paper assumes that the appearance of an image depends on the content, the domain, and the style. It is not clear whether this assumption is general or not. Evaluations on two datasets (Digits-Five and Office-Caltech10) is not enough to validate this assumption. More evaluations on diverse datasets are required.\n\nIt is unclear what is the unique and intrinsic problems for multi-source domain adaptation (MSDA). The authors should explain why the proposed method can solve those problems. For example, it would be better to mention why three factors are able to reduce the number of learned translations by theory or practice.\n\nIn table 1, the average accuracy of TriGAN is better than M^3SDA. However, M^3SDA wins two categories, whereas TriGAN wins three categories among five categories. In Table 2, the gain of accuracy (TriGAN:97.0%, M^3SDA: 96.4%) is marginal. From these results, it can be said TriGAN is competitive to the SOTA, but it is hard to conclude that TriGAN is better."}