{"title": "Simple idea with interesting results", "review": "The novelty and experiments are somewhat limited. Thus I am lowering my score.\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nThe authors proposed a variant of tensor ring formulation for multi-task learning. They achieved that by sharing some of the TT cores for learning \"common task\" while learning individual TT cores for each separate tasks.\n\nPros:\n1) Overall nice but simple extension of TT/ TR framework\n2) Nice set of experiments which have shown improvement over standard TT/ TR framework for MTL.\n\nCons (and suggestions):\n1) As to my knowledge TT/ TR have not been used for MTL before, I wonder if someone wanted to the proposed method is the only way to achieve it, so in that sense, it's a very \"simple\" extension.\n2) Though authors called something called \"TRL\", I think it is just an indexing scheme so essentially the same idea of TR.\n3) I wonder why authors suddenly mentioned about convolution in the end of section 3.1., looks very out of the place discussion.\n4) I suggest in Section 3.2., make the shareable cores not adjacent in Eq. (4) as they claimed.\n5) The experiments are somewhat \"````````simplistic\" and I believe the power of this sharing should have experimented on Taskonomy data (https://arxiv.org/pdf/1804.08328.pdf). Right now, the experimental setup is very much simplistic, which is one of the main points the authors should address.\n6) Can the authors comment on the number of parameters used?\n7) I wonder if the author can show some RNN/ LSTM experiment because some of the datasets used like OMLIGLOT/ MNIST are too simple to count as an experiment. Challenge will be to see the performance in challenging MTL. \n8) I believe the authors should comment on the choice of c and the location of the shareable cores.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}