{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors propose letting a classification network learn the value of its dilation parameter at a per-pixel-location level. They experiment with different network architectures on dense classification and whole image classification tasks on several standard canonical datasets.\nStrengths:\n- Conditioning dilation on learnable weights is a sound idea, which intuitively makes sense as to why it could offer improvements\n- There is a strong variety of experiments performed\n- PAD kernels are tried on several different architectures, which is good\n- Reporting the negative results at the end of section 4.2 is a strong truthful admission that is rarely done, and we commend the authors for doing this.\nWeaknesses:\n- The approximation of the dilation determining function with a gumbel softmax seems weak. There should not be stochasticity in the dilation value given a fixed pixel input. The choice appears to be made solely because it is differentiable, not because it fits the goal.\n- The assumption of dilation independence within a layer (intralayer as opposed to interlayer) cannot possibly hold. The simplest argument against this: if detecting an OR function of A and B across spatial distance, if the dilation around A increases to include B in its receptive field, B does not need to increase its dilation to include A.\n- The discussion of interpreting feature space through dilation parameters is vague and not rigorously substantiated.\n- The claim about PAD kernels increasing receptive fields for conv5 as opposed to conv3 is confusing, because conv5 has a larger receptive field than conv3 period, regardless of the effect of PAD kernels.\n"}