{"title": "Using convolution in CRFs to increase inference and training time speed", "review": "The paper is well written with many relevant references and easy to read. Some points that need clarification and mentioned below. \nThe main points of this paper are the use of the convolution operator to perform the message passing mean field inference. Using this operation allows us to get away from the permutohedral lattice and yet allows speed up of 100x. This also means, that training will be able to done faster. Besides this the training parameters can also be learnt. These are the main contributions. The denoising task experiment shows positive results. The idea could be used in the future by others looking for faster model inference and training.\n\nIf a Manhattan distance d is used i.e. dx,dy<k in equation (6), why is this a FullCRF? It seems like the new CRF is no longer a fully connected one. \n\nPage 5, first paragraph describing how the reorganization in the GPU is avoided is not very clear. It would be helpful to a reader to have more details and explanations about this.\n\nIt is not clear from the experimental results how much improvement allowing to train the CRF parameters gets or might get. Comparing to the Deeplab results etc for the non-trained case, the non-trained model still seems to be performing competitively. Table 2 of Table 3 does not really bring out the advantage of training. The +C, +T, +CT don't seem to be hugely different in terms of validation metrics. Note that Table 3 does not mention other models that might not be trained (assuming that those results are in Table 2) but the text also mentions that the training is not completely fair.\n\nIn section 5, Unary, it is mentioned that the network is not trained on larger datasets like other work, why?\nAnd under CRF, what does iterations are unrolled mean?\n\nIn section 5.1, why does the random flipping help in simulating inaccuracies?\n\n\nMinor points:\nAbstract: Add space after \"GPUs.\".\nWould be good to define what Q, *, ' indicate in paragraph 4, page 2.\n\"hight\" -> \"height\" in section 4.1\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}