{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors have proposed a GNN implementation that predicts and imitates the motion behaviors from observed swarm trajectory data. I have the following major comments on the paper:\n1. I think the authors should discuss more on the related works. They should clearly mention their contributions and difference compared to the prior works.\n2. What do the authors mean by 'functions universal across all nodes and edges'? Are these same functions for all nodes and edges?\n3. I feel that the section 2.3 explaining 1D convolutions is slightly separated from the previous and following sections.\n4. Why does the proposed GNN model performs better than Kipf's GNN for predicting and imitating the motion behaviors? What is the component that makes the difference?\n5. How does the model depend on the history window length T_w? Also I am curious how does the model depend on the number of GNN layers used?\n6. I am not quite satisfied with provided experimental evaluation of the paper. It is not clear to me why Kipf's GNN does not perform better than the proposed model (which simply aggregates the edge states). Also it would be interesting to try some other GNN models, such as ClusterGCN, GCI etc.\n7. Also I want to see a fair comparison in the paper. If the main contribution is a GNN model, then the model should be compared with the recent GNN models, and if the main contribution is predicting the motion behavior from observed swarm trajectory data, it should be compared with MAS based approaches. While reading the paper, it appeared to me that the authors proposed a graph-based method for solving MAS task and they compared with an old GNN method, which is not justified.\nI also have some minor comments as follows:\n1. In page 1, \"re-finement\" should be \"refinement\"\n2. In page 3, \"... my be found in Battaglia ...\" my should be may.\n3. In page 4, \"... sample rate is affects ...\" should be \"... sample rate affects ...\"\n4. In page 6, \"... a agent ...\" should be \"... an agent ...\"\n5. In page 7, \"... swarms of with larger ...\" either of or with\n6. In page 8, Table 3 ending parenthesis is missing. "}