{"experience_assessment": "I have published in this field for several years.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The authors train RNNs to integrate motion cues, to determine the head direction of a simulated animal. They then investigate the tuning properties of the units in the RNN, and the connectivity between units, and make comparisons to the corresponding systems in the fly and rodent.\n\nSimilarities are quite strong: the RNN learns to reproduce the ring attractor seen in the fly, where head direction (HD) cells excite other HD cells with similar direction preference and inhibit those with dissimilar preference. Shifter cells are also observed, that integrate angular velocity cues and \"shift\" the representation of head direction: these show an intuitive asymmetric connectivity profile. \n\nI can't quite decide what to make of this paper. One the one hand, the recapitulation of the biological circuit in the RNN is fairly compelling. On the other hand, other models (admittedly with hand-tuned connectivity) yield quite similar findings. So my overall opinion comes down to the question of: how big a deal is it that the RNN learned this connectivity, instead of it being designed by a modeller like Xiao-Jing Wang?\n\nI have a few specific suggestions:\n\n1) It would be useful as a comparison to duplicate the analysis of unit tuning, connectivity, etc., in untrained networks. Recent work (arXiv:1909.10116 [q-bio.NC]) shows that, even in untrained randomly-connected RNNs, some units have (by chance) tuning, and that tuning depends on the connectivity between units in a manner that could somewhat resemble the attractor models.\n\n2) There were important details that I couldn't find. For example, how many of the RNN units receive the external inputs? Is it all of them? Is that realistic?\n\n3) I question the approach (first paragraph of Sec. 3.1) of only analyzing the units  with strong HD and/or AV selectivity. Presumably the mouse shows some units with weak tuning, and investigating the connectivity of the weakly-tuned units in the RNN (e.g., their connectivity to each other, and to HD and AV units) could be informative.\n\nOne analysis to consider: ablate the nonselective units after training, and run the RNN with no retraining. Does the head direction tracking function remain intact or degrade? Based on some previous work with feedforward nets (arXiv:1803.06959 [stat.ML]), I'd guess that the function could be seriously degraded by removing nonselective units. That modelling result could make a strong prediction for experiments: inactivation of nonselective neurons (e.g., using archaerhodopsin), would impair function.\n\n"}