{"experience_assessment": "I have published in this field for several years.", "rating": "8: Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper introduces two neural networks, one for average regrets and one for average strategy, to (approximately) run CFR algorithm in (large) IIG. New sampling techniques are used to train these networks to represent the resulting strategy.\n\nI remember seeing this paper in the last year's OpenReview for ICLR - I was not reviewing the paper.\nI enjoyed the first version of the paper, but it was missing experiments on larger games and some questions on smaller games were unanswered.\nIn this version, authors clearly spent a large amount of time (including re-implementing DeepStack!) so that they could compare on large games (namely HU no-limit Poker) and overall greatly improved the paper and evaluation.\n\nThe evaluation on small games includes comparison to NFSP/XFP, as well as investigating time/space trade-off.\nFor the large game, I like that the authors evaluated against an ACPC agent.\nPrevious work is well cited, and authors have a good overall map of related work (both older results and new papers).\n\nIssues:\n\n1) One downside of the paper is that it is very close to the \"Deep Counterfactual Regret Minimization\".\nWhile authors devote a full paragraph in section 6 to contrast these, the difference is relatively small.\nI do not think it is fair to dwell too much on this though, since the first version of the paper with this idea originally came *before* DeepCFR publication!\n\n2) Since the approach is so similar to DeepCFR, it would be nice to include it in comparison (not just NFSP/XFP).\n\n\nMinor details:\n\n- Page 9: \"...which has no limited number of actions, ...\" rephrase please, this sounds like the game is infinite.\n\n- Page 9: \", more abstracted action leads to better strategy...\" more abstracted sounds like it is smaller, rephrase please to something like \"finer grained abstraction\".\n\n- Minor frequent grammatical issues, but does not derail from the flow and semantics of the paper.\n\nConclusion:\n\nOverall, the paper introduces method that is interesting to the community, scales to large games and the paper includes comprehensive evaluation section.\nI believe it should be accepted.\n"}