{"title": "Good paper with great results in interesting environments ", "review": "The paper proposes a control architecture for learning task oriented whole body behaviors  in simulated humanoid robots bootstrapped with motion capture data.\n\nThe authors use a hierarchical approach, where the low-level controllers are trained to follow motion captured data whereas the high-level control combines them. \nThe topic of the paper is interesting and the language is understandable. \n\nThe paper discusses and compares different ways to achieve such a higher level control.\nIt probably won’t be useful for real robots, but will be possibly useful for computer graphics.\nI suspect that code will not be published anytime soon, and I am afraid it will be hard to reproduce without. There is a solid software engineering involved and the system has many parameters.  \n\nThe related work section (or lack thereof) can be improved. What is the advantage of this work over the multi-skill integration in Peng et al 2018? Please explain explicitly in the paper.\n\nThe end-to-end approach seems a bit too weak to me. The video shows more artifacts than other similar papers, (cf. Heess et al. 2017). What’s the detail of the training for the end-to-end baseline?\n\nAre the environments randomized in each rollout? If not then this would need an ablation study which ablates memory/vision to prove its claim of integrating vision and memory. \nHow much is the memory used in the tasks where nothing needs to be memorized?\nIs there any noise in the simulations?\n\nOne weakness is that the low-level controllers are not adapted any further. That is probably why the fragments outperformed the transition policies etc., because the higher level policy has more flexibility.\n\nOverall, from the perspective of deep learning, I think the paper is novel and provides some insights into different approaches to the problem.\n", "rating": "8: Top 50% of accepted papers, clear accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}