{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper focuses on the problem of modeling, predicting and estimating entropy information over continuous-time discrete event processes. Specifically, the paper leverages unifilar HSMM's for model inference and then uses the inferred states to make future predictions. The authors also use inferred model with previously developed techniques for estimating entropy rate. The authors describe the methods and provide the evidence of the effectiveness of their method with experiments on a synthetic dataset.\n\nThe paper should be rejected as it doesn't appear to be fit for this conference. While the paper does build techniques that leverages classical statistical learning and combine them with deep learning, it falls short on various aspects. Specifically, the paper neither provides any rigorous analysis of the developed methods so as to be useful to theoretical learning community nor does it support its approaches with strong empirical evidence so as to be of practical importance. \n\n- While the authors cite lack of work in such data setting (which is actually incorrect as described below), they do not motivate or justify why such an approach of using either unifilar HSMM or Bayesian inference techniques are good starting point to model such information. The authors claim that unifilar HSMM is more of a restriction to make the three proposed tasks easier. But such a model assumption is very strict and will likely lead to large model mis-specification issues when used in real-world. The author does not describe what can be done in this scenario.\n\n- Page2, Section 3: the statistics of {(x_i, t_i)} are unchanging in time. What does this mean?\n- As stated by authors, to make the approach tractable, they have to adopt a slew of approximations which seems to put severe restriction on what kind of data can be modeled and inferred on using these approaches.\n- It is not clear why one wants to estimate the entropy rate in such settings and authors avoid discussing it in Section 4.2\nsimilarly the authors explicitly avoid discussing bias-variance tradeoff of such method, however, this makes the paper\ndevoid of any insights into the proposed approach.\n- How was k chosen to be 3 in Eq 10? \n- Another major miss for the paper is that there has been lot of work at the intersection of stochastic processes (e.g. temporal point processes) and machine learning techniques that aim to model exactly the continuous-time discrete event information and the paper does neither cites any of them nor discusses them or compare with them. We encourage the authors to look at  the relevant literature and position their work in comparison to these existing approaches. I provide a few references here as starting point, however, lot of follow-up work are available:\n\nPoint Processes and Machine Learning:\n------------------------------------\nModeling the Dynamics of Learning Activity on the Web\nSmart Broadcasting: Do You Want to be Seen?, Karimi et. al.\nUncovering the Temporal Dynamics of Diffusion Networks, Gomez-Rodriguez et. al.\n\nHidden semi-markov models:\n-------------------------\nRecurrent Hidden Semi-Markov Model, Dai et. al. \n\nDeep learning and temporal modeling:\n-----------------------------------\nRecurrent Marked Temporal Point Processes: Embedding Event History to Vector, Du et. al.\nThe Neural Hawkes Process: A Neurally Self-Modulating Multivariate Point Process, Mei et. al.\n\n- Finally, the authors show only one synthetic experiment. This is far from providing convincing evidence of the efficacy of the method and certainly needs a lot more work for acceptance in any machine learning conference.  The authors, at the least, must use their approaches on couple of real-world dataset (e.g. earthquake information, animal behavior as they mention or others) and also compare with the above stochastic processes techniques to test how their methods fare. \n\n- Also, the analysis of efficiency of their method is required. It appears that their methods may not be scalable for instance to a multi-dimensional discrete label case.\n\n- Figure 4 is not correctly referenced in the paragraph right above Section 4.3. "}