{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper tests generality and transfer in visual navigation tasks. It's an interesting question and a well-executed study. I applaud the use of a complex high-dimensional environment.\n\nThe experiments are well done, but I am not sure what we learn. Each experiment compares two highly similar tasks - as the authors themselves acknowledge - in ways that do not obviously connect to realistic transfer scenarios, such as transferring to a new environment. I would have liked to see experiments that compare networks trained on different environments or on different sets of environments.\n\nThe paper is called \"Insights on visual representations for embodied navigation tasks,\" but I am left wondering what those insights are. The authors state that \"Our work provides valuable and actionable insight into how the task influences the representation for embodied navigation tasks,\" but it is light on specifics and on the general discussion of the results. Not much is offered beyond a suggestion to use ResNets. I would consider revising my assessment if the authors write a more thorough discussion and specify clear implications of their findings.\n\nThe paper is generally well-written although important details are left out:\n- I think the target objects have fixed rather than randomized locations in the environments, but this isn't stated in the paper. Please specify.\n- Where does the agent start during an episode?\n- How large are the environments? e.g., one room or multiple rooms?\n- How many objects per environment are there e.g., in sets A and B?\n- The \"permutations of an environment\" setting isn't very clearly written and it took me a few readings to understand what you mean.\n- Finally, I suggest revising the very vague title to the paper"}