{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This paper presents a technique for gender-debiasing word embeddings. The technique consists of applying PCA and k means clustering to word embeddings, in order to reduce the effect of gender biased semantics.\n\nThe presentation is clear in the sense that the reader can understand the design of the technique and of the experiments; but less clear in the sense that the term bias is overloaded: early on (introduction) the authors state that removing the gender dimension is equivalent to removing gender bias (this is attributed to Bolukbasi et al. 2016 and Prost et al. 2019). This has not been preceded by a definition of gender bias; so in effect, gender bias is defined as the presence of gender in the embeddings. Further down in the introduction, the authors posit that frequency \"contaminates the gender dimensions\" (this is not further elaborated; as it stands, it is unclear). Even further down, the authors state their intuition that there is another type of bias in word embeddings that is closely intertwined with gender bias: this other type of bias is that words with similar frequencies in training tend to be closer in the vector space even if they do not have similar meanings. So now the core frequentist nature of embeddings is also presented as another type of bias that affects gender bias. After this line of reasoning, the authors state that their technique manages to reduce gender bias and is capable of preserving distributional semantics. But they have just spent two paragraphs defining distributional semantics as bias (in a fuzzy way). \n\nAnother problem is the lack of several SOTA gender-debiasing baselines in the experimental evaluation. The only gender-debiasing baseline used is the Hard method, but this is the very method that the authors extend with their technique. This is a limitation.\n\nThe topic of gender bias is important. The authors are encouraged to continue working on this area, and to focus on clarifying their definitions so that they are expressed in precise language. Thorough experimental evaluation against several SOTA baselines  is also important."}