{"title": "No theoretical justification, no validation possible", "review": "The authors aim at estimating a conditional average treatment effect (CARE) under strong ignorability assumptions. For this they use neural network regression and compare several transfer learning frameworks on this problem, which basically differ in how to share and update weights in the different experimental regimes.\n\nThe paper is clearly written and well organized. Several experiments have been conducted.\nThe originality of this paper is low as the authors just replace any regression method with neural networks. The term \"transfer learning\" - as used here - hides the fact that it is not based on theory, but just on a bunch of heuristics how to change the functions from one regime to another.\n\nSince the counterfactual hypothesis is not really testable, as also the authors pointed out (i.e. every single instance can only occure in one of the regimes), a theoretical justification for the use of the transfer learning heuristics is needed, but missing.\nSo in this light, the conducted experiments on real world data are close to meaningless as no ground truth is known.\nThe authors compare to other regression methods instead.\n\nClaims such as \"Our methods can perform an order of magnitude better than existing benchmarks\" are claims for  supervised learning tasks or where the groundtruth is known.\nIn this setting it is just unscientific: there is no theoretical justification and it can not even be assessed what the supposedly better numbers actually mean.\n\nThe reviewer suggests taking a more humble and scientific writing style and instead highlighting all sources of uncertainty, assumptions and missing knowledge, etc., in this setting.\nIf one still wants to use regression techniques and transfer learning a paragraph with a fundamental discussion about the justification of such approaches is necessary.\n", "rating": "3: Clear rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}