{"rating": "1: Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "The paper proposes a  deep learning architecture for forecasting Origin-Destination (OD) flow. The model integrates several existing modules including spatiotemporal graph convolution and periodically shifted attention mechanism. Experiments on a large-scale ride-sharing demand dataset demonstrate improved forecasting accuracy.\n\n+ The spatiotemporal forecasting problem is an important task in the context of ride-sharing platforms.\n+ The description of the model is clear and the real-world dataset experiments are interesting.\n\n- The novelty of the model is rather limited. Spatiotemporal graph convolution has been previously proposed in [Yu et al. 2018] and later studies. Periodically shifted attention is a slight modification of the earlier work.\n- The mathematical notations are messy and redundant. For example, the superscript index i, j can be removed and write all equations in matrix form. The subscript index can be replaced with a range operator. In Eqn (2), r_1 and c_2 are non-identifiable. \n- The experiments are not convincing. The paper is missing the following important baselines:\n\nBing Yu, Haoteng Yin, and Zhanxing Zhu. Spatio-temporal graph convolutional networks: A deep learning framework for traffic forecasting. In Proceedings of the 27th International Joint Conference on Artificial Intelligence, 3634-3640. AAAI Press, 2018.\n\nYaguang Li, Rose Yu, Cyrus Shahabi, Yan Liu. \"Diffusion Convolutional Recurrent Neural Network: Data-Driven Traffic Forecasting.\" International Conference on Learning Representations (ICLR), 2018.\n\nThe authors should provide confidence intervals and visualizations for the predictions.\n\n\n"}