{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper treats the important problem of when a model should be re-trained from scratch or incrementally trained as new data becomes available. Unfortunately, it is very hard to extract any useful conclusion out of this 6-pages paper, and I think considerable work is required before it can be useful for the community.\n\nThe problem tackled is very important, but it is not very well formulated (e.g. their notation keeps changing along the paper, the assumptions are never properly stated, etc.) and their proposed solution is quite confusing, specially the “Reservoir sampling” part. Furthermore, the experimental section is extremely poor: the experiments performed are not well explained, the reported results are very weakly linked to their proposed method, there are no error bars what so ever in any of their single-curve plots, and even if we make an effort to understand which of the curves is their method, there doesn’t seem to be any substantial difference with respect to the other (baseline?).\n\nThere are considerable typos throughout the paper, some of them considerably obscuring the meaning of their sentences. Just to report a few:\n- Fig 2 legend (which by the way is not referred anywhere in the text…) “A one-shot SGD settings as a function of ratio of initial to incremental data.”\n- Are “N” and “n” used interchangably in the notation? As all their notation, we encourage them to fix it and define it clearly.\n- “The reservoir of samples is inferred before a training epoch”. Do they mean sampled, or that they run the inference of their model on all the data-points in the reservoir?\n\nOther misc comments:\n- Instead of saying that your model is characterized by a weight matrix W, you should say “the weights of our model” or the “parameters of the model”. In modern Machine Learning this might be much more than a single weight matrix.\n- It is very hard to understand the utility of the reservoir sampling, and there should be a comparison to other simpler ways of sampling from the available data (like uniformly sampling n elements). No ablation studies what so ever are performed. "}