{"title": "Good effort, but has not demonstrated enough evidence to convince me to accept it", "review": "The paper proposes a sampling-based method that aims at accelerating Batch Normalization (BN) during training of a neural network.\n\nQuality: \n   The writing of the paper needs more polishing; I saw grammatical errors here and there: for example, at the first paragraph of page 2, \"alternating\" should be alternative and \"synthetical\" should be synthetic... \n\nClarity:\n  I have not been able to fully understand why the proposed (uniform) sampling variant of BN is better than previous effort at making BN less computationally expensive in a GPU-based training environment by reading the paper: \n  1. The authors argue that the \"summation\" operation is the one that makes BN expensive; however, the authors have not demonstrated enough evidence of this argument\n  2. If \"summation\" operation is what makes BN expensive, then in a GPU-based environment, can we simply divide the data into smaller batch, and train on each GPU using a smaller batch (this is way, each GPU is essentially calculating the statistics based on a sub-sample)\n  3. The authors discussed Micro-BN, which \"alleviate the diminishing of BN's effectiveness when the amount of data in each GPU node is too small...\" This seems to show that in practice, training with BN does not suffer from having a large batch, but instead suffers from having too small batch size on each GPU node. Related to the point above, doesn't this observation play against the motivation of using a sampling-based BN?\n\nOriginality and Significance:\n  I think the effort of trying to make BN less computationally heavy is respectable. But the idea of uniform-sampling seems     rather straight-forward, and more important, I do not see its justification from reading the paper; the other technique introduced, Virtual Dataset Normalization, seems to be a direct application of Virtual Batch Normalization (Salimans et al 16).", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}