{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "The paper tackles the problem of multiagent reinforcement learning.\nThe authors expand on the work of Iqbal and Sha (2018), which uses an attention mechanism to learn a counterfactual multiagent critic.\nInstead of an attention mechanism, the authors generalize the method to learn a \"headmaster\" critic, which assigns groups of agents.\nThe critic randomly selects n collections with random size s (changing n and s every k epochs), and applies a typical loss for the Q function based off of forming these groups.\n\nI don't believe this paper should be accepted to ICLR based off these observations:\n- The paper claims on L120 the headmaster learns how to group agents, but it is not explained in the paper how it learns it, it seems just randomly formed according to the description.\n- The results are not compelling enough, being barely above the algorithm it is being built off of, MAAC, and below MADDPG+SAC for few agents.\n- There are numerous writing errors - and the description of algorithms are not clear enough, see below for a few examples.\n\n\nSome comments:\n- Eq 10: the Q function should take in an observation and action, but now why is it taking a \"super agent\"? Should the sum also be until lowercase n collections?\n- Eq 12: This sum upper index should be until S_k, if we consider the k-th group? N is not well defined nor obvious.\n- L131 what is the degredation (do you mean degeneration?) and why is it bad?\n- L214 what does \"less poorly performance\" mean?\n- Sec 4.3 ATOC also seems to obtain comparable results as SMAC.\n\n\nnits:\n- L60: \"COMA _proposed_...\n- L106: misspelling \"siven\"\n- L127: misspelling \"contirbutions\"\n- L175: n in 'niceness' conflicts with the n collections defined in the previous sections\n- L229: misspelling \"hige\"\n- Everywhere: add a space before begin parenthesis"}