{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #4", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "1.\tSummarize what the paper claims to do/contribute. Be positive and generous.\nThe paper claims to propose a new semi-centralized method for optimizing multi-agent RL problems. It does this by creating random groupings of agents to pass messages between each other in a centralized critic fashion, similar to MADDPG. The method is interesting but I find the paper rather confusing. The method is not well described. While there is a lot of math in the paper it is rather common math that is not specific to the method until section 3.2.3. There are no details on how the method supports random groupings of agents in different amounts. Discussion on how important the random groupings off agents are should also be included. In the papers present state, I will have to vote for rejecting this paper.\nMore detailed comments:\n-\tThe abstract for the paper is rather confusing. There are a number of terms used that are not defined (headmaster, group, timing, etc). This makes it difficult to understand the proposed motivation and solution.\n-\tThe use of terms and vernacular in the introduction is rather loose. If more of these terms are defined clearly and in order it would greatly help the reader\n-\tThe claim that the method support “high dimension settings” is not well supported via experiments or design. Much more analysis related to this claim is necessary.\n-\tFor equation 1. It seems j is used for indices where in the next you refer to i.\n-\tThere is more detail than necessary in section 3.1. Most of this can be moved to the appendix. This space should be used to better explain, in detail, how the method functions.\n-\tHow does the network model cope with variable sized random groups over time? Is there some kind of attention model or sequence model being used in the critic?\n-\tThe tasks used in this work all seem to be new. Is there a reason they were all created and few already created environments were used for evaluation?\n-\tThe description in the caption for Figure 1 is very sparse. What are the coloured blocks for int he Coin game? What do the disks of different sizes and colours indicate in the treasure collection game?\n-\tIn Table 1 there does not appear to be any results for MADDPG on MAgent. Can these be computed and added?\n-\tThe description of the results in Figure 2 is also very sparse. How many random seeds are these plots averaged over? Was a similar network structure used across each model? SMAC does not appear to significantly improve over prior methods.\n-\tI do not understand the claim that the dynamics over time for MAgent causes DDPG based methods to break down. Much more reasoning and experimentation are needed to show that DDPG-based methods truly have trouble in these environments."}