{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper analyzes different aspects of the recognition task of fake face images by human subjects and neural networks. It observes that textures of fake faces are different from real faces and concludes that popular CNNs learn the local texture information to distinguish fakes from real ones. Building on this observation, it presents a modified ResNet architecture that incorporates Gram matrix computing layers. These introduced Gram layers suppress spatial structure information while amplifying repetitive patterns. Since this descriptor is computed for the whole feature map, it is not limited by the receptive field of CNNs, complementing the CNN backbone. Experimental evaluations for both in-domain and cross-GAN settings are provided. Generalization capability, in particular robustness against compression, downsampling, Gaussian noise, and blur, is investigated. It is demonstrated that the proposed Gram network layers improve baseline models. Some of the observations, e.g., large texture information being more robust to image editing, are apparent. \n\nNovelty-wise, the use of Gram matrices for real/fake detection has been presented in fPADnet [1], which applies a similar idea to SqueezeNet for fingerprint spoof-proofing. fPADnet even makes similar observations on Gram matrices: \"The Gram matrix at a specific layer is a summary statistic that discards the spatial information in the feature maps; therefore, a set of Gram matrices from several convolutional layers in the network provides a stationary description of the image texture.\" Although the network architecture in this paper is different, and the human studies enrich the overall contribution, the technical novelty is weak in consideration of [1]. For completeness, [1] should be included in the related work discussion. \n\n[1] Thi Hai Binh Nguyen et al. fPADnet: Small and Efficient Convolutional Neural Network for Presentation Attack Detection, Sensors, 2018. "}