{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The paper introduces an empirical study (including human studies and CNN experiments) to evaluate fake face detection. The paper reports that: 1) CNNs are better than humans in detecting fake faces, and 2) texture seems to be the most discriminative feature when it comes to fake face detection. Based on the texture observation the authors introduce a variant of a CNN (Gram-Net) that includes Gram matrix information to improve fake face detection.\n\nStrengths:\n- The paper studies an important problem\n- Human study is interesting\n\nWeaknesses:\n- The description of the Gram-Net is rather short - making it hard to asses the novelty of the method\n- The structure of the paper could be improved\n\nComments:\n\nAlthough the study seem to be sound, the observations about texture importance are not surprising (e. g. see https://openreview.net/pdf?id=Bygh9j09KX) - making the contribution rather incremental.\n\nThe structure of the presentation could be improved. The setup section  could be integrated with experimental sections. Currently, there are two and a half \"experimental\" sections and half methodology section.  Maybe rearranging the sections into Motivational Experiments, Methodology and Methodology Validation Experiments would be beneficial. Subsection 5.1 could be integrated with the Motivational Experiments. \n\nMethodology section could benefit from longer/improved description of the proposed Gram-Net. Without additional details, it is hard to asses the novelty of the approach.\n\nThis is an interesting analysis paper, however, the scope of the analysis seems to be too narrow to recommend the paper for acceptance at ICLR. Some ideas on how the paper argument could be made stronger (beyond previously mentioned points): 1) Finding a surprising, not very well known fact about fake image detection, or 2) expanding the scope of analysis beyond face images.\n\nQuestions:\n\nHow many images were included in the user study?"}