{"title": "A new optimizaiton method for NLE, but unclear and not convincing so far", "review": "This paper presents a new optimization method for minimizing nonlinear embedding costs such as Elastic Embedding and Stochastic Neighbor Embedding. The proposed method is based on identifying and removing particular points in the embedding space called pressured points. The presented method is tested on two image data sets COIL-20 and MNIST and is claimed to be able to improve the objective function value.\n\nThere are several things are unclear or not convincing.\n\n1) There is no definition of pressured points. The word \"pressure\" is used before its definition. Since it is not so obvious to direct borrow from physics or everyday English, a generic definition in the NLE context is needed but lacking here. Now it is defined only in individual NLE methods. Even with the pressure definition in EE and SNE, I still don't understand how to threshold the pressure to identify pressured points.\n\n2) The results are not convincing. \n 2.1) The authors should demonstrate the benefits in using such a new optimization method. For example, is it faster or giving lower NLE costs?\n 2.2) Objective vs. iterations are not convincing, because in PP each iteration is more expensive. Objective vs. time would be better. In Figures 4 and 5, it is hard to see PP achieves lower costs than SD.\n 2.3) There are only two data sets,, where both are images. Moreover, for the large data set MNIST, only EE results are shown. For MNIST visualizations, it is hard to say the PP result is better than SD if the colors are removed.\n 2.4) There exist many other optimization methods. Just defeating SD is insufficient. So far it could be interesting only to readers who are familiar with SD.\n\n3) The authors seem not to be aware of saddle points. In optimization, an algorithm can get stuck in two kinds of stationary points: local optima and saddle points. There is no checking of local optima in the work. Therefore many claims which do not consider saddle points are wrong or unsuitable.\n\n4) There is no proof that Algorithm 1 will converge. Moreover, the last clause \"until convergence\" is unclear: what is the convergence criterion?\n\n5) The title is confusing. The word \"pressure\" is different our common understanding and is not widely used in machine learning or ICLR literature. Moreover, at the end the PP embedding still has pressure (maybe just no pressured points). So the authors should consider a more precise and pertinent title.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}