{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This work explores a multi-agent communication setting, building on a recent framework (MARL) to assess the feasibility of an approach that uses discretized messages and a soft-attention based communication medium. The domain is traffic flow management, using the SUMO traffic simulator.\n\nThe multi-agent setup is constructed by treating each traffic junction as a node in a graph. Thus, each node is restricted in who it can send a message to, and who it can receive a message from, which is dissimilar from previous approaches that employed all-to-all connectivity. The results show a nice improvement over baselines, which include fixed-time controllers, DQN, and other heuristic-based solutions. \n\nA quite interesting result is the performance of the DQN model, which uses no communication at all. This result has me wondering how another version of this model would do, particularly one that receives not only visual input for its junction, but the inputs from its neighbors. One can imagine this as each agent communicating its full state information to its neighbors. I understand the authors are exploring emergent communication protocols, but this model might be another strong baseline against which to measure.\n\nIf the authors could address the following questions and comments, it would be appreciated:\n\nHow is this method expected to scale? I suppose like other multi-agent work, if each agent has its own unique parameters then training can quickly become infeasible as the number of nodes grows. On the other hand, if nodes share parameters, then one can imagine subsampling smaller graphs and training in batch on these.\n“Emergent communication”, as the title suggests, isn’t exactly what’s happening here since communication is built into the structure of the algorithm. An emergent communication *protocol* is more accurate.\nIs there some notion of directionality of message? You can imagine, for example, a situation requiring the flow of traffic to increase in the North direction for multiple nodes because of traffic backup, but *not* wanting adjacent Southern nodes to send even more traffic North because of the congestion. This would require sending one message to Northern nodes to increase northwards flow, and another message to Southern nodes to decrease northward flow. If there is no directionality of message, do you see this as a problem? If so, how would you propose to fix it?\n\nAltogether this work is nicely presented, and the inclusion of a number of baselines is commended. I’m assigning a “weak reject” rating because I am not sure it surpasses the bar of acceptance, in particular in regards to significant deviation over prior approaches and importance of results. But I look forward to the subsequent discussions, and will note that this rating is flexible.\n"}