{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "N/A", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper sets up the problem of training fault tolerant RL agents as a stochastic game between a stoppage inducing adversary, and an agent that tries the minimize the penalty from stoppage. This should drive an agent to avoid states where there is a high cost for stoppage. \n\nI think training RL agents to be fault tolerant is an important problem, however I am not convinced that the current framework proposed in this paper is the right approach to tackle the problem of catastrophic failures. Are abrupt stoppages the right framework to train RL agents to be fault tolerant? I think a key desired feature for FT systems that this formulation might miss is that of graceful degradation that we might want from our RL agents. I am not sure if the current level abstraction with the optimal stopping criteria for an adversary is sophisticated enough to capture this aspect. \n\nI am not an expert in this area, but I found the setup a fairly straight forward extension of minimax two player games, and value iteration via the Bellman operator. I am not convinced that the theoretical contributions here are extremely novel, and justify acceptance on their own. If the current work could be backed with some illustrative/meaningful demonstrations demonstrating the proposed approach, I think it would make the paper stronger.\n\n\nHow does this work relate to approaches such as CVaR where the agents are trained to avoid high risk (catastrophic) states?\n\nMinor comments/typos:\nEquation 3 — Did you mix up min and max? Stopping time is maximizing the reward?\n\n“which the agent has concern the process at a catastrophic system state.” — sentence seems to go wrong\n\n“the transition kernel P ·” — weird symbol after P\n\nP^a_{sds} — what is ‘d’? I am not sure if it has been defined before?\n\nNotation in 5 is confusing. What is the minimum over?\n\n“Additionally, Theorem 1 establishes the existence of a given by J ? , the computation of which, is the subject of the next section.” — grammar goes wrong"}