{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper presents a GAN architecture that generates realistic adversarial\ninputs that fool a targeted classifier.  Adversarial inputs are unrestricted:\nthey may be any realistic images that humans will often classify as real\nexamples of the intended class, whereas the target model misclassifies them.\nThe novelty is that they finetune the generator itself during training, the\nmethod can be applied to a variety of GAN architectures, and the method is fast.\n\nTricks used to successfully train the GAN are clearly described, and the\nexperimental evaluation was of good scope, covering a good selection of\nexperiments.  I particularly enjoyed the short Section 4.2 and Fig 7a+b, where\nthey show that a local defense can always be fooled somewhere else along\nthe input manifold of that class.\n\nWhile the modifications to existing solutions may at first seem minor, they\nhave significant impact in applicability, effectiveness and speed of generating\nunrestricted adversarial images.  So I think this paper can be accepted.\n\nI had a bit of avoidable confusion in the introductory sections.  Figure 1\ndescribing the GAN is never referred to.  It includes components not exactly\nagreeing with my naive expectations from surrounding text.  Are any Fig. 1 features\noptional?  It would help to highlight the novel elements in Fig. 1.  Or does\nFig.1 correspond perhaps to the combined GAN elements in Section 4 (\"In our\nexperiments, we combine three ...\").  My uncertainty was really relieved only\nby the time I got to Related Work and Appendix E :(\n\nThe main claims seemed well supported by experiments, apart from claim 3\n(applicability to \"any\" checkpointed GAN codebase). Might the scope of their\napproach also be clarified by clearly identifying required and optional GAN\ncomponents in Fig. 1?\n\n---- misc comments ----\nSome sentences were long and difficult to parse:\n- 4.1: \"Our method generates..., else ....\"  Perhaps make the else clause a second sentence.\n- 4.2: \"Image quality as measured ....\" length and references made this difficult to read. Can you\nrewrite as separate shorter sentences?\n"}