{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "The paper starts with a quite promising phrase, namely that the authors present the first method for verification that a neural network produces a correct output for _every_ input of interest. This is quite a strong claim and in its boldness almost comparable to claiming solving NP-hard problems exactly. Reading the paper it turns out that the solution to this problem is similar to solving NP-hard problems (an admittedly slightly provocative comparison I drew here): the instance of the problem needs to be simple enough.\n\nThis is really the main concern I have with this paper: its applicability is so restricted, that I am at loss at finding any suitable problems where it can be applied. Basically, the paper proposes to verify the correctness of neural networks but only trained on problems for which we normally would not use neural works to solve them in the first place.\n\nLack of applicability alone is of course not a ground for rejection, if we get theoretical insights into the problem from a paper. But I am not sure what we can learn from this algorithm scientifically, and I’d like the authors to elaborate on this. What kind of knowledge is gained from the proposed solution to the question of correctness verification? Is there even a roadmap to solving the problem on which this paper made a first step to?\n\nIn a nutshell, the algorithm supposes the existence of a state space underlying the problem, from which the observations are sampled. This is not a rare assumption, as many highly dimensional data are embedded in a much lower dimensional manifold, albeit an unknown one. However, this work requires to (i) provide a known state space which is of sufficiently low dimensions such that a tiling can be performed and all tiles can be processed through an exhaustive algorithm, and (ii), an observation process can be specified which produces observations from the state space. Short, the work requires the specification of a generative model. More importantly, the observation process requires bounded error in order to fulfill the constraint of being able to guarantee that the error for each input simple be lower than a certain threshold. It is easy to see, that even a naïve Bayesian classifier on 1D real input with Gaussian class conditionals does not fulfill these needs, as the Bayes error can never be zero due to the tails of the Gaussian law. The paper proposes verification in probability in this case, but (i) this waters down the message of the paper, which is precisely the claim of correctness verification, and (ii) verification in probabilities for generative models are pretty useless in my opinion, as the underlying estimates for the distributions are, more often than not, quite bad.\n\nThe algorithm itself is very easy and directly follows from the tiling process. As mentioned above, the state space is tiled and bounds are calculated for each tile.\n\nThe evaluation mirrors the remarks on the applicability of the algorithm: it is applied to very simple solutions, where the state can be described by 2 or 3 scalar values (e.g. angles of a camera on a road) and where the observation can be generated by simple laws from the state (e.g. a read consisting of 2 lines without any texture). \n\nThe question is, how this algorithm could be applied to more complex scenes – this is completely left unclear. \n\nLastly, in terms of presentation, I think that section 4 should be rephrased. At the beginning it is unclear what the inputs of the scientific process (described by the paper) are. What are the conditions? Are they assumptions? Are they something to be proved? It becomes clear to the reader later that these are assumptions, but we should not need to guess this.\n\nThere are two theorems, but not proof. Luckily their correctness is pretty evident from the assumptions, but why do we need them then? If a theorem is too simple to proof it, skip it. If it is not simple, provide a proof.\n"}