{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "Summary:\nThe assumption behind this paper is that we have access to:\n- A state space, which is essentially a semantic description of the state of the world\n- An observation process, which converts the state space into a visual representation (this is eventually a noisy process)\nWith this, the papers deals with performing verification over specification that gives ground truths corresponding to subsets of the state space.\n\nThe strategy followed is to decompose the input state into tiles, compute bounds on the values that can be taken by the visual representations and then verify using an existing solver that those bounds on the model input lead to the correct prediction.\n\nThe authors propose two toy examples, one imitating a camera taking image of a road and one imitating LIDAR measurements of a sign with one of three predefined shapes\n\nOpinion:\nI think that the contribution of this paper is very limited. \nExisting verification works essentially propagate constraints over the input to obtain bounds on the output of the model. The contribution of this paper is to say that if your specification is over a state space, you should propagate your constraints through the generative model to obtain constraints over the input, and then use existing methods, which is trivial. The problematic lies in being able to do it for complex meaningful generative models. This paper simply circumvents it by having simple enough generative models and handcrafted generation of the bounding box corresponding to subsets of the input space.\n\nI don't think that this paper should be accepted."}