{"title": "Novel idea but requesting clarifications. ", "review": "The paper presents a novel idea of generating discrete data such as graphs that is conditional on input data to control the graph structure that is being generated.\n\nGiven an input graph, the proposed method infers a target graph by learning their underlying translation mapping by using new graph convolution and deconvolution\nlayers to learn the global and local translation mapping.\n\nThe idea of learning generic shared common and latent implicit patterns across different graph structure is brilliant.\n\nTheir method learns a distribution over graphs conditioned on the input graph whilst allowing the network to learn latent and implicit properties. \n\nThe authors claim that their method is applicable for large graphs. However, it seems the experiments do not seem to support this. \n\nIt is not clear how the noise is introduced in the graphs. I would have expected to see some analysis and results on the translation quality over systematic noise applied to the input graph. \n\nIt is also not clear what are the assumptions made on the connectivity of the input graph and the target graph.\nDo we know how does the connectedness of the  input graph affect the translation quality in the case of strongly connected directed graphs? Or what happens if the target graph has a strong connectivity? Towards this, how does the computational complexity scale wrt to the connectedness?\n\nA lot of clarity is required on the choice of evaluation metric; for example choice of distance measure ?  What is the L1 norm applied on? \n\nI did not completely follow the arguments towards directed graph deconvolution operators. There is lack of clarity and the explanation seems lacking in parts in this particular section; especially since this is the key contribution of this work\n\nTypo:. The “Inf” in Tabel 1 \n", "rating": "5: Marginally below acceptance threshold", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}