{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper introduces directional adversarial training (DAT) and UMixUP, which are extension methods of MixUp. DAT and UMixUp use the same method of MixUp for generating samples but use different label mixing ratios where DAT retains the sample's original label. In contrast, UMixUp uses a function of the input mixing ratio. This paper shows that UMixUp and DAT are equivalent when the number of samples tends to infinity. In the experiments, UMixUp provides an improvement over MixUp.\n\nThis paper should be rejected because the originality of the proposed method over MixUp is marginal, and the improvement of classification accuracy is not surprising, although the explanation of the relationship among DAT, UMixUp, and the original MixUp is nice. The modification of label mixing ratios is not enough contribution. A more precise description of why DAT and UMixUp work better over the original MixUp is required.\n\nThe same idea of MixUp was proposed at the same conference (ICLR2018). It should be cited.\nTokozume et al., Learning from Between-class Examples for Deep Sound Recognition. ICLR, 2018.\nTokozume et al. explain why the mixture of examples works well from the different perspectives of adversarial examples. Also, BC learning uses a KL loss, not a cross-entropy loss. Therefore, the reviewer doubts the following statement: \"MixUp is only applicable to baseline models that use cross entropy loss\" on page 2.\n\nMinor comments\n1) In page 8, \"negative-cosine (CE)\" might be \"negative-cosine　(NC)\"."}