{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper addresses a method of applying prototypical networks (which are popular for few-shot learning problems) to few-shot one-classification problems where only one group of examples are available without any counter-examples. The main idea of prototypical networks is to learn an embedding function such that in the embedding space a distance metric well reflects the class structure. When such models are applied to one-class problems, a basis for comparison is required. \nThe idea proposed in this paper is to introduce a null class which models the entire space of possible examples and queries are judged, compared to positive class as well as the null class. Another extension was made to model classes by their distribution instead of prototypes only, leading to one-way normal prototypical models.\n\n---Strength---\n- One-class extension of the prototypical network is a new idea, while prototypical networks are already popular for few-shot learning problems.\n- The proposed model can solve few-shot anomaly detection problems.\n\n---Weakness---\n- Regarding the null class, it was claimed that the centroid of the whole latent space can be assumed to be close to the origin in the embedding space, since batch normalizations are included in the model.  The batch normalization learns the scale and shift parameters to minimize the error function, so the center does not have to be close to zero in all dimensions. More clear justification should be added to make the paper more sense.\n- Regarding one-way normal prototypical models, calculating the distributions require sufficient number of examples. Thus, when applied to few-shot anomaly detection, the performance might be be satisfactory.\n"}