{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The submission proposes a technique to learn RGBD image synthesis from RGB images. A distinctive feature proposed by the technique is the user-controllable camera rotation parameters, learned in an unsupervised manner. The technique can be used in conjunction with various models, such as PGGAN, StyleGAN, and DeepVoxels.\n\nThis paper provides an interesting approach that can be a useful building block for future investigations.\n\nThe main issue I see with the paper is the number of results provided. Only 2 different images are shown per combination of model and dataset, limiting the reader's ability to assess the technique's performance. Would it be possible to provide a large number of results in a supplementary material or appendix?\n\nIn my opinion, this may be due to a difference in writing style, but the paper, in general, is slightly hard to read.\n\nThe depth in figures 1, 4, 5, 7 and 9 would be easier to read if it was displayed as a colormap (with the corresponding color bar) instead of grayscale. Additionally, a reference sphere would be appreciated near the normal maps shown in fig. 6 to inform the reader of the coordinates system used.\n\nSec. 3.3 states that “the depth of the background is smaller than that of the face [for DeepVoxels]; however, this does not occur when the proposed loss is used”, however fig. 6 seems to show the contrary. Is it due to the depth discontinuity?\n\nMinor details\n- Sec. 3 “Experimetns”: typo.\n- Sec. 3.3, “[...] use the 2D CNN”: I would replace “the” by “a”.\n- Sec. 3.3, Third paragraph, the first sentence is hard to read.\n- Sec. B “the later voxels are ignore[d]”\n"}