{"title": "Interesting application of deep learning with interesting results.", "review": "The paper proposes an approach to automatically learning variable selection\nheuristics for QBF using deep learning. The evaluation presented by the authors\nshows the promise of the method and demonstrates significant performance\nimprovements over a variable selection heuristic that does not use machine\nlearning.\n\nIn practice, the overhead of the proposed method is likely to be a major\nobstacle in its adoption. The authors note the difficulty of finding suitable\nbenchmarks and restrict the set of instances they use for evaluation to formulae\nwhere the proposed method is likely to achieve improvements. This skews the\nevaluation in favor of the proposed method; in particular, the 90% improvement\nfigure mentioned in the abstract is not representative of the general case.\nIndeed, on another set of instances the proposed method falls significantly\nshort of the performance of a state-of-the-art heuristic that does not employ\nlearning.\n\nA drawback of the paper is that there is no comparison to related work. I\nrealize that this is difficult to achieve because other approaches are in\nrelated, but different areas and may be difficult to adapt for this case, but a\ngeneral comparison to the improvements other approaches achieve would be\nhelpful.\n\nNevertheless, the work is interesting and presents a new angle on using machine\nlearning to speed up combinatorial problem solving. While several issues hinder\npractical adoption, this is likely to lead to interesting follow-up work that\nwill improve problem solving in practice.\n\nThe description of the method (Section 4.1) is short and not detailed enough to\nreproduce the approach the authors are proposing. However, the code is\navailable.\n\nIn summary, I feel that the paper can be accepted.", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}