{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper presents a new method computing the importance of features in time series, called Feed Forward Counterfactual (FFC).\nIn previous work, the explainability problem in time series was tackled with feature occlusion (FO), sensitivity analyses (SA) methods. However, previous counterfactual based methods do not carefully consider appropriate conditional distribution and generate out-of-distribution counterfactuals.\nThe proposed FFC method addresses this issue by leveraging a generative model which learns the underlying dynamics and generates a realistic counterfactual given the past observations. FFC is evaluated on simulated and real datasets and shows that it is better at localizing important observations over time compared to the other baselines.\nIn summary, this paper introduces a way of defining the feature importance at every time point. The main idea of this paper follows in line with [Chang et al. 2019] which address the problem of out-of-distribution counterfactuals. Although the experiment shows successes of the proposed method on several datasets, the major weakness of this paper is the lack of technical novelty and detailed analysis of the proposed method. For example,\nIf the time series is non-stationary, this could incur a different amount of the change in the model output and proposed time importance might not work. How about this?\nDid the authors consider trying out with varying size of training data or generator model?\nMinor\nOn page 2, p(\\mathbf{x_{t,i}|\\mathbf{X_{0:{t-1}}}}) -> p(x_{i,t}|\\mathbf{X_{0:{t-1}}}})\nOn page 6, affected by feature and -> affected by feature 1 and\n"}