{"title": "Networks that predict covariates of multimodal inputs like identity and gender produce better representations for cross-modal matching and retrieval tasks than directly predicting cross-modal matches.  Paper and well written and experiments are thorough.", "review": "This paper aims at matching people's voices to the images of their faces. It describes a method to train shared embeddings of voices and face images. The speech and image features go through separate neural networks until a shared embedding layer. Then a classification network is built on top of the embeddings from both networks.  The classification network predicts various combinations of covariates of faces and voices: gender, nationality, and identity.  The input to the classification network is then used as a shared representation for performing retrieval and matching tasks.\n\nCompared with similar work from Nagrani et al (2018) who generate paired inputs of voices and faces and train a network to classify if the pair is matched or not, the proposed method doesn't require paired inputs.  It does, however, require inputs that are labeled with the same covariates across modalities.  My feeling is that paired positive examples are easier to obtain (e.g., from unlabeled video) than inputs labeled with these covariates, although paired negative examples require labeling and so may be as difficult to obtain.\n\nSeveral different evaluations are performed, comparing networks that were trained to predict all subsets of identity, gender, and nationality.  These include identifying a matching face in a set of faces (1,2 or N faces) for a given voice, or vice versa. Results show that the network that predicts identity+gender tends to work best under a variety of careful examinations of various stratifications of the data.  These stratifications also show that while gender is useful overall, it is not when the gender of imposters is the same as that of the target individual.  The results also show that even when evaluating the voices and faces not shown in the training data, the model can achieve 83.2% AUC on unseen/unheard individuals, which outperforms the state-of-the-art method from Nagrani et al (2018).\n\nAn interesting avenue of future work would be using the prediction of these covariates to initialize a network and then refine it using some sort of ranking loss like the triplet loss, contrastive loss, etc.\n\n\nWriting:\n* Overall, ciations are all given in textual form Nagrani et al (2018) (in latex this is \\citet{} or \\cite{}), when many times parenthetical citations (Nagrani et al, 2018) (in latex this is \\citep{}) would be more appropriate.\n* The image of the voice waveform in Figures 1 and 2 should be replaced by log Mel-spectrograms in order to illustrate the network's input.\n* \"state or art\" instead of \"state-of-the-art\" on page 3. \n* In subsection 2.4: \"mGiven\" is written instead of \"Given\". \n* On Page 6 Section 3.1 \"1:2 matching\" paragraph. \"Nagrani et al.\" is written twice. * * Page 6 mentions that there is a row labelled \"SVHF-Net\" in table 2, but there is no such row is this table. \n* Page 7 line 1, “G,N” should be \"G, N\".\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}