{"title": "A pure tech report with no novel contribution and serious flaws in the formatting, technical exposition and experimental evaluation", "review": "The authors experiment with building an SSD-like object detection network for text detection in documents, by replacing the usual VGG or ResNet base architecture with a light weight model inspired by the original digits classification CNN from [LeCun et al 1999].\n\nThis paper is a pure technical report with no novel contribution: all the authors do is replace the \"body\" network in the well-known SSD architecture with a simpler model (taken from existing literature) and evaluate it on two synthetic benchmarks of their creation.\nThe idea of employing object detection CNNs for OCR is not novel either, as pointed out in the related works section.\n\nBeside the absence of novelty, the paper also suffers from several other serious flaws:\n\n1) One of the main motivations provided by the authors for this work is that existing \"classification [...] detection [...] or segmentation networks, cannot be applied directly, even with finetuning\".\nHowever, no experimental results are reported to justify this claim.\nIn fact, in the experimental section the proposed network is not compared against any existing baseline.\n\n2) The text has serious clarity and formatting issues, in particular:\n- most tables and figures have no caption, and the few that have one are not numbered\n- the text exceed both the 8 pages limit and the extended 10 pages limit allowed in the case of big figures\n- the experimental section is very confusing, in particular the way the authors refer to the various network variants using long code names makes it really hard for the reader to follow the ablation studies\n- given the absence of proper captions and numbering, it is quite hard to understand which table refers to which experiment\n- most of the graphs seem to be in the form of low-resolution bitmaps, which are quite hard to read even on screen\n- many entries in the References section are either missing the venue, or point to an arXiv link even when a proper conference / journal reference would be available\n\n3) Some important details about the network are missing, in particular the authors do not mention how labels are assigned to the network outputs, and only give a vague indication about the losses being used.\nSimilarly, there's no mention about the use of NMS, which is also an important component of the two architectures (SSD and YOLO) that inspire this work.\nAssigning labels and performing NMS are actually some of the most crucial components in the training of object proposal / object detection networks, often requiring numerous meta-parameters to be properly configured and tuned, as testified by the meticulous descriptions given in previous works (e.g. YOLO and Fast / Faster / Mask r-CNN).\n\n4) The experimental section is very poorly organized and formatted (as mentioned in (2) above), and completely lacks any comparison with other state of the art approaches.\nA lot of space is devoted to presenting a detailed ablation study which, in my opinion, doesn't contribute much to the overall paper and actually reads more like a report on meta-parameter tuning.\nFinally, starting from Section 5.3.1 the text seems to be copy-pasted without a second read from some differently formatted document, as entire phrases or possibly tables / figures seems to be missing.\n\nIn conclusion, in my opinion this paper does not meet the conference's minimum quality standards and should definitely be rejected.", "rating": "1: Trivial or wrong", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}