{"title": "Could be interesting but biased in many aspects ", "review": "The paper presents an interesting approach to change point detection. I agree we need more general model to capture the change. However, unfortunately, they did not place the contribution correctly with respect to existing literature. The comments for prior work seem to be highly biased. For instance,  in Section 2, \"these methods either have unrealistic assumptions, such as defining changes as a large difference in covariance matrix\". I would like to comment that, covariance change can capture a large number of changes in real applications and these are not unrealistic assumptions. \n\nThe \"pyramid\" recurrent neural network seems to be a extension of RNN using the idea of multi-scale structure. Could be interesting.\n\nThe paper gives too much emphasis on the \"merit\" of the neural networks on capturing the change patterns. However, there is a very important aspect been ignored or hiding: in order to train neural networks to capture anomaly patterns, since neural networks are highly over-parameterized model, usually there won't be a large number of samples for anomalies. Therefore, in many situations, it is simply unpractical to train neural networks to capture post-change samples. \n\nThere is a large body of literature on change point detection in statistics etc. (the author mentioned one, Chen and Zhang 2015, more over, the comment that \"they can only detect abrupt change\" is wrong, the method is quite general).\n\nThe paper fails to have any comparison with existing methods. For instance, how does the proposed method compare with hoteling T-square statistic, or CUSUM statistic, or generalize likelihood ratio statistic, or MMD statistic (non-parametric approach)? Without any comparison, it does not make sense to claim proposed method is superior. \n", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}