{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "Contributions:\n\nThe main contribution of this paper lies in the proposed Couple-VAE for text modeling. It is widely known that VAE designed for text modeling suffers from the posterior collapse problem, and in this paper, the authors shows that the training faces the challenges of encoder-decoder incompatibility. In order to alleviate this issue, the original VAE is accompanied with a deterministic network with the same structure as the VAE. The encoder of both the stochastic and deterministic networks is shared, while a coupling loss is proposed to push the stochastic decoding signals into the deterministic ones. Experiments demonstrate that the propose method is model-agnostic, and can be used to improve the performance of various models.  \n\nStrengths:\n\n(1) Writing and Clarity: This paper is well written. I enjoyed reading this paper. Every section is clearly presented. \n\n(2) Experiments: I appreciate that the authors provided comprehensive results like Table 1 & 2. This demonstrates that the proposed method can be used to improve performance of  a wide range of  current VAE models for text modeling. The experiments look carefully designed. \n\nWeaknesses:\n\n(1) Novelty: My biggest concern regarding this paper lies in its novelty. From my understanding, this paper contains two novelty points: (i) the identification of the so-called encoder-decoder incompatibility problem; and (ii) the proposed Couple-VAE model. In terms of the the first point, though the observation is interesting, and it seems no previous work has pointed out this problem clearly like in this paper, still, it looks kind of straightforward. In terms of the model design, i.e., Figure 3, its novelty is very limited. Basically, the model couples a VAE and an AE together, by sharing the encoder and decoder together, and adding an additional coupling loss. To me, this is not enough to support an ICLR paper.  \n\n(2) Questions:\n\nThe coupling loss is defined in Eqn. (5). Though the authors argued that using Euclidean space may not work well, it would still be interesting to report results of using a simple L2 norm for the couple loss to support this claim. Further, what is the model performance without using the couple loss? \n\nOverall, I think this paper is well written and well executed. However, due to the limited novelty of the method part, I lean to weak rejection of the paper. "}