{"title": "Interesting study, results not convincing, analysis provides a biased picture", "review": "The paper proposes a way to optimize morphology and controller of a simulated robot.\n\nStrong aspects:\n- Combination of Evolutionary search over morphology and hyper parameters with RL for controller\n- Introducing analysis tools from game theory to the community\n- entertaining video\n- good presentation/clear writing\n\n\nWeak aspects:\n- authors do not mention that they will make the code public\n- presentation is based on the best of 50 runs! They are not directly hiding this fact, but when looking through the results they appear much better than they are.\n  Only in 70% of the cases their algorithm is finding a better morphology! Not sure we can call this a success, given that it takes an enormous training effort.   \n- Only one particular environment is considered\n- The result that controllers from body-improving population is better (in 64% of cases) than with fixed body is suspicious and would have needed a stronger analysis.\n a) in principle the controller optimized for the fixed body should not be out beaten by a controller that was optimized for a different morphology\n b) when considering the process of changing morphology as a source of noise then the controllers in the body-improving sub-population might be able to find a different strategy which is also better on the original body, but was not found. Still, a bit strange.\n- The Shapley analysis is not really convincing: It really depends on how the controller is adapted to these changes. For instance if the changes were early during evolution than they are very important because the controller would \"forget\" how to behave without them. So a temporal aspect would have been important as a baseline. Also, running the same analysis with many agents, not just the one best agent from 50 runs. This is not a generic or particularly useful result. \n- in evolutionary robotics work studying the interplay of learning and evolution, the body would vastly change, in order to obtain surprising and creative solutions. Here is it merely a fine-tuning operation.\n\n- When referring to the Baldwin and Lamarkian evolution, it would be useful to state what this paper studies, i.e. the unbiological Lamarkian version.\n\nWhat did we really learn from the paper? It not really surprising that an adapted morphology can be better than an unadapted one. I understand that it is not necessarily easy to obtain this result, but that the algorithm is only managing this in 70% of the cases is actually not a good sign. Since the analysis is based on a particular run, how does the worst run look like? Which conclusions would have been made with the given analysis tools? ", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}