{"title": "Compelling idea, limited novelty, insufficient experiments", "review": "The paper is generally clear and well structured, with the exception of the proposed approach which is not clearly explained.\nAlthough not very novel, the topic considered is fairly interesting as it might tap into important questions about natural evolution. \n\nPro:\n- The use of multi-agents cooperative game theory is interesting and well fit with the evolution of bodies. \nCons:\n- This cooperative game theory formulation is not really explored in details and has little practical consequences to the experimental setting.\n- The contribution of the paper is very limited. The idea of jointly optimizing bodies and controllers has been extensively explored in the existing literature. Compared to this literature, I do not see any significant novelty being introduced.\n- The actual algorithm used is unclear to me. Where is SVG being used in algorithm 1?\n- The experimental results are weak (more details below).\n- The paper is often not sufficiently rigorous in its statements (see details below).\n\nIn its current form, the paper does not seem to be a significant contribution to the literature.\n\n\nMinor points:\n- \"the the\" in the abstract\n- In the paragraph at the end of the first page and the beginning of the second page, there is a number of statements about the role of the body and intelligence. In a scientific article, this type of unsupported and hand-wavy statements is unacceptable and must either be supported by previous works or clearly indicated as a hypothesis.\n- What is a \"physically simulated environment\"? I guess that you refer to a software simulator, but this wording is non-sense. A physically simulated environment to me suggests that somebody physically simulates the environment with action-figures or something similar. \n- In the related work, you indicate a number of previous work from the evolutionary community without comparing them to your work. Instead, you briefly conclude that \"in contrast, we use an RL algorithm\". Since both evolutionary strategies and RL are nothing more than optimizers (and in particular, since your approach is also based on populations and evolution), you need to explain this connection significantly more in details.\n- One aspect that I find worthy of further explanations in the paper it is the use of self-play and a population of agents. This could be at the same time beneficial and a limitation. Thinking about and discussing both would be valuable.\n- please use a spell checker: \"algoithm\"\n- The experimental results in Sec 3.1 this moment only show that adding parameters of the body increase performances -- which is a fairly well-studied phenomenon in the literature. No comparisons to previous literature are performed (e.g., evolutionary strategies). Moreover, it naturally raises the question of how would an equal-weight fix-configuration robot perform.\n- Fig.5A should be in the number of iterations of similar metric. Using time can be misleading and unclear (is it the computational time or equivalent real-time?). Whatever metric you decide to use, you should accurately describe how it is computed.\n- It would be nice to have an intuitive explanation of what elo scores correspond to behaviorally.\n- statements such as the \"in 64% of the runs\" would benefit from including a plot of the whole distribution.\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}