{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper considers the extensions of variational autoencoders (VAEs), which take into account the total correlation of sampled distribution of latent variables. Proving a theorem that a family of distributions of sample representations with a bounded total correlation can have a mean representation of arbitrarily large total correlation, the authors propose RTC-VAE, which additionally penalizes total covariance of sampled latent variables. The authors demonstrate that RTC-VAE produces less correlated distributions of mean representation compared with baselines.\n\nThe proposed method, RTC-VAE, is based on a simple idea and its performance in experiments is promising. However, its derivation is somewhat ad-hoc and the experiments are not so comprehensive enough to provide the evidence for its good performance.\n\nThe covariance term in RTC-VAE of Eq. (4), is indirectly related to mean representation. Is it difficult to penalize TC(\\mu), directly?\n\nThe arguments in Section 5 are somewhat superficial. It isn’t explained how Eq. (5) is derived. Without the explicit definition of D(z), Eq. (8) is not so informative.\n\nSection 6: It is not discussed why the regularization parameter \\eta is fixed to 10 and how RTC-VAE is sensitive to \\eta.\n\nAre there any other performance measures to indicate the good overall performance of RTC-VAE other than the training ELBO in Fig. 5?\n\nMinor comments:\np.3, l.21 from the bottom: [z] should not be in the subscript.\np.4, l.3: n_{m+1} -> n_{M+1}\np.6, l.17 from the bottom: ``\"that Factor VAE does\" -> ``\"than Factor VAE does\"\n"}