{"title": "Review", "review": "This paper proposes a GAN-based technique to generate watermarked images. In the presented setup, a high-capacity generator generates watermarked samples that should be decodable by a low-capacity detector. The idea is that the decoder can then be used within other neural networks for protection or to attack them. Different to a vanilla GAN setup, the decoder and encoder work together. The watermark, in the proposed setup, is added by combining residual blocks and an attention mechanism. Experiments are presented for a couple of publicly available datasets.\n\nFrom a technical point of view, I think this is a valid strategy to follow, however, the motivation is unclear to me. If the goal is to create watermarked images that can be detected later on, many methods in the information security literature exist. The authors argue two particular points: (1) the detector needs to be lightweight and (2)  they do not want to implant a predefined signal into the images, but rather let the encoder decide what needs to be implanted. Regarding point (1), as\nmentioned, many methods exist that are (non neural-network based) fast in detection (AND fast in embedding), as they essentially only require correlation with a watermark signal in a transform domain (DWT, DCT, etc.), see, e.g.,\n\nJ. R. Hernandez, M. Amado, and F. Perez-Gonzalez. \nDCT-domain watermarking techniques for still images: Detector performance analysis and a new structure.\nIEEE Transactions on Image Processing, 9(1):55–68, Jan. 2000.\n\nA. Nikolaidis and I. Pitas. \nAsymptotically optimal detection for additive watermarking in the DCT and DWT domains. \nIEEE Transactions on Image Processing, 12(5):563–571, May 2003.\n\nA. Briassouli, P. Tsakalides, and A. Stouraitis. \nHidden Messages in Heavy-Tails: DCT-Domain Watermark Detection Using Alpha-Stable Models. \nIEEE Transactions on Multimedia, 7(4):700–714, Aug. 2005.\n\nR. Kwitt, P. Meerwald and A. Uhl\nA Lightweight Rao-cauchy Detector for Additive Watermarking in the Dwt-domain.\nACM Workshop on Multimedia and Security, 2008.\n\n...\n\nThese methods further provide optimality guarantees for detection (under certain assumptions) and allow\nto directly control the embedding strengths which affects the PSNR for instance.  \n\nRegarding issue (2), it's unclear to me why implanting a signal is not desirable. Typically this is just a sequence of random numbers generated by a specific seed.\n\nAdditionally, the authors claim that their method produces \"robust\" watermarks, however, this is not evaluated. Typically, one would try to attack the watermarking scheme to address this question. Also, the produced watermarks (e.g., Fig. 2) are not imperceptible. This is also not directly controllable, as it depends on the optimization procedure. My suggestion for the authors is to perform a more fine-grained comparison to existing techniques and assess robustness as well as the impact of existing schemes on classification performance (as done for their method). Maybe, the authors can also comment on the achieved PSNR values  which are rather low, compared to SWM for instance. Modifying images in such a way might be undesirable in practical applications. Typically, it is also important to assess how the embedding strength affects the detection success in a more fine-grained manner (similar to Table 1). \n\n\n\n\n\n\n\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}