{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The paper proposes several modifications to the Mask R-CNN model:\n1. a variation of Feature Pyramid Networks (FPN): SA-FPN which merges features top-down and bottom-up.\n2. the \"effective joint head\" (EJ-Head) which consists of\n    a) moving the segmentation head behind the detection one,\n    b) Doubling resolution of RoI crops, calling this \"enriched feature\".\n    c) adding Boundary Refinement (really just a residual block).\nExperiments show slightly improved scores on MS-COCO\n\n\nI vote to reject this paper.\n\nFirst of all, it is badly written. Not only are grandiose formulations of \"smart framework\", \"innovative way\", \"we slickly mix\" not professional, but the whole write-up of the method is very confusing. After reading it multiple times, I am still not 100% sure I fully understood the SA-FPN.\n\nSecond, it is not clear to me that SA-FPN is really novel, the original FPN paper already compared top-down and bottom-up performances (Tables 1-3).\n\nThen, two modifications which simply increase capacity and could explain all improved scores are not ablated: increased resolution of RoI crops, and added \"boundary refinement\", which is really just a residual block.\n\nFurthermore, moving the segmentation *after* the bounding-box prediction is *not* joint prediction. If predicting the box is called p(b) and predicting the mask is called p(m), the Original Mask R-CNN does p(b|features)p(m|features), the proposed model in this paper does p(b|features)p(m|b,features), and actual joint prediction would be p(b,m|features).\n\nFinally, I think the paper is much better suited for a conference like ICCV/ECCV or CVPR and will get better reviewers than me there."}