{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The authors present an algorithm to explore the generation of new organic molecules using a genetic algorithm.\nThe genetic algorithm will select molecules generated via mutation and cross over, according to a fitness function that includes a discriminator trained from generated molecules.\nThe mutation rule seems to be 50% insertions and 50% replacements of single SELFIES characters, plus a rule for the direct addition of phenyl groups with 4% chance.\nNo crossover rule is used.\nThe metric used is a maximum penalized logP score proposed by Gomez-Bombarelli, et al. \nThe work shows a huge improvement on this score using their proposed algorithm.\nAdditionally, the authors show some of the promise of the work in constrained optimization:\nThe algorithm can, with minor modifications, generate molecules with specific properties, and improve low scoring molecule.\nThere is also a study on the hyperparameter \\beta - low beta tends generate high scoring molecules, and high beta generates molecules similar to the dataset.\n\nBecause of the novel genetic algorithm based search method, as well as the large improvement on prior literature, I am leaning towards an accept for this paper.\n- Paper uses a metric well motivated by prior literature, J(m)\n- There are constrained optimization studies showing different ways to use the algorithm\n- The authors show the effect of the hyperparameter \\beta on the algorithm - it seems to be difficult to interpolate between molecules in the dataset and molecules with high scores.\n- All previous work have been with SMILES strings, where this work is the only one that builds up on SELFIES strings.\n  It is not a sincere comparison - it would be better if the authors indicated which works use SMILES and which one uses SELFIES.\n  A more sincere baseline would be to take a baseline model and apply it to SELFIES, while showing that the genetic algorithm based approach shows more viability.\n  At least ORGAN seems to operate on SMILES strings, so it would be not too hard to change the underlying sequences to SELFIES strings.\n- Some quantifiable metric of diversity of generated molecules might be a good analysis, it's unclear whether the model is simply memorizing a few high scoring molecules.\n\n\nTwo questions I have might improve the paper if they are answered in the text:\n1) It seems to be the discriminator will decide whether molecules are in the dataset or not.\n   If it is well trained and with a high penalty (e.g. time adaptive case), the GA will pick high J(m) molecules that are in the dataset.\n   An analysis of the topline of the dataset might be useful - what is the J(m) of the best molecule in the dataset?\n   If you simply seed a non-time adaptive GA with the best J(m) molecule, would it be able to reach the same levels?\n\n2) Seeing the molecules generated in Figure 7d, it seems to imply to me that that algorithm is finding \"bugs\" in the simulation metric.\n   Since the ICLR community does not have many chemists, it would be useful to make some claims about the chemical viability of these compounds outside of simulations.\n   Are there molecules that are similar looking to the generated ones?\n   Perhaps some analysis on whether the GA is overfitting to the synthetic metric of J(m) would be helpful.\n\nNits:\n- Use uppercase ZINC in all cases to refer to the dataset\n- Last sentence \"An important future generalization...\" awkward phrasing.\n"}