{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "Generating novel drug molecules is an important problem. Prior approaches to solve this problem has explored approaches like VAEs, GANs and Genetic Algorithms. The authors propose a genetic algorithm that is augmented with Neural Networks for this purpose. The authors claim impressive performance with their algorithms. While maximizing for Penalized logP, the molecules that they generate have almost twice the maximum Penalized logP reported in the literature. \n\nFrom a purely molecular optimization point of view, their results are impressive. However, I suspect the paper does not clearly illuminate what is going on. For example, the Random SELFIES performs twice as good as state of the art generative models from couple of years back like JT-VAE, SD-VAE and Grammar VAE.  I suspect what is happening is that the random model and the models proposed by the authors are veering too much from the training data. The authors indeed suggest that this is the case in the discussion about the parameter beta. For small values of beta, the generated molecules move away from the reference distribution. While standard VAE models tries to ensure that the training and generated models are from similar distributions, the models proposed by the authors face no such constraint, for small values of beta. This makes the comparison with other models unfair - because other models try their best to generate molecules from the reference distribution, while at the same time trying to optimize for molecular properties like higher penalized logP. If those models had the freedom not to restrict its exploration to the training distribution, one can obviously generate molecules with higher penalized logP.\n\nThe authors seem to suggest that moving away from the reference distribution might be desirable, if we can get molecules with higher penalized logP. Indeed, this is not the case. Zinc is a database of small drug-like molecules. When they move away from this distribution, they will start generating molecules which are not drug-like and which perform poorly in other metrics like QED and Synthetic Accessibility. In this sense, the results claimed by the authors are misleading.\n\nCan the authors plot a distribution of molecular properties (molecular weight, Synthetic Accessibility, QED, logP and number of Rings) for zinc, and the generated molecules with different values of beta, so that we can analyze this phenomenon better? Code for this (along with examples) can be found in the MOSES toolkit: https://github.com/molecularsets/moses"}