{"rating": "3: Weak Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "The paper describes a model for the generation and optimization of molecules (de novo molecular design), which combines a genetic algorithm based on the SELFIES string representation and a trained discriminator. \nThe performance of the method is then shown on a small number of optimization tasks, and analyzed in detail.\n\nOverall, this reviewer thinks this is a very interesting approach with a lot of potential, however, the experimental validation could be stronger.\n\n\nEmbedding in previous work:\nSeveral key references should be added. In particular, this reviewer would suggest that the paper from the AZ group (https://arxiv.org/abs/1701.01329) is added, \n which first introduced the language model (LM)-based class of molecule generation models, and the RL paradigm of a molecule-generating agent, which takes actions in an environment to construct a molecule, receiving reward from an external scoring function.\nAlso, the previous paper by Liu et al (“Constrained Graph Variational Autoencoders for\nMolecule Design”, NeurIPS 2018,  https://arxiv.org/pdf/1805.09076.pdf ) should be cited, in particular, because it highlights the competitiveness of the LM based baselines.\n\nIn Table 2, it would be great to include a reference to the DEFactor paper from Yoshua Bengio’s lab (https://arxiv.org/abs/1811.09766), which achieves comparable performance to the strongest baseline.\n\nIn addition, the authors should cite earlier work on using GAs for de novo design, which have a rich tradition in chemoinformatics since the 1990ies.\n\nExperimental:\n\nRe 4.1. In the unconstrained optimization task, several baselines are missing. In particular, a language model + RL baseline should be considered. This model has also shown strong performance (in terms of optimization and quality) in the state of the art benchmark set (Guacamol https://pubs.acs.org/doi/10.1021/acs.jcim.8b00839 ) -  the code is available on github\n\nCan the authors explain why they believe the physchem only function ”log(P) - SA(m) - RingPenalty(m)” is a relevant scoring function for the tasks that are faced in real life drug and materials discovery? It would be great if the authors would consider using the Guacamol benchmarks which have been designed by domain experts to allow a more fine grained assessment on tasks relevant to practical drug and materials design, while still being tractable computationally. Also, the guacamol paper provides a benchmark to assess the quality of molecules, which is currently missing in the present work.\n\nRe 4.2. And 4.3.\nThe long term experiment and the molecule class exploration analysis are great, and well presented. I like the analysis of how the different classes emerge. However, are you sure that the GA is not just exploited the deficiencies of the rdkit logP calculator (which itself is just a model) by creating the molecules with the long sulfur chains? Also, I am not sure that it is likely that one would be able to synthesize these molecules in the lab.\n\nRe 4.4\nThe results on the constrained optimization are impressive, however, it is not really clear if the GA is not simply exploiting deficiencies in the scoring function again.\n\n\nOverall, this reviewer believes the proposed model is very promising (in particular also because GA’s are cool), however, the experimental validation could be more rigorous, which can be addressed by considering the guacamol benchmarks. \n"}