{"title": "Great work; Important and interesting problem; Missing some details", "review": "Paper summary:\nThe paper proposes to predict bouncing behavior from visual data. The model has two main components: (1) Physics Interface Module, which predicts the output trajectory from a given incoming trajectory and the physical properties of the contact surface. (2) Visual Interface Module, which predicts the surface properties from a single image and the impact location. A new dataset called Bounce Dataset is proposed for this task.\n\nPaper strengths:\n- The paper tackles an interesting and important problem.\n- The data has been collected in various real scenes.\n- The idea of training the physics part of the network with synthetic data and later fine-tuning it with real images is interesting.\n- The experiments are thorough and well-thought-out.\n\nPaper weaknesses:\n- It would be more interesting if the dataset was created using multiple types of probe objects. Currently, it is only a ball.\n\n- It is not clear how the evaluation is performed. For instance, the length of the groundtruth and predicted trajectories might be different. How is the difference computed?\n\n- The impact location (x,y) corresponds to multiple locations in 3D. Why not using a 3D point as input? It seems the 3D information is available for both the real and synthetic cases.\n\n- Why is it non-trivial to use a deconvolution network for predicting the output point cloud trajectory?\n\n- The length of the input trajectory can vary, but it seems the proposed architecture assumes a fixed-length trajectory. I am wondering how it handles a variable-length input.\n\n- How is the bounce location encoded in VIM?\n\n- I don't see any statistics about the objects being used for data collection. That should be added to the paper.\n\n>>>>> Final score: The authors have addressed my concerns in the rebuttal. I believe this paper tackles an interesting problem, and the experiments are good enough since this is one of the first papers that tackle this problem. So I keep the initial score. \n", "rating": "8: Top 50% of accepted papers, clear accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}