{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper tackles the interesting problem of motion synthesis for an interactive task, namely, sitting down on a chair from various starting positions. Solving such tasks is quite desirable specifically for the computer graphics community. However, not enough progress has been made in this direction. The authors present a method that tries to solve this problem using a hierarchical approach and they compare their method with several other methods. Finally, the authors use their method to synthesize the motion of a virtual character interacting with a real scene.\n\nI believe that in the current state, this work is below the acceptance threshold. The authors succeed in proposing a method that solves the original problem with a non-trivial success rate (just above thirty percent on the Easy setting). However, the motion quality is well below satisfactory, specifically for a method that makes use of motion capture data. Moreover, the proposed method is lacking in novelty and the baselines seem inappropriate. I believe the authors should compare their methods with more appropriate methods such as [1, 2, 3] which are cited below. Finally, the synthesis of a virtual character interacting with a real scene is an interesting use-case of this work. However, I believe that it has little to do with answering the question: what is the best method to solve the original task?\n\nSome questions or points of discussion:\n - (major) Would the authors please describe the kinematics-based method in more detail? I did not understand this method at all.\n - (major) As a follow-up, it seems like both the non-hierarchical methods are ignorant of the position of the chair. Maybe I am missing something, but what exactly is the point of comparing with a method that has no chance of success?\n - What is the definition of success for the task of turning left or right?\n - (minor) Do the controllers directly control the torques is any method such as a PD-controller used?\n - (minor) The activations used in the networks are not specified.\n - (minor) Equation 7 requires a minor edit\n - (very minor) The reward formulations used in the paper, i.e. the exponential of negative of a distance, are usually used for their interpretability and as such the weights are usually set so that they add up to 1. It just seems odd to me that this is not the case here and was wondering if there was any reason to do so.\n\n\nMissing references:\n [1] Xue Bin Peng and Michael Chang and Grace Zhang and Pieter Abbeel and Sergey Levine. MCP: Learning Composable Hierarchical Control with Multiplicative Compositional Policies.\n [2] Josh Merel, Leonard Hasenclever, Alexandre Galashov, Arun Ahuja, Vu Pham, Greg Wayne, Yee Whye Teh, Nicolas Heess. Neural probabilistic motor primitives for humanoid control.\n [3] Josh Merel, Arun Ahuja, Vu Pham, Saran Tunyasuvunakool, Siqi Liu, Dhruva Tirumala, Nicolas Heess, Greg Wayne. Hierarchical visuomotor control of humanoids."}