{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper presents a hierarchical approach to learn how to sit. \n\npro: the learning to sit task is novel.\n\nHere are some questions:\n\n(1) \"However, their metatask only requires a single subtask (i.e. walk), and the meta controller focuses solely on steering. We address a more complex task (i.e. sitting onto a chair) which requires the execution of diverse subtasks (e.g. walk, turn, and sit).\"\nThis is not accurate. Peng et al also handles turning, although not in the context of subtask, see e.g, this video clip:https://youtu.be/hd1yvLWm6oA?t=289.\nAlso see Robust Recovery Controller for a QuadrupedalRobot using Deep Reinforcement Learning:https://arxiv.org/pdf/1901.07517.pdf?fbclid=IwAR21IneQ5Lusw62bCyh0oDzRJYh2nKercXP53vp35dIGtT-edIcITZBeetc and NEURAL PROBABILISTIC MOTOR PRIMITIVES FOR HUMANOID CONTROL:https://arxiv.org/pdf/1811.11711.pdf, https://arxiv.org/pdf/1811.11711.pdf. These papers also present hierarchical learning with several subtasks.\n\n(2)The authors use curriculum learning first to learn easy tasks, then to learn more difficult tasks. How do you prevent forgetting the easy task while learning the more difficult ones?\n\n(3) kinematic non-hierarchical baseline: since the kinematic motion couldn't complete the task, I don't see any reason why using it as a reference motion for RL will constitute a reasonable baseline. At the very least, a reward for distance to the chair should be available.\n\n(4) I am confused about the differences between the two hierarchical baselines. Looks like they are both just trying to do the subtasks in one particular order. And it is not surprising that one side turning has a lower success rate. I will expect that it only has half the success rate as the full model, while in fact, the success rate is quite comparable to the full model (left turning only). Any particular insight from the authors about this?\n\n(5) Why the different success rates between the left turn and right turn? If the humanoid model is symmetric, I will imagine left turn and right turn tasks are very similar. And I am confused about the success rate. If the initial pose is the same and the simulation is deterministic, why will different runs produce different results? Is the policy during test time stochastic?\n\n(6)The video shows a lot of repeated (or very similar) motions. It will be interesting to show some of the failure cases instead.\n\nWhile this paper tries to solve a novel task. Based on the success rate of the result (32 % for easy setting and 10 % for the hard setting) and various problems mentioned above, I think there is still a lot of improvement to be made."}