{"title": "Interesting attack but an unclear paper with limited experimental support.", "review": "The paper presents an evaluation methodology for evaluating attacks on confidence thresholding methods and proposes a new kind of attack. In general I find the writing poor, as it is not exactly clear what the focus of the paper is - the evaluation or the new attack? The experiments lacking and the proposed evaluation methodology & theoretical guarantees trivial.\n\t\nMajor remarks:\n- Linking the code and asking the reviewers not to look seems like bad practice and close to violating double blind, especially when considering that the cleavhans library is well known. Should have just removed the link and cleavhans name and state it will be released after review. \n\n- It is unclear what the focus of the paper is, is it the evaluation methodology or the new attack? While the evaluation methodology is presented as the main topic in title, abstract and introduction most of the paper is dedicated to the attack.\n\n- The evaluation methodology is a good idea but is quiet trivial. Also, curves are nice visually but hard to compare between close competitors. A numeric value like area-under-the-curve should be better.\n\n- The theoretical guarantees is also quiet trivial, more or less saying that if a confident adversarial attack exists then finding the most confident attack will be successful. Besides that the third part of the proof can be simplified significantly.\n\n- The experiments are very lacking. The authors do not compare to any other attack so there is no way to evaluate the significance of their proposed method\n\n- That being said, the max-confidence attack by itself sounds interesting, and might be useful even outside confidence thresholding.\n\n- One interesting base-line experiment could be trying this attack on re-calibrated networks e.g. “On Calibration of Modern Neural Networks” \n\n- Another baseline for comparison could be doing just a targeted attack with highest probability wrong class.\n\n- I found part 4.2 unclear \n\n- In the conclusion, the first and last claims are not supported by the text in my mind. \n\n\n\nMinor remarks:\n\n- The abstract isn’t clear jumping from one topic to the next in the middle without any connection.\n\n- Having Fig.1 and 2 right on the start is a bit annoying, would be better to put in the relevant spot and after the terms have been introduced.\n\n-In 6.2 the periodically in third line from the end seems out of place.\n\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}