{"title": "Good results, but the contribution to \"denoising\" does not hold given the current version", "review": "This paper proposes a new open-domain QA system which gives state-of-the-art performance on multiple datasets, with a large improvement on QuasarT and TriviaQA. Given the significant results, I would vote for its acceptance.\n\nThe contributions of the paper can be summarized into two parts. The first is an efficient base open-domain QA model; and the second includes several denoising methods of passage selection. I hope the authors could address the following issues during rebuttal, which I believe will make the paper stronger.\n\n(1) The proposed base open-domain QA method (+DISTANT) itself improves a lot, which I think is the major contribution of the paper. It will be very helpful if the authors could provide ablation test to the sentence discriminator/reader modules to give better clues about why it works so well. Is it mainly because of the usage of DrQA style encoder?\n\n(2) Although the paper has \"denoising\" emphasized in the title, I actually do not see this holds as a contribution. First, the proposed semantic labeler training strategies only improve significantly on TriviaQA. The improvement on Quasar-T and SearchQA is relatively marginal. I am wondering whether this is because the domain shift between SQuAD and QuasarT and SearchQA.\n\n(3) (Cont'd from point 2) Second, the proposed SSL and CSL are not compared with any decent baselines. It will make more sense if the authors apply the Re-Ranker or S-Norm to the proposed base open-domain QA model, and compare the improvement from different methods (Re-Ranker, S-Norm, SSL, CSL). It is likely that the S-Norm could also improve on TriviaQA and the Re-Ranker could improve over Quasar-T and SearchQA. Therefore without any experimental evidence, again, the \"denoising\" part cannot be regarded as a contribution with positive results.\n\nAdditional question: would the authors release the code for public usage if the paper gets accepted?", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}