{"title": "Good Empirical Performance, Questionable Scalability", "review": "The paper proposes a deep architecture that conducts survival analysis from longitudinal data where multiple competing risks are present. Experimental results demonstrate the effectiveness of the proposed method.  Specific comments follow:\n\n1. A primary concern in the reviewer's opinion is the scalability of the architecture. While the reviewer appreciates the discussion of the scalability issue in terms of the output layer in the paper, the architecture might also not scalable if the number of competing risks is large because of the increase of the cause-specific subnetworks in the architecture.  Overall, the reviewer finds the lack of a principled approach to deal with competing risks and long time horizon presented in the paper.  Since dealing with competing risks in survival analysis is the goal of the paper, the reviewer finds the method presented insufficient for acceptance. As a remedy, for example, for the output layer, can the author consider the use of a neural net to model o_k at a particular time using time and f_{c_k}() as input?\n\nOther issues:\n2. it will be nice to explain (1) and (2) a little after presenting the formula.\n3. page 5, $\\mathbf{y}_j$ should also be explained because the next place where $\\mathbf{y}_j$ is present is (4), which is one page later.\n4. the term \"dynamic survival analysis\" is also obscure. What exactly does \"dynamic\" mean? To the reviewer's understanding, compared to standard survival analysis, the architecture models directly from raw longitudinal data of repeated measurements, and hence is called \"dynamic\".\n5. even the \"dynamic\" part of the dynamic survival analysis is not very novel, see, for example, \nRecurrent Marked Temporal Point Processes: Embedding Event History to Vector\nand the follow-up works in the use of deep learning for point process modeling.\n\n===============After Reading Authors' Response ================\nThe reviewer would like to thank the authors for their detailed response and careful revision of the paper to address the reviewer's concern. However, the reviewer is not persuaded by the authors' response. Specifically,\n\n1. the reviewer is not satisfied with the explanation and modification to address the scalability issue stemming from both the cause-specific subnetworks and the output layer. Simplifying the structure and parameterization of cause-specific subnetworks when many are present seems like a comprise rather than a principled approach to address the issue. The same is true for the exponentially distributed parameterization of the output layer.\n\n2. It is the reviewer's impression that for point process neural networks, it is possible to use the covariate information for prediction, as opposed to the claim given by the author.\n\n\n\n", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}