{"title": "Seems like a solid survival analysis work, but not a good fit for ICLR", "review": "Summary:\nThe authors propose Dynamic-DeepHit, a survival analysis framework for modeling longitudinal data with multiple competing risks. As opposed to previous works, Dynamic-DeepHit can model survival events (e.g. death, cancer relapse) which can be driven by multiple, potentially competing, underlying risks. The proposed model uses an RNN shared across multiple risks for processing past-to-recent measurements, and multiple feedforward nets that accept the most recent measurements and the hidden layer of shared RNN. Joint predictions (across time and competing risks) are made using a softmax layer. The model is tested on two datasets where Dynamic-DeepHit outperforms other baselines.\n\nPros:\n- Detailed explanation of survival analysis formulation.\n- Experiments across multiple aspects: prediction performance, explaining the variable importance, visualizing the RNN hidden states\n\nIssues:\n- As the selling point of this model is its ability to capture competing risks, it is not very convincing that the experiments were conducted with only two competing risks. Can Dynamic-DeepHit truly capture multiple competing risks?\n- The prediction performance was measured by \"cause-specific time-dependent concordance index\", which is described by Eq.5. But Eq.5 alone does not intuitively explain what it is trying to measure.\n- Mayo Clinic data also has two competing risks, but Table 2 only shows the prediction performance for one risk, with the justification \"liver transplant prediction is not in our interest\". For the thoroughness of the experiments, why not put the complete result?\n- All other issues aside: I can see that the authors put considerable effort into this work. But the effort is mainly focused on survival analysis, rather than learning representations. The novelty of this work regarding learning representations seems limited to me, as opposed to the contribution on improving survival analysis & medical prediction. This work would be much better received if submitted to a more relevant venue.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}