{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper proposes Coaching for semi-supervised learning. The teacher generates pseudo labels for unlabeled data and the performance of the student on labeled data is used as a reward to train the teacher. The empirical results are very impressive.\n\nOverall, the paper is clear and easy to follow. The idea looks interesting to me. However, I find that there are some weaknesses.\n\nFirst, the method is not well-motivated in the Introduction section.\n\nSecond, the derivation of the teacher's update rule is incorrect. In Eq. (11), $g_S^{(t)}(\\hat y_{unl})$ is a vector, $\\frac{\\partial \\ell(x_{unl}, \\hat y_{unl}; \\theta_T)}{\\partial \\theta_T}$ is also a vector. What do you mean by multiplying two vectors? The left side of Eq. (11) is a matrix while the shape does not match on the right side.  It is incorrect to get Eq. (3) from Eq. (11), especially the transposed $g_S^{(t)}$. Where does the transpose come from?\n\nAnd $g_T^{(t)}$  in Eq.(3) is inconsistent with line 6 in Algorithm 1, where $\\eta h^{(t)}$ is not included in $g_T^{(t)}$.\n\nFor experiments, I wonder what is the performance of pure Coaching without RandomAugment and the consistency loss/UDA in Table 1. I think this is a fair comparison with the baselines like Mean Teacher and VAT. I suggest adding this to the ablation study as well.\n\nAnd I expect more explanations on the \"additional implementation details\". For example, why is it correct to use cosine distance instead of the dot product? In this case, is it a valid gradient? Same for other tricks. We need to understand why it works apart from adding a bunch of tricks together. And I doubt whether the improvement is due to these tricks or the method itself.\n\nI would be willing to increase the score if all the concerns are addressed in the authors' response.\n"}