{"title": "Not much novelty/limited scope", "review": "The authors present a model to compose two synthetic objects into a whole. The idea is to learn networks that can perform geometric transformations to objects, compose them into a target configuration and then learn to decompose. Results are shown on synthetic data of chair and table; bottle and basket, and one real dataset. Presumably, the idea is that the learned representations can generalize to some other task where object compositionality is useful; however I did not see such an experiment.\n\nIn this paper, the authors suggest that they have learnt object compositionality without any \"explicit\" prior information about object layout. But the use of segmentation masks seems to be an important prior, which somewhat weakens the claim, is it not?\n\nI found the paper somewhat hard to parse owing to excessive use of notation and verbose writing. It is better for the authors to be precise and to the point. It took me 3-4 readings of the paper to understand the setup and architectures. The novelty of the paper is somewhat limited - it mostly consists in plugging together existing architectures in a somewhat obvious and incrememental fashion. The experiments are fine, but they left me with questions:\n\n1. Is it a surprise that the network learnt to compose objects and inpaint over occluded regions? Given that the data and training was explicitly setup to achieve this in a carefully controlled synthetic environment, I find it not a very interesting result.\n\n2. What might have been more interesting is if the representations learnt were used for various tasks such as 3D pose estimation. Did they try such experiments?\n\n3. For all the 3 datasets, what are the failure cases? How far out of train regime can you go before the inference network also stops working? \n\nI request the authors to address the above questions in their rebuttal.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}