{"title": "Interesting bio-inspired sequence prediction network explaining familiarity effects in early and late visual system.", "review": "The authors propose a biologically inspired ANN to predict a video sequence, that performs better than previous biologically inspired video sequence predictors (>PredNet and >PredRNN+).  Their model also accounts for familiarity effects (i.e. decrease in neural activations when repeatedly presenting the same visual sequence) found in primate early visual system V1/V2 (data recorded for this article) and late visual system IT.\n\nThis work is interesting because it proposes a sequence prediction technique that accounts well for familiarity effects found in different regions of the visual system.\n\nHowever one of the claims does not seem supported by data:\n\n1. The authors claim repeatedly that using the prediction error framework is computationally more efficient than alternatives but they do not show this.\n\nFurthermore, the article would benefit from the following clarifications:\n\n2. It is unclear how their network performance compares to state-of-the-art NON neurally plausible models of sequence prediction.\n\n3. It is unclear from the introduction how they modified the network proposed by (Pan et al) to obtain their network. \n\n4. \"The SSIM index over time shows that the C-C method is more effective than C-F method, for C-F method performs better than C-C method in the short term perdiction when ground truth images are provided, but setting sliding window is too time-consuming, much more than the performance increase\"\nPlease clarify this statement.\n\n5. Macaque experiments: Some experiments on macaques were performed for this article, but there is no mention of ethical guidelines and whether they were respected.\n\n6. Many typos are present in the text!\n\nI believe this work at the intersection of deep learning and neuroscience is an interesting contribution for both fields. However, the paper would benefit from these clarifications and a thorough proof-reading for the many typos present in the text. \n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}