{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "First I must state that this paper is not within my area of expertise. I'm leaning towards recommending accepting the paper, but this recommendation comes with high variance.\n\nThe paper investigate different neural network architectures for 3D point cloud processing. A set of published architectures are studied in terms of robustness towards adversarial attacks, rotational robustness and neighborhood consistency. To do this, the paper propose a set of metrics for measuring such robustness and compute these under various datasets.\n\nOverall, I am happy that the authors provide a set of hypotheses and conduct experiments verify/debunk these. Not being within this field I cannot determine the potential impact of the gained insights. Are there any surprise conclusions from this study or does it verify what was already known?\n\nIt is not entirely clear to me how I can operationalize the findings of the paper. For example, if I want to design an architecture that is robust to both rotations and adversarial attacks, does the paper tell me which building blocks to use in my architecture? This aspect was not clear to me.\n\nRegarding the applied metrics, then I would like to hear how they are different from the ones proposed by Ma et al. (the authors name this as their main source of inspiration).\n\nIn metric 2, I did not understand the notions of \"foreground\" and \"background\". Should I merely think of \"background\" as being outliers? Sometime background information carry relevant information on the foreground; sometimes the background information is not present. How does this work?\n\nWhen taking the expectation of the Jensen-Shannon divergence, is this done by sampling? If so, are there practicalities that should be discussed in the paper?"}