{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors propose a semi-supervised learning model, named as Flow Gaussian Mixture Model (FlowGMM). The model is learnt by maximizing the join likelihood of the labeled and unlabeled data with a consistency regularization.\nThe authors demonstrate that the proposed model outperforms others on text classification; for image classification, the performance can be improved in future.\nAlso the authors demonstrate that the model is interpretable via feature visualizations.\nOverall the paper is fine written.\nYet, The conclusion is not fairly supported and the paper could be much stronger with the issues discussed already but I don’t think its current form is ready yet.\n\nBelow are more detailed comments:\n0) It would be nice to add the definition of the performance metric; without the definitions, none of the numbers in the tables would make sense. \n1) The main result for text classification in Table 1 is reporting the best of 3 runs, which can’t support the conclusion that the proposed method outperforms the other. In general, it’s nice to provide statistical significance comparing two models or reporting the mean and std across multiple runs. \n2) In Table 2, it’s not clear what conclusion could be drawn by comparing the performance of supervised and semi-supervised performance. Are the testing data points the same?\n3) The feature visualization as discussed in Section 6.3 is not explained clear. Specifically, “giving us insight into the workings of the model” is not clear; what exactly insight can we get and what exactly are the workings can we get?\n"}