{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper proposes deep neural forest (DNF), which targets tabular data and integrating strong points of gradient boosting of decision trees (GBDT). The algorithm is composed by: (i) a neural tree (NT), which is constructed using soft binary OR and AND gates (multi-layered), (ii) a deep neural tree (DNT), which is a stack of layers of NBs with dense residual connections, and (iii) deep neural forest (DNF), which is a weighted ensemble of DNTs. A synthetic checkboard game (which is an extension of XOR problem) is used for illustration of the algorithm strength. Nine Kaggle datasets are used for experiments with comparison to XGBoost and FCN, and in about a half datasets, DNF outperforms them. Lastly, multi-modal task HRI-DD is used to show the integration ability of DNF with deep models.\nThe motivation of the paper is good: we need some systematic approach to apply deep neural networks to tabular data. How to incorporate specific inductive bias is a key. However, the paper is not enough convincing. Although AND and OR construction seems valid, there may be many different variants to incorporate the bias. More detailed comparison with other settings are needed. For example, I don’t understand how much the dense residual connection contributes to the performance. Besides, the rationale to select the dataset used in the experiment should be explained. There are various kinds of datasets and why do the authors pick some? Is it because they are appropriate for AND-OR feature construction? Or is it just random? More elaborate experiments may improve the paper a lot.\n"}