{"title": "Technically unsound work", "review": "This paper presents a framework for understanding why seq2seq neural response generators prefer \"universal\"/generic replies. To do so the paper breaks down the response generation probability into the probability of selecting the set of tokens (reflecting the topic of the output) and then selecting an ordering of the tokens (reflecting the syntax of the output.)\n\nThe results presented in this paper are not technically sound. E.g the derivation in Eq(2) derive a meaningless bound. Here is why:\n1. The first equality assumes that the words in a set are independent which is not true.\n2. In the second equality, the authors incorrectly replace the summation of word probability in each sentence with the summation of word probabilities over all unique words (the set) overall sentences. This is simply not true if there are common words shared between sentences.\n3. Perhaps the biggest issue is the incorrect application of Jensen's lemma. JL is often used as \nlog(\\sum_i a_i x_i) > \\sum_i a_i log x_i if \\sum_i a_i = 1. Instead what authors have used is \nlog (\\sum_i x_i) > \\sum_i log(x_i), which is not always true, and is trivially true for all x_i < 1. In fact, this bound is not even tight (unlike Jensen's lemma) and the *worst* part is that the LHS increases if we add more x_i (<1) and the RHS decreases. This means this bound is far from being meaningful and as such should be summarily ignored.\n\nSimilarly, in section 2.3, the technical content is quite poor. Why is this true -- \"the amount of possible queries M of y... 1 << M \\propto N\"? There are many assumptions in lemma 3 that are quite difficult to unpack to verify the correctness e.g. can the most frequent words not occur at all in \"non-universal\" replies? I am not going more into the details in this section because I think the problems with section 2.2 are themselves dealbreakers.\n\nOverall, given the problems this work is not technically sound to be accepted.", "rating": "1: Trivial or wrong", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}