{"title": "Interesting approach  for aligning partially heterogeneous knowledge graphs", "review": "<Summary>\nAuthors propose a new approach for aligning partially heterogeneous knowledge graphs, which allows for unsupervised / semi-supervised alignment via GANs that serve as: (1) triplet discriminator and (2) entity distribution matching.\n\nThe paper reports big improvement over their baseline approaches especially for unsupervised and weakly-supervised settings. The experiment is performed for various combinations of several small KG datasets (both simulated - artificial division of a KB - and real multi-lingual KG triple datasets). The authors also report ablation studies over multiple optimization algorithms as well as reward functions,\n\n<Comments>\n- As far as I know, the idea of applying GAN for triplet discrimination has not been tried before, and it is a novel contribution of the authors. The prior literature has focused primarily on distribution matching / regularization only, often via MMR, autoencoders, GAN training, etc.\n\n- While the idea of applying adversarial approaches is new in the context of KG alignment, the technical novelty of each component is limited, and borrowed directly from existing literature with minor modifications.\n\n- It would be interesting to report results at varying controlled conditions (e.g. as a function of % of label overlaps, etc.) to better study the empirical effects of each training component, etc.\n\n- Experiments are only conducted on smaller 15K subsets of FB KG datasets. It would be interesting to run experiments on larger subsets and see if the proposed approaches can scale.\n\n- The alignment is applied only on a simple TransE algorithm.  While the author’s formulation is flexible and shouldn’t restrict application of other state-of-the-art graph embedding methods, it is not clear if one will see the same improvement.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}