{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper studied the problem of black-box adversarial attack generation by leveraging Bayesian optimization (BO).\n\nMerits of this paper:\n1) The combination of BO and dimension reduction, which makes BO more efficient under a low-dimensional space. \n2) Good experiment results.\n\nComments/questions about this paper:\n\n1) Comment on \"Finally, to the best of our knowledge, the only prior work that uses Bayesian optimisation is a workshop paper by...\". BO was also used for generating black-box adversarial examples at https://arxiv.org/pdf/1907.11684.pdf\nThis is a missing related work, and please elaborate on the differences. \n\n2) The presentation of the proposed algorithm is not clear. Please explicitly state the acquisition function. And how to tune the hyperparameter in the acquisition function? What decoder is used in experiments? Have authors tested the sensitivity of the decoder (not reduced dimension)?  \n\n3) In experiments, the authors mentioned \"we randomly select 3 correctly classified images for each class from CIFAR10 test data which sums up to 27 CIFAR10 images, and randomly select 7 correctly classified images from MNIST test data.\"\nI feel that the number of tested images is not sufficient. How about conducting experiments on a large number of tested images for untargeted attack?\n\n4) In Table 1, what does 0,0,0, mean in ZOO? \n\n5) It is known that BO has itself parameter to tune, and is not computationally efficient. It might be good to show the computation efficiency of BO for different reduced dimensions together with the corresponding attack performance. \n\n6) The convergence of BO is usually not stable. However, Figure 3 shows that BO converges very smoothly in terms of ASR. Could authors also show the loss value of using BO-attacks against iteration numbers? \nMeanwhile, in Figure 3 is the best ASR  (up to the current query counts) reported or the ASR at the current query number?\n\n\nBased on the aforementioned questions, my initial rating is weak reject. \n\n\n"}