{"title": "Some important related studies are missing.", "review": "\nI have several concerns about this paper.\n\n[originality]\nSome important related studies are missing.\n\n# Related studies about the perspective of “area”.\nThe consecutive position in sequence is often referred to as “span” in NLP filed, which is identical to what the authors call “area” in this paper.\nThen, the idea of utilizing spans currently becomes a very popular in NLP field. We can find several papers, \ne.g.,\nWenhui Wang, Baobao Chang, “Graph-based dependency parsing with bidirectional lstm”, ACL-2016.\nMitchell Stern, Jacob Andreas, Dan Klein, “A Minimal Span-Based Neural Constituency Parser”, ACL-2017.\nKenton Lee, Luheng He, Mike Lewis, Luke Zettlemoyer, “End-to-end Neural Coreference Resolution”, EMNLP-2017.\nNikita Kitaev, Dan Klein, “Constituency Parsing with a Self-Attentive Encoder”, ACL-2018.\n\nSimilarly, there are several related studies in image processing field,\ne,g.,\nMarco Pedersoli, Thomas Lucas, Cordelia Schmid, Jakob Verbeek, “Areas of Attention for image captioning”, ICCV-2017\nQuanzeng You, Hailin Jin, Zhaowen Wang, Chen Fang, and Jiebo Luo, “Image Captioning with Semantic Attention”, CVPR-2016.\n\n# Related studies about the perspective of “structured attention”. \nSeveral papers about structured attention have already been proposed, \ne.g.,\nYoon Kim, Carl Denton, Luong Hoang, Alexander M. Rush. “Structured Attention Networks”, ICLR-2017.\nVlad Niculae, Mathieu Blondel. “A Regularized Framework for Sparse and Structured Neural Attention”, NIPS-2017.\n\n\nI think the authors should explain the relations between their method and the methods proposed in the above listed papers.\n\n\n[significance]\n# Concern about experimental settings\nThe experimental setting for NMT looks unnormal in the community.\nCurrently, most of papers use sentences split in subword units rather than character units. I cannot find a reason to select the character units. I think the authors should report the effectiveness of the proposed method on the widely-used settings.\n\n\n# computational cost\nThe authors should report the actual calculation speed by comparing with the baseline method and the proposed method.\nIn Sec. 2.2, the authors provided the computational cost. \nI feel that the cost of O(|M|A) is still enough large and that can unacceptably damage the actual calculation speed of the proposed method.\n\n\n\nOverall, the proposed method itself seems to be novel and interesting.\nHowever, in my opinion, writing and organization of this paper should be much improved as a conference paper. I feel like the current status of this paper is still ongoing to write.\nThus, it is a bit hard for me to strongly recommend this paper to be accepted. \n\n\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}