{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper show that view prediction learning to help 3D detection. They explored the link of view predictive learning and the emergence of 3D perception in computational models of perception, on mobile agents in static and dynamic scenes. The whole paper is very well written, and organized.  In general, the whole model is quite straightforward, and quite heavy, while most components come from existing papers. It’s really a good engineering work in term of integrating them together. I have several comments.\n\nhow’s the proposed model different from [1], and [2]? Only Tung et al. (2019) is employed as baselines; and it’s really hard to tell whether the proposed model is SOTA.\n\n(2) The model is still built upon Tung et al. (2019)  with several novel components, including handling more general camera motion beyond the a 2-degree-of-freedom sphere-locked camera. \nI would like to check how significant this point? Particularly, how’s the performance of the model variant without using this component (just 2-degree-of-freedom sphere-locked camera) ?\n\n(3) In  Fig.5, it is very interesting that, the results of  Estim.-stabilized 3D flow are even better than those of GT-stabilized 3D flow, when recall>0.5. Any insight here?\n\n(4) The setting of SEMI-SUPERVISED LEARNING OF 3D OBJECT DETECTION is quite unclear and sloppy. What dataset are used as the labeled, and unlabelled images? how many labeled images?   \nAlso not quite unclear about the settings in UNSUPERVISED 3D MOVING OBJECT DETECTION.\n\n(5) Any chance to give some evaluation about the significance of components introduced in the model? This may give us more insights about the model. I notice that some experimental results may reflect some perspective of this point, while it may be better to explicitly discuss it. \n\n\n[1]  Implicit 3D Orientation Learning for 6D Object Detection from RGB Images. ECCV 2018\n[2]  PerspectiveNet: 3D Object Detection from a Single RGB Image via Perspective Points. NeurPIS 2019"}