{"title": "Non linear 'channel aggregation' to improve on 3D convs and various 3D pooling methods. Badly written paper with low novelty and limited and unconvincing empirical evaluation.", "review": "Summary\nThe paper proposes a method for channel aggregation in CNNs for the task of human action \nrecognition. The main component proposed is the nonlinear channel aggregation layer (NCAL) which can \nbe potentially inserted in any CNN architecture. Empirical results are reported on UCF101 and \nHMDB51.\n\nGeneral comments:\nThe paper is not very well written and it's hard to fully understand it. From the related works \nsection I deduce that the method proposed competes with 3D convs and 3D pooling methods in some way. \nWith this assumption my specific points are as follows.\n                                              \n                                       \nPositive                        \n- The general direction is somewhat interesting, i.e. the current methods methods do a linear \n  computation over the channels at any intermediate step of the CNN architecture, this paper aims to\n  explore more complex nonlinear computations. \n  \n  \nNegatives:\n- The paper is badly written with many hard to appreciate parts e.g.\n\n\"We conjecture that there is complex nonlinear relationship among the channels of CNN features. Once\nthis implicit relationship is explicitly modeled, such accomplishment will facilitate converging\nwith faster search to the optimal trajectory.\"\nWhat exactly do you mean by the implicit relationship? How would you get ideas to explicitly model \nit?                                                                                         \n\n\"these temporal pooling and variants tend to result in the reduced resolution, which will achieve\ncoarse classifications\"                 \nIn what sense reduced resolution, eventually everything has to be reduced to a #classes size vector \ngiving the probability of the classes. How would you fix this?\n\n- The main equation (3) is not understandable, G is said to be the \"linear kernel functions of \n  NCAL\", what is that? and what does G(cp) mean, what is p?\n\n- The positioning of the paper is also not very clearly defined, sometimes it argues as being an \n  improvement of 3D pooling, while at others it seems to try and improve frame aggregation\n  for video representation. This should also be clearly clarified and discussed.\n\n- The exprimental results are also not very convincing, on UCF101 compared to the baseline accuracy \n  of 79.5 the best NCAL version gets 80 (and this is not the cross-validated value) while on HMDB51 \n  it gets 50 cf. std CNN's 49.7\n\n\nUnfortunately, overall the paper is hard to understand and the empirical evaluation is not \nconvincing.\n\n", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}