{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The paper proposes a network architecture for video-to-video translation. The architecture is essentially an encoder-decoder  with recurrent units in the latent space for modeling the motion dynamics.  \n\nThe paper is quite poorly written. \n- The title doesn't say much about what is in the paper.\n- The paper is barely motivated and it seems that the goal of the paper is just to improve the video to video translation quality for no good reason. \n- Related work study is mixed with the introduction in a not coherent way.\n- The main contributions of the paper is not clearly stated.\n- In the experimentation section, there is almost no analysis of the results to provide reader with insights. \n- The strongest point of the paper is their experimentation which still can be improved. All of the experiments are on a SINGLE dataset which makes the quantitative results less than acceptable. \n- For a video paper, unfortunately the authors did not provide any video (in the forms of supplementary material) which makes qualitative compression hard as well. \n- The authors compared their model to an \"Improved Recycle-GAN\" but they did not provide any details on what this version is!\n- Comparison with vid2vid is missing from Table 3 to 5 and only appears in Table 6. \n\nOverall, the paper (in the current written form) is weak with marginal contribution at best, surely not suitable for a top conference such as ICLR. Only weak rejecting the paper since this is not my primary area of research (although I'm quite familiar with it), so maybe I'm missing something ..."}