{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper introduces a method to prune networks at initialization in a way that (mostly) preserves the gradient flow through the resulting pruned network. This is a direct improvement over previous methods (e.g. SNIP) which have no guarantees that pruned connections will break the gradient flow and thereby harm learning.\n\nI quite like this paper, the motivation and results are convincing and it is well presented. The writing is excellent for most of the paper. From section 5 onwards the writing does need quite a bit of editing, as its quality is significantly reduced from what came before.\n\nSome detailed comments:\n- Figure 1 is very nice and really clarifies the idea!\n- In paragraph below Equation (8): what does \"can be computed by backward twice\" mean?\n- Please specify where the equalities in equation (9) are coming from.\n- Table 3 & 4: Why are the pruning ratios different for each model?\n- Table 3: Why are values missing for the baseline for 80% and 90%?\n- Section 5.2: \"We observed that, the main bottleneck or pruned... when deriving the pruning criteria\": it's not clear where this conclusion is coming from.\n- Table 5 has no batch size results, even though you're referencing them in the text.\n\nAnd some minor comments to help with the writing:\n- Intro: \"As shown in Dey et al. (2019) that with pre-specified sparsity, they can achieve\" would read better as \"As shown by Dey et al. (2019), with pre-specified sparsity one can achieve\"\n- Equation (3): Clarify that this is a function of $t$\n- Sentence below Equation (6): \"of the pruned network, and thus our goal\" remove the \"and thus\"\n- Table 1: Specify that you're reporting accuracy.\n- Section 4.1: \"e.g. wide ResNet (Zagaruyko & Komodakis, 2016), and thus we can regard\" remove the \"and thus\"\n- Sentence below equation (9): \"encouraging the eigenspace of \\Theta align\" add a \"to\" before \"align\"\n- Sentence before section 5: \"it will encourage the eigenspace of the NTK distributing large eigenvalues in the direction of Y, which will in turn accelerates the decrease of the loss (Arora et al., 2019) and benefits to the optimization in A\" would read better as \"it will encourage the eigenspace of the NTK to distribute large eigenvalues in the direction of Y, which in turn accelerates the decrease of the loss (Arora et al., 2019) and benefits the optimization in A\"\n- Throughout section 5, write it in present tense rather than past tense. e.g. \"In this section, we conduct various experiments\" instead of \"In this section, we conducted various experiments\"\n- Sentence below table 2: you have \"the the\"\n- Second paragraph of section 5.1: \"We can observe GraSP outperform random pruning clearly\" would read better as \"We can observe GraSP clearly outperforms random pruning\"\n- Second paragraph of section 5.1: \"In the next, we further compared\" remove \"In the next\"\n- Second paragraph of section 5.1: \"Besides, we further experimented with the late resetting\" remove \"Besides\"\n- Paragraph above section 5.2: \"GraSP surpassing SNIP\" use \"surpasses\" instead\n- Paragraph above section 5.2: \"investigate the reasons behind in Section 5.2 for promoting better understanding\" would read better as \"investigate the reasons behind this in Section 5.2 for obtaining a better understanding\"\n- Section 5.2: \"We observed that, the main bottleneck\" -> \"We observe that the main bottleneck\"\n- Section 5.2: \"Besides, we also plotted the the gradient norm of the pruned\", remove \"Besides\" and the extra \"the\"\n- Section 5.2: \"the average of the gradients of the entire dataset\" use \"over the entire dataset\"\n- Section 5.2: \"hopefully more training progress can make as evidenced\" would read better as \"hopefully more training progress can be made as evidenced\"\n- Section 5.3 title would be better using \"Visualizing\" instead of \"Visualize\"\n- Section 5.3: Join the first two sentences with a comma into a single sentence.\n- Section 5.3: \"In contrast, SNIP are more likely\" -> In contrast, SNIP is more likely\"\n- Section 5.4: \"for ablation study\" would read better as \"via ablations\"\n- Section 5.4: \"we tested GraSP with three different initialization methods;\" use a \":\" instead of \";\"\n- Section 6: \"Besides, readers may notice that\", remove the \"Besides\"\n- Section 6: \"traditional pruning algorithms while still enjoy the cheaper training cost. As an evidence,\" would read better as \"traditional pruning algorithms while still enjoying cheaper training costs. As evidence,\"\n- Your citation for Evci et al. (2019) is missing the publication venue/arxiv ID."}