{"title": "Good paper; a broader analysis beyond global-local disentanglement is desirable.", "review": "The paper proposes a method to disentangle latent variables for certain factors of interest in an image by considering the original input image and a transformation of the image where information about the factors of interest is removed. The generative process is then modeled by having two latent variables --  the first responsible for generating the transformed image whereas both latent variables are responsible for generating the original input image. This inductive bias naturally enforces that the second latent variable will not model the information which the first needs to reconstruct the transformed image, due to the VAE objective penalizing redundancy in information present in the latents. The paper demonstrates this in one setting where the transformation is random shuffling of image patches, which should remove the global information of the original input image.\n\nThe methodology of the paper was concise and easy to follow. The simple inductive bias presented in the paper for disentangling local and global information is very interesting. It is not obvious that shuffling image patches at a particular scale would lead to complete loss of global information, but the paper does show results on SVHN and CIFAR10 for which global information is sufficiently disentangled. The results for digit identity clustering were great for showing the correlation between their learnt global information and label information.\n\nThe paper introduced their model as a general purpose strategy for placing desired information in latent variables using auxiliary tasks, but focus was directed to the global vs local line of analysis. While giving examples for what kind of information can be removed, the authors mentioned that color to gray-scale might be one possibility.  It would have been interesting to see this and other possibilities explored in the paper. I feel that the idea deserves a broader analysis beyond just a single choice of disentanglement.\n\nIt is mentioned in the paper that having a single inference network for the posterior as opposed to the factorized one is conceivable. I would be curious to see an analysis of how that works out as compared to the separate encoders case.\n\nOverall, the paper has a novel idea which is well motivated and executed in terms of experiments.", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}