{"title": "Nice idea. Need more justification for privacy metric.", "review": "This paper proposed a deep learning framework with three components: an obfuscator, a classifier, and a reconstructor, for privacy-preserving image classification. To protect the privacy of the image data, this paper proposed an adversarial training process to optimize the obfuscator such that it achieves high classification accuracy while the \"best\" reconstructor is not able to accurately reconstruct the sensitive input image from the output features. Experiment results showed relatively high accuracy with no sign that an input image can be reconstructed by state-of-the-art reconstruction models.\n\nThe presentation of the paper is pretty good. The problem of learning without leaking sensitive information in data is an important issue, and the paper proposed an interesting framework for it. However, I think some technical aspects need to be more addressed:\nIt seems that the obfuscator+classifier models are obtained by dividing an existing deep CNN architecture, but the paper did not justify the choice of the model or the choice of the layer as the dividing point. These seem to be important decisions in the framework, so I think more intuitions, or some heuristics for choosing them need to be provided.\nIt is not clear to me how reconstruction accuracy (measured by human’s perception) and data privacy are related. I think in general high reconstruction error does not automatically imply that the sensitive information is removed. It is still possible for a machine learning model to extract sensitive information from images that are not readable for human. So I think justifications for this choice of privacy metric need to be provided.\n\nA few things about presentation:\n1. The first sentence of Section 4: \"the our proposed framework\" --> \"the proposed framework of\"\n2. Figure 3: all lines are overlapping. I suggest explaining why and color-code the lines for better visibility.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}