{"title": "Well engineered solution, good results, somewhat limited novelty, could compare to prior art better", "review": "Summary: \nIn this paper the authors engineer a method for fully automatic de-identification, which can also be applied to videos by applying it separately frame-by-frame. The process utilizes an encoder-decoder architectures, which is trained using a combination of adversarial, reconstruction, and perceptual losses. The model also leverages features from a pre-trained face recognition model. Visually, the results look promising, but do occasionally contain some small artifacts or blurriness (albeit only noticeable when zoomed in). The de-identification process appears to work well, and with minimal change in the appearance of the face. Head pose and the majority of facial expression is also well preserved. Resulting images are evaluated using human evaluation and pretrained identity recognition models, which demonstrate quantitatively that de-identification is successful. Pixel-wise difference from the original image is also shown to be less compared to previous methods. Video samples look good and successive frames flow well with no visible flickering.\n\nPros:\n-face images appear to be successfully de-identified, while face pose and expression is preserved\n-produces smooth videos without flickering, even though applied per-frame\n-paper is well written\n-very good at including details needed for reproduction, such as hyperparameter settings\n-contains ablation study\n\nCons:\n-some faint blurriness still can be found in the resulting images \n-large number of hyperparamters that must be tuned\n-only compares with a single alternative de-identification method from 4 years ago (no comparison against modern GAN based methods)\n-ablation study has no quantitative metrics, so it is difficult to tell how much impact any individual component of the system had on the overall performance\n\nComments:\nWhile the proposed system achieves its goal of de-identified videos, its novelty is somewhat limited. Performance is achieved mainly through clever application of many existing methods, rather than any singular new idea or technique. That being said, I think that this work does present some significant improvement over previous de-identification methods, but it needs to prove it better. In the related work the authors mention several alternative de-identification methods, but they only compare with a single method from 2014. I think the paper could be made much stronger if the authors could compare against more recent techniques, especially those that also utilize an adversarial component. \n\nThe ablation study does a good job of demonstrating the impact of each component of the system visually. However, I think it could be improved if some quantitative metrics were included to measure how much improvement each component contributes to the overall performance of the system. \n\nQuestions:\nHow sensitive are the results to the hyperparameter settings? Does it require a lot of tuning in order to get good results, or is it fairly robust to the settings?", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}