{"title": "Relatively incremental novelty while better visualization results.", "review": "Summary & Pros: \nThis paper proposes monocular depth estimation with awareness of occlusion regions and edge blurriness during training. For occlusion region, it uses predicted disparity for estimating a mask map. For buryness, it modifies the network output and loss comparison strategy. The two strategies combined together yield sharper edge predictions. Though results are rather incremental for KITTI, the numbers are more significant with virtual KITTI having dense ground truth due to more pixels are evaluated around edge areas.\n\nCons: \n1: The work misses several relative works in unsupervised field for handling occlusion and boundary: \n\nComputing occlusion in unsupervised learning with videos has already been explored by optical flow prediction. \n[1] Meister et.al AAAI 2018: UnFlow: Unsupervised Learning of Optical Flow with a Bidirectional Census Loss.  \n[2] Wang et.al CVPR 2018: Occlusion Aware Unsupervised Learning of Optical Flow\nIn this paper, computing occlusion mask for stereo pair could be a special case of optical flow. I would say the author may directly apply the same strategy to obtain same mask using disparity. \n\nHandling edge and boundary for blurriness using monocular videos  was also mentioned in \n[1] Yang et.al CVPR 2018: LEGO: Learning Edge with Geometry all at Once by Watching Videos\nThe author may also apply an non-local constraint for improve the edge quality as well. Maybe should compare a strategy such as dense crf, bilateral or learning edge affinity for clear boundary learning as well. \n\n2: Other than computing mask, the major novelty of the paper is an engineered modification of  network input and output for computing loss, which I think is not sufficient for ICLR. I would suggest this to be a workshop paper.  It needs more significant contributions not only handle boundaries, maybe consider improvements of absolute estimation results. Experiments over KITTI dataset also shows a rather incremental improvement over Godard's method.\n\n\n\n", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}