{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "The authors consider the problem of learning an end-to-end multi-domain task-oriented dialogue system. Methodologically, the innovation is to learn a slot belief tracker and a domain state tracker independently and combine them to produce a join domain-slot state tracker with ‘late fusion’ — which is then used as input to a response generator. At a conceptual level, this is largely a combination of [Wen, et al., EACL17] (for the policy network to response decoder component), [Wu, et al. ACL19] (for the intuition of the state generator modified to be a transformer network), and [Lei, et al., ACL18] (mostly on the generation side). That isn’t to say that this is a ‘smash-up’ paper as putting these ideas together with a transformer network and getting it to work is a non-trivial endeavor, just that this is probably the closest contrasting work. Experiments are conducted on the MultiWoZ dataset, achieving state-of-the-art results with respect to recent competitive work on the end-to-end and state-tracking task. \n\nThe positives of this paper are readily apparent — this work combines the previously mentioned papers in an ostensibly sensible way to produce a state-of-the-art model for end-to-end (including generation) and state-tracking problems in multi-domain settings. The model is intuitively appealing and this is likely the baseline system for end-to-end multi-domain goal-oriented conversational agents going forward. From a purely technical perspective, while I believe other researchers *could* have put this together based on referenced work (i.e., it isn’t a conceptual breakthrough), they did get it to work and get good results.\n\nThe weakest aspect of this paper is the presentation and writing; overall it seems rushed, took several readings (and some assumptions) to understand despite being familiar with relevant work, doesn’t contrast crisply with related work, overloads some notation, and doesn’t focus on possibly the most interesting aspect of the paper (in terms of seeing which subcomponents can be attributed for performance) — the ablation study. Below are more detailed/specific comments in this regard:\n— In general, when situating within relevant work, the introduction and related work sections are more of a ‘laundry list’ than direct contrast. I would even say that this should extend to the general text where works are referenced conceptually (as in the first paragraph on this review) and a clear contrast is made. \n— In the same vein, ideally, the paper should be as self-contained as possible — however, I would recommend contrasting with relevant works in the body such that readers will at least know where to reference to get a better understanding wrt concepts used in other papers and described in more detail there. Also, the introduction lacks examples to explain clearly to readers who aren’t familiar with these concepts (e.g., inform vs. request slots)\n— Not just a writing criticism, but in my opinion, while the stated architecture ostensibly performs well, it really isn’t clear if it is because the conceptual explanation or just a lot of machinery minimizing the loss well and many other architectures would work. Obviously, there isn’t room to describe any failures, but the ablation study could capture this to some degree with additional discussion.\n— Small point; the notation ’S’ is used both for ‘slot’ and ’system response’. It is generally obvious which is which, but still a good idea to change.\n— In the ‘Domain-Slot Joint State Tracking’, when I see element-wise, I am thinking Hadamard. However, this looks like somewhere that a tensor-network would be appropriate to capture interactions (i.e., Kronecker product), which is also reflected in the stated dimensionality and the text. Please clarify.\n— In ‘End-to-End’ section on page 7, you “adapt the method [TSCP] to the multi-domain dialogue setting”. I can think of at least two ways of doing this; please clarify.\n— As this is likely the baseline for future work in this direction, Table 3 is probably the most interesting part of the paper in terms of looking where to push on this model. However, the discussion is minimal. I would prefer this over the ‘qualitative results’ and some of the repetition in the intro to related work sections.\n\nFinally, as this is very specific to dialogue agents, I do question if ICLR is the ideal venue. Nothing in the model has broader methodological implications and all of the conceptual underpinnings are somewhat specific to this domain. Based on these concerns, I am currently leaning toward ‘weak reject’ as I think the technical contribution is solid, but the presentation is weak to the point where I still have some remaining questions and don’t think I will really understand what is happening in some sections until I look at the code. As the model is somewhat complicated, I understand that this is difficult to solve — but I think possible. However, I am ambivalent and would rate as borderline if available and thus am looking forward to further discussion."}