{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #4", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper presents an end-to-end multi-domain task-oriented dialog system by a novel end-to-end neural architecture to separate out slot and domain modules to achieve the state-of-the-art results on MultiWOZ 2.1. The paper also proposed a response generation module without system action annotation. \n\nWhile the approach is well-motivated and well placed in the literature for multi-domain task-oriented dialogue system, the idea of separating out slot and domains are not very new. The neural architecture is novel however it is an assembly of transformers and attention which is not also very innovative considering the previous literatures. What's more, I found some of the details are very hard to follow in the paper and the delivery of the paper could be better.  Here are a few of my questions:\n\n1. How does the request/inform slot being determined is not well-mentioned in the paper. As far as my personal knowledge, there is no information about request/inform slot information for dialog state at each turn in MultiWoz 2.1, it would be great if the paper could describe how to get these labels. \n\n2. What is the meaning of “keeping slot token sequence fixed in all dialogue examples” ? Does that mean for a particular dialogue, the slot token sequence is unchanged across different turns?\n\n3. What is the difference between slot token sequence and belief state? I can see the only major difference is that belief state contains values and slot token sequence does not have values.\n\n4. In the experimental session, you mention there are N_s = 35 inform slots in total, but in the previous section, the paper mentioned N_s = N_s(inform) + N_s(request). So is N_s representing the number of inform slots or the number of inform+request slots?\n\n5. Table 3 is reporting the ablation studies on the test set,  it would be nice to see the numbers on the development set as well. \n\n6. What is the impact of the domain module? if removing the domain module and consider all slots are in one domain, what is the accuracy ? \n\nWithout clear delivery of the paper and rigorously proof of the effectiveness of the approach on other dataset, although it claims to achieve the-state-of-the-art results on MultiWOZ 2.1, it can be only considered as an application paper and can hardly meet the standards in a conference like ICLR. \n\n\n\n"}