{"title": "The paper proposes to add \"recurrent\" connections inside a convolution network with gating mechanism. The idea is not novel and the performance improvement is marginal.", "review": "The paper proposes to add \"recurrent\" connections inside a convolution network with gating mechanism. The basic idea is to have higher layers to modulate the information in the lower layers in a convolution network. The way it is done is through upsampling the features from higher layers, concatenating them with lower layers and imposing a gate to control the information flow. Experiments show that the model is achieving better accuracy, especially in the case of noisy inputs or adversarial attacks. \n\n- I think there are lot of related literature that shares a similar motivation to the current work. Just list a few that I know of:\nRonneberger, Olaf, Philipp Fischer, and Thomas Brox. \"U-net: Convolutional networks for biomedical image segmentation.\" International Conference on Medical image computing and computer-assisted intervention. Springer, Cham, 2015.\nLin, Tsung-Yi, et al. \"Feature Pyramid Networks for Object Detection.\" CVPR. Vol. 1. No. 2. 2017.\nNewell, Alejandro, Kaiyu Yang, and Jia Deng. \"Stacked hourglass networks for human pose estimation.\" European Conference on Computer Vision. Springer, Cham, 2016.\nYu, Fisher, et al. \"Deep layer aggregation.\" arXiv preprint arXiv:1707.06484 (2017).\nThe current work is very similar to such works, in the sense that it tries to combine the higher-level features with the lower-level features. Compared to such works, it lacks both novelty and insights about what works and why it works.\n\n- The performance gain is pretty marginal, especially given that the proposed network has an iterative nature and can incur a lot of FLOPs. It would be great to show the FLOPs when comparing models to previous works.\n\n- It is interesting observation that the recurrent network has a better tolerance to noise and adversarial attacks, but I am not convinced giving the sparse set of experiments done in the paper.\n\nOverall I think the current work lacks novelty, significance and solid experiments to be accepted to ICLR.\n\n", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}