{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "  *Synopsis*:\n  This paper provides a new doubly robust estimator for off-policy policy evaluation, based on the new infinite horizon technique (i.e. using an estimate of the state density ratio as opposed to long products of action importance weights). They show the doubly robust estimator's bias is dependent on a product of the error of the value function estimate and stationary distribution ratio estimate, which provides improvements over the initial infinite horizon estimator. They also provide some nice discussion of the relation of their method and Lagrangian duality, which was quite interesting and insightful. Finally, the paper shows the usual empirical comparisons.\n\n  Main Contributions:\n  - Doubly robust estimator for infinite horizon off-policy policy evaluation\n\n  *Review*:\n  Overall, I quite like this paper and think the quality is at a high level. The proposed doubly robust estimator is well supported theoretically and empirically and improves on the prior art. I am recommending a weak accept for this paper as it will be a nice contribution for the community, but I have some clarifications/updates I would like to see to improve the readability of the paper (specifically C4).\n\n  I also have a few questions, and clarifications that I would like the authors to address during the rebuttal period.\n\n  *Clarifications*:\n  C1: In the section \"Off-policy state visitation importance sampling\", doesn't equation 4 involve an expectation over the target policy? Or am I missing something here?\n\n  C2: The bias of the estimator decreases as our estimate of the density ratio and value function improves. It might be useful to more clearly compare this bias to the original estimator proposed by Liu.\n\n  C3: Proof of theorem 3.1: I would like you to clearly finish the proof. I think clarity and completeness in appendices is importance over conciseness as there is usually no limit on pages.\n\n  C4: The proof of theorem 3.2 is not obviously linked to theorem A.3. The proof for theorem 3.2 should be clearly stated and included in the appendix, without an unstated implicit link to A.3. This will make your theoretical analysis more clearly understandable, and expendable for future work. I will happily increase my score if this is clarified in a future version. I also will decrease my score if this is not clarified.\n\n  *Competitors*\n\n  - You may want to include a model based approach, just for completeness (as in the infinite horizon paper from Liu).\n\n  *Questions*\n  \n   Q1: I'm curious about the difference between using an ANN for estimating the density ratio (as opposed to a kernel method). Have you run experiments with the kernel method proposed in Liu's paper? While I don't think it is necessarily needed for the paper to be complete, I think the difference would be interesting to see what factors contribute to the algorithm's better performance.\n\n\n  Minor typos not taken into account for the review:\n  - Section 3.1 \"it is useful to exam the\": exam -> examine\n  - Section 4: \"hence yielding an true expected reward\": an -> a\n  - Section 4: \"it is natural to intuitize\": intuitize -> intuit?\n  - The sentence right before section 4 could use a rewrite.\n  - For readability it would be useful to include theorem statements ahead of proofs in the appendix.\n  - Theorem A.3: do you mean with \\hat{R} defined in 3.2 (not the variance as this is not defined in 3.2).\n"}