{"title": "Supervised learning model, experiment results are weak.", "review": "The authors propose Graph VRNN. The proposed method models the interaction of multiple agents by deploying a VRNN for each agent. The interaction among the agents is modeled by the graph interaction update on the hidden states of the VRNNs. The model predicts the true state (e.g., location) of the agent via supervised auto-regressive learning. The proposed model can improve this estimation from partially-observed visual observations. In the experiment, the authors apply the proposed method to Basketball and Soccer data to model the positions of the players. \n\nThe paper is clearly written. However, Section 3.2 needs to be elaborated more because using graph interaction update in VRNN is one of the main contributions. \n\nI see two main weaknesses. The first is that the states are learned by supervised learning where obtaining the state label (i.e., the agent locations) is very expensive. Indeed, the authors had to develop their own soccer game to obtain these labels. The second weakness is the weak/inconsistent experiment results. It seems not clear whether having the graph structure or stochastic modeling is really helping or not. For example, for basketball experiment, Graph-RNN works poorly. And, for soccer, Graph-VRNN works just as good as Graph-RNN. The authors explained that this is due to the simplicity of the player behavior (not much stochastic), but the result in Table 2 shows good performance for Graph-VRNN for future prediction task. All these make it difficult to buy the claimed argument. It is also a limitation that the model requires to know and fix the number of agents.\n\nAs minor comments, \n\n- in Table 1. Graph-RNN works better for soccer t=4, but not indicated in bold. \n- Having a single RNN baseline will be helpful to compare with Graph-RNN.\n- It is confusing to call s_t a belief state because it is observed not latent.\n- In the qualitative results, I think it can be compared to the heatmap of true distribution.\n\nI think the following papers needs to be discussed as related works.\n- https://arxiv.org/pdf/1806.01242.pdf \n- https://arxiv.org/pdf/1802.03006.pdf\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}