{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "I vote to reject the paper at this stage, mainly because of the following three points:\n\n1) The motivation is unclear and overall structure of the paper is confusing. It should be better motivated why one should use the duality gap as an upper bound for the \"F-distance\". Minimizing the F-distance as is usually done seems like the more direct and simple approach. Since the results are far from state of the art, a clean and neat presentation of the theoretical advantages and contributions is crucial. \n\n2) The presentation is not professional, hard to follow and the submission overall looks very rushed:\n- In equations, please use \\inf, \\sup, and \\text{...} for text such as distance, data, ... \n- I have trouble understanding the overall idea behind Algorithm 1 and Eq. (22). What is the definition of f^* and g^* in Eq. (22)? Some explanatory text would be valuable.\n- The set F in Definition 3.5 looks odd, as it appears to be recursive and might not be unique.  \n- The writing looks very rushed, and should be improved. For example, I have trouble understanding the sentence \"So the existed algorithms should be heuristic or it can get a bad result even we train the neural networks with lots of datasets.\" in the introduction. \n- The aspect ratio in Fig. 5 should be fixed.\n\n3) The experiments are completely preliminary and not reasonable:\n- The WGAN-GP baseline is very weak, i.e. does not show any reasonable generated images (Fig. 9). There are countless open pytorch implementations on GitHub which out-of-the-box produce much better results. \n- The shown inception scores are far from state-of-the-art. It is unclear, why one should use the proposed duality gap GAN."}