{"title": "Interesting formulation; Need more evaluation", "review": "Summary: The paper proposes a method to predict the future state-spaces in a multi-agent system by combing the visual and temporal information using a mixed blend of Graph-Networks+VAE+RNN (G-VRNN) formulation. The proposed approach is evaluated on two sports datasets: (1). basketball sequences; (2). soccer sequences. The authors show how the overall formulation is better than each of individual components.\n\nPros: \n\n1. the multi-agent setting is interesting, very natural, and has potential for many applications.\n\n2. formulation encodes information about different aspects: agents, location, temporal activities, and each agent's relation to other.\n\nCons: \n\n1. The current evaluation is contrived. \n\n(a). the task for future state prediction in current basket-ball and soccer sequence is not very clear. A gaussian distribution defined with 'time' as standard deviation could give similar results? \n\n(b). no comparison with the existing approaches? I think the work of Felson et al. ICCV'17 is relevant for the given paper, and so it would be ideal to do evaluation on the datasets used in their work, and if possible compare the different baselines that they have used. \n\n(c). the goal is to predict the future state of an agent in a multi-agent setting, but it is not clear from the evaluation as how the presence of multiple agents influence the behavior of an individual. \n\n(d). a better way to demonstrate the future state-spaces could be through trajectory of ball or players (similar to ones shown by Walker et al ECCV'16, CVPR'14). The current qualitative analysis is not sufficient to understand what is happening in the proposed pipeline.\n\n(e). more challenging cases to demonstrate the proposed approach  -- consider any multi-person tracking dataset, and use the proposed formulation to predict multiple trajectories (and hence state-spaces at varying time) for the people. An amazing result could be shown as how a person changes trajectory as a group of people pass by.\n\n2. The running example of 'location of goalie' is ambiguous. By design, goalie has to be near the goal post. Even if there is no visual information or any other information, one can safely say this thing?\n\nOverall I think the work has the potential to be on something really interesting. However, I think it needs solid experiments and is not yet ready for publication.", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}