{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes a technique to generate audio adversarial examples based on iterative proportional clipping. It is essentially an optimization approach via backprop but with a constraint on the magnitude of perturbation in the time domain.  The authors show the effectiveness of the proposed technique to successfully attack the wav2letter+ ASR model and claim to have superior temporal dependency than other existing approaches.  Overall, the work is interesting but I have the following concerns.\n\n1. In terms of analysis, I think it would be more helpful to show results in spectrogram rather than frequency as shown in Fig.4.   \n\n2.  The authors claim that the proposed technique is less time-consuming to generate in the abstract. However, there is no discussion and comparison in the experiments. \n\n3.  Since the proposed technique is claimed to be iterative, it would be helpful to demonstrate the \"iterative\" performance improvement.  How much does the iteration help?  How many iterations does it need to get a good adversarial audio?  How long does it take to accomplish that?  I couldn't find such information in the paper. \n\n4. By listening to the provided audio samples, I would say the quality of the audios are good in general. But in w4, one can actually perceive the distortion in the audio. But overall it is good. Thanks for the samples.  \n\n5  The wording and formulation need to get improved.  \n     --  I found the word \"bandwidth\" very confusing especially when it comes to the discussion about the time and frequency domain signal processing.  The word \"bandwidth\" has a well-established meaning in signal processing already.  \n     --  There is no definition of \"TD\" throughout the paper -> temporal dependency? \n     --  The formulation in Eq.2 is incorrect. $\\delta$ in the second term seems to be independent of the first term. shouldn't it be $l(x+\\delta, y')$ in the first term?  "}