{"title": "Review for DynCNN: An Effective Dynamic Architecture on Convolutional Neural Network for Surveillance Videos ", "review": "The paper addresses the problem of computational inefficiency in video surveillance understanding approaches. It suggests an approach called Dynamic Convolution consists of Frame differencing, Prediction, and Dyn-Convolution steps. The idea is to reuse some of the convolutional feature maps, and frame features particularly when there is a significant similarity among the frames. The paper evaluates the results on 4 public datasets. However, it just compares the approach to a baseline, which is indeed applying convnet on all frames. \n\n- State of the art is not well-studied in the paper. Video understanding approaches usually are not just applying convnet on all frames. Many of the approaches on video analysis, select a random set of frames (or just a single frame) [5], and extract the features for them. There is another set of work on attention, that try to extracts the most important spatio-temporal [1-4] information to solve a certain task. These approaches are usually computationally less expensive than applying convnet on all video frames. I suggest the authors compare their model with these approaches.\u2028\n\n[1] Spatially Adaptive Computation Time for Residual Networks., Figurnov et al.\u2028\n[2] Recurrent Models of Visual Attention, Mnih et al.\n\u2028[3] Action recognition using visual attention, Sharma et al.\n\u2028[4] End-to-end learning of action detection from frame glimpses in videos, Yeung et al.\n\u2028[5] Two-Stream Convolutional Networks for Action Recognition in Videos, Simonyan et al.\u2028\n\n- In addition, car and pedestrian detection performance is part of the evaluation process. In this case, the approach should be also compared to the state-of-the-art tracking approaches (that are cheaper to acquire) in terms of computational efficiency and performance. \n- The writing of the paper should also improve to make the paper more understandable and easier to follow.\u2028Some examples:\u20281. Unnecessary information can be summarized. For example, many details on the computational costs in abstract and the introduction can just simply be replaced by stating that “these approaches are computationally costly”. \u20282. Using present tense for the SoTA approaches is more common.“ShuffleNet (Zhang et al. (2017)) proposed two new strategies”. \u20283. Long sentences are difficult to follow: “In real surveillance video application, although the calculation reduction on convolution is the main concern of speeding up the overall processing time, the data transfer is another important factor which contributes to the time”\n\u2028\u2028+ The problem of large-scale video understanding is an important and interesting problem to tackle. \u2028", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}