{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper targets at studying the mutual exclusive bias which existed in children learning, to help understand whether there exists similar bias in deep networks. \n\nIn general, the whole paper tries to tell a very interesting, and good story. The paper is very well organized and written. However, I have the following concerns.\n\n1, the ME problem is quite similar to the concept ontology, e.g. , a “Dalmatian,” a “dog”, or a “mammal”.  So what’s the key difference? Hierarchical learners can avoid this problem.\n\n2, I would say, the SOTA neural networks fundamentally are just representation learned, i.e., feature representation learning. The learned features could in principle be employed to construct advanced learners, .e.g., hierarchical Bayesian. It’s probably a bit unfair or misleading to claim neural networks suffering from ME bias. \n\n3, In Sec. 3, the first and section paragraph, I can not quite understand how the ME bias theory guide the following synthetic experiments. Please give more explanations.\n\n4, in Sec. 3.1, considering the small number of training instances, whether it is large enough to train the NN/ not overfitting issues?\n\n5. Whether the ME bias mostly attributed to the one-hot representation? If one uses word2vec as the representation in NN, the ME bias will be solved. Actually, this is the standard practice in some learning tasks, e.g., zero-shot learning. \n\n6, the experimental design of Sec. 4.2 is also a bit unfair. It seems to me that the tasks are organized as unbalanced instances of each classes, and asking the common NNs to learn this  task. Of course, this common NNs can not address it.\n"}