{"rating": "3: Weak Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes to make use of commonsense knowledge base in conversation generation. \n\nThe general idea of introducing such KB is not wrong. \n\nThe main approach of the proposed method is in Secs 2.2.2 and 2.2.3. Unfortuantely, the paper reads like code comments, rather than a scientific paper. Most of the model components are not well motivated. \n\nFor example, the attention score of concepts is computed by softmax(.) * PageRank. The authors fail to justify why this formula is approximate and better than alternatives. It doesn't look good to me. Suppose the prompt is about a rare concepts, whose neighbors are also rare. Then the PageRank scores are low for all neighbors, resulting in very low attention weights. A better approach seems to be post-normalization. \n\nThe ablation test compares the model with random and golden concepts. However, it is unclear how each proposed model component (e.g., Central flow encoding and outer flow encoding) plays a role in the entire model. Also, it's unclear how the proposed model is compared with an obvious and seemingly better treatment, for example, softmax(.) * PageRank vs. softmax(. + log PageRank). \n\nBesides, the paper does not tackle the key issue of multi-hop reasoning. One of the key problems is that the number of neighbors grows exponentially wrt the number of hops. Therefore, I would expect some routing techniques (for example, trained by RL) that maintain a list of tractable paths, but with more steps of hops. The paper instead proposes some esoteric attention mechanisms on one-hop/two-hop neighbors.\n\nIn short, the proposed model is neither well motivated nor well tested. The technique is also pretty superficial.\n\n\nMinor:\n\nThere're some formatting issues. For example e_j -> e_i is better formatted as e_j \\rightarrow e_i."}