{"rating": "6: Weak Accept", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper proposes a system for generating a single-turn response to a posted utterance in an open-domain dialog setting.  It follows but improves on a previous work that leverages commonsense in generating the responses.  The specific proposal is to extract keywords from the incoming utterance, match them to concepts in ConceptNet,  compute the one-hop and two-hop neighbors, and use them to influence the sequence generation process using attention weights.  The two-hop neighbors are prefiltered in a preliminary training step to control the excessive noise.  The novelty in this proposal is to use the notion of a \"flow\", i.e., diffusion into the neighbors of the grounded concepts.\n\nIn an experiment using a Reddit-based dataset, the proposed method wins over several baselines in 7 metrics that measure relevance between the generated and ground-truth responses.   The proposed method does not win on diversity but has some minor advantage on novelty.  Advantages on both appropriateness and informativeness are also observed in human evaluation.\n\nThe proposal is technically sound and the use of concept flow is intuitive appealing. The experimental results are convincing of the method's effectiveness.\n\nThe evaluation presented in Figure 2 requires some clarification. In particular, the \"Gold\" option needs some explanation: what are the negatives there, why are they used, and how are they used?   Also, what is this option supposed to demonstrate?   How does ConceptFlow select its negatives and how are they used?\n\nThe example shown in Figure 3 presents a more puzzling picture,  which needs additional clarification:\n\nWhy \"fan\" and \"fans\" show up as two distinct concepts?  Are they supposed to be the same concept?  \n\nIs there an explanation for why the response retains the concept \"championship\" directly from the post?  Can it be explained by that this is a relatively rare word in the dialog collection?  Why is\nthe attention assigned to it not very high?  \n\nFor what reason many of the very high attention concepts like \"huge\" are filtered out?   The loss of the word \"win\" in this filtering step seems to be especially puzzling -- intuitively one may think that \"win\" should connect well to the concept of championship.  It is not clear whether this example is to demonstrate success or a breaking mode.\n\nThere are minor errors in the English text that should be fixed in a revision."}