{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This paper presented a Stacked Quantization Modules (SQM) for the problem of Online Continual Compression, based on the VQ-VAE framework by van den Oord et al. (2017). Experiments were conducted on online continual image classification benchmarks to show the effectiveness of the proposed SQM. In general, the novelty of the paper is a little bit limited and the writing of the paper is not very easy to follow.\n\n- The SQM was constructed by stacking the known VQ-VAE. It is unclear why the stacking works for online continual compression. How many stacks should be used? What are the yellow rectangle parts in Figure 1?\n\n- What are the relationship between Alg 1-4 ? More explanations or discussions are necessary.\n\n- In Section 3.1, \"The high level training of the online learned compression is described in Alg. 4.\". It is very confused. I can't see the related content in Alg.4.\n\n- In Section 4.1, \"In short, we apply Algorithm 4, with an additional online classifier being updated at line 13.\" I don't understand it. I cannot see line 13 in Algorithm 4, because there is only 10 lines in Algorithm 4.\n\n- In Section 3.3, BITS(.) needs definition.\n\n- In Section 4.1, \"Here we consider the more challenging shared-head setting, where the model is not informed of the task (and thereby the subset of classes) at test time. This is in contrast to other (less realistic) CL classification scenarios where the task, and therefore subset of classes, is provided explicitly to the learner Farquhar & Gal (2018).\" It is very difficult to understand what the above experimental settings are.\n\n- For Figure 3, the textures or lines of the bottom reconstructed one are not so smoothed or straight as the top one."}