{"rating": "6: Weak Accept", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper introduces a computational ecosystem for robot learning built on Julia. The authors claim to achieve faster learning for various RL algorithms and support real-time model predictive control. \n\nOverall, the paper is well written and the main contribution and the main structure of the ecosystem is clearly described. That this supports parallel computation can be of immense use for the training time is often a caveat in RL algorithms and parallel computation is crucial. The benchmark results reported in Fig. 3 show that sampling throughputs are better in the proposed ecosystems across reported environments and this ecosystem outperforms Gym and DMC in parallel scaling of sampling throughputs. \n\nWhile I am inclined to accept the paper as I believe that it has the potential to offer an origin and efficient ecosystem to work well in real-time MPC and RL algorithms, I think the paper lacks certain details.\n\n1. Fig. 1 shows that the although the time taken by Lyceum is less than that by Gym, the performance of the latter is much better in Humanoid. Although time is a crucial parameter in training, it is the performance that is usually of utmost importance. A more detailed explanation /intuition than given is needed for one to understand the limitation of the proposed ecosystem, which may in turn reflect on possible success or failures in other environments (not reported in the paper).\n\n2. There is hardly any code given in the paper! While I understand that this is beyond the scope due to the limited space, I checked the link given in the abstract and it was not working. It is very hard to draw a critical and analytical conclusion without having a look into the details of implementation.  "}