{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes a new task of learning from sets, predicting the size of the symmetric difference between multisets, and gives a new method to solve the task based on the fuzzy set theory.\nAlthough the topic of learning from sets is relevant and using the fuzzy set theory for the task is interesting, I have the following concerns regarding with the clarity, significance, and evaluation.\n\n- Motivation is not clearly presented. The new task of predicting the size of the symmetric difference between multisets is proposed, while its application is not well discussed.\n    Although Theorem 1 characterizes the task using the subset inclusion relationship, its relevance to applications is still not clear.\n- The problem to be solved is not mathematically formulated. In particular, what are input and output?\n- More detailed explanation of the data preparation would be required.\n    How to transform images to pairs of multisets?\n    Is the label (number) of each is used as an element of a multiset?\n- For the second comparison partner, why is \\Delta(A, B) defined as \\rho_2(\\Psi(A) + \\Psi(B))?\n    For fair comparison, this function should be the same with the proposed method, that is, ||\\Psi(A) - \\Psi(B)||_1 for the learned \\Psi by DeepSets.\n- In experiments, one of the most straightforward ways is to first predict labels for each image, followed by computing the symmetric difference from the predicted labels. Comparison with such baseline should be performed.\n\nMinor comments:\n- P.1, L.1 of the second paragraph: \"The the\" -> \"The\"\n"}