{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "The authors propose NPTC a new convolutional operator for 3D point clouds embedded on a 2D manifold based no parallel transport defined by a narrow-band approximation. The method combines voxelization within a local neighborhood in 3D (narrow band) and geometric convolution. Experimental results are presneted for a range of classification and segmentation tasks that are similar to the state-of-the-art.\nAs I am not familiar with geometric methods, point clouds and related work, I wouldn't be able to judge the degree of novelty, beyond an educated guess.\n\nThe experimental results in classification and segmentation use the proposed NPTC in standard NN architectures with residual blocks similar to a U-net. In terms of performance, NPTC are amongst the best reported results for each experiment, but always similar to other architectures. Only mean values for IoU and accuracies are reported, but no estimates of variance/spread. Therefore, I cannot judge if the results are significantly different from related methods.\n\nThe paper starts out highly technical.\nThe Notation is introduced in section 2, the Background section, which is after the discussion of related work in section 1, where the notation is already used without being introduced. \nThe related work makes heavy use of manifold geometry. For non-experts in geometry like me, who also doesn't know about notational conventions, it was near impossible to follow on a first read of the paper. I recommend introduction of notation before use, especially as Section 1 is titled \"Introduction\".\n"}