{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors extend the work of Trask et al 2018 by developing alternatives to the Neural Accumulator (NAC) and Neural Arithmetic Logic Unit (NALU) which they dub the Neural Addition Unit (NAU) and Neural Multiplication Unit (NMU), which are neural modules capable of performing addition/subtraction and multiplication, respectively. The authors show that their proposed modules are capable of performing arithmetic tasks with higher accuracy, faster convergence, and more theoretically well-grounded foundations.\n\nThe new modules modules are relatively novel, and significantly outperform their closest architectural relatives, both in accuracy and convergence time. The authors also go to significant lengths to demonstrate that the parameters in these modules can be initialized and learned in a more theoretically well-grounded manner than their NAC/NALU counterparts. For these reasons I believe this paper should be accepted.\n\nGeneral advice/feedback:\n- should provide an explanation of the row in Table 2 showing that a simple linear transformation is able to achieve accuracy and convergence times comparable to those of the NAU\n- should provide an explanation of the universal 0% success rate on the U[1.1,1.2] sampling interval in Figure 3\n- inconsistent captioning in Figure 2c, missing \"NAC• with\"\n- should clarify in Section 4.1 that the \"arithmetic dataset\" task involves summing only *contiguous* vector entries; this is implied by the summation notation, and made explicit in Appendix Section C, but not specified in Section 4.1\n- it is unclear what experiments you performed to obtain Figure 3, and the additional explanation in Appendix Section C.4 regarding interpolation/extrapolation intervals only adds to the confusion; please clarify the explanation of Figure 3, or else move it to the Appendix\n- the ordering of some of the sections/figures is confusing and nonstandard: Section 1.1 presents results before explaining what exactly is being measured, Figure 1 shows an illustration of an NMU 2 pages before it is defined, Section 3 could be merged with the Introduction\n\nGrammatical/Typesetting errors:\n- \"an theoretical\" : bottom of pg 2\n- \"also found empirically in (see Trask et al. (2018)\" : top of pg 4\n- \"seamlessly randomly\" : middle of pg 5\n- \"We choice\" : middle of pg 6\n- inconsistent typesetting of \"NAC\" : bottom of pg 6\n- \"hindre\" : middle of pg 8\n- \"to backpropergation\" : bottom of pg 8\n- \"=≈\" : top of pg 17\n- \"mathcalR\" : bottom of pg 23\n- \"interrest\" : bottom of pg 24\n- \"employees\" : bottom of pg 24\n- \"models, to\" : bottom of pg 24\n- \"difference, is\" : bottom of pg 24\n- \"consider them\" : bottom of pg 24\n- \"model, is\" : top of pg 25\n- \"task, is\" : top of pg 25\n- \"still struggle\" : top of pg 25\n- \"seam\" : top of pg 27\n- \"inline\" : top of pg 27\n- inconsistent typesetting of \"NAC\" : top of pg 27\n"}