{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposed a framework for modeling disease progression taking into account the treatment events.\n\nComments:\n1. There is no significant theoretical innovation in this paper. Specifically, the learning approach for optimizing the parameter set W in the presence of \\mu is not much different from the one proposed by (Kidzinski & Hastie, 2018) and the optimal value of \\mu is simply the solution for L2 loss function. Besides, the narrative of section 2 shares too much similarity with the context of Kidzinski & Hastie, 2018.\n\n2. The practical significance of the paper is rather limited considering that the framework can only take into account one specific treatment at a time when training a model. There are usually different treatments for a certain disease and it is hard to control enough patients to all take the same treatment. Sometimes, even the same patient could take multiple treatments at the same time or along his trajectory. \n\n3. The paper is poorly written. There are too many grammatical errors. Some sentences are hard to understand. E.g. “Treatments of various types, however, rely on human decisions and to some extent, an exogenous variable to the development of disease. Thus they need to modeled differently.” should be “Treatments of various types, however, rely on human decisions and to some extent, are exogenous variables to the development of disease. Thus they need to be modeled differently.”. “we add a penalty term on the nuclear norm of W .”, Do you mean “we add a penalty term which is the nuclear norm of W .”? Cause I don’t see any additional penalty term in the nuclear norm compared with equation 2.2. “...where (I_S)_{i,j} = 1 if and only T_i ≥ s(i)...” should be “...where (I_S)_{i,j} = 1 if and only if T_i ≥ s(i)...”. “Finally we show that if the sequence {(\\mu_{\\lambda}^{(k)}, W_{\\lambda}^{(k)} )}_k, it has to converge to a solution of (4.1).” Grammatically speaking, the if clause is not even a complete clause. "}