{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper introduces Coordinatewise-Soft-Impute (CSI) algorithm that attempts to estimate the progression of a disease while taking into account the effect of a single binary treatment intervention. The authors also provide prove that CSI converges to the global solution regardless of the initialization. The paper is concluded with experimental results on synthetic  and real-world data, comparing the proposed method with contender methods functional Principal Component Analysis (fPCA) and Soft-Longitudinal-Impute (SLI).\n\nThis paper should be rejected due to the following arguments:\t\n\t- The authors claim that the “existing literature talks little about modeling treatment effect on disease progression.” However, this is not true. Here are a few works and the references within, for instance:\n\t\tXu, Y., Xu, Y., & Saria, S. (2016, December). A Bayesian nonparametric approach for estimating individualized treatment-response curves. In Machine Learning for Healthcare Conference (pp. 282-300).\n\t\tLim, B. (2018). Forecasting treatment responses over time using recurrent marginal structural networks. In Advances in Neural Information Processing Systems (pp. 7483-7493).\n\n\t- The proposed method is simple extension of that of (Kidzinski & Hastie, 2018), by adding a term that accounts for treatment and its timing. It does not present enough novelty.\n\n\t- CSI is empirically compared with fPCA and SLI, however, neither of these two methods take into account the effect of applying treatment. This comparison is unfair and therefore, cannot justify the superiority of CSI.\n\nThings to improve the paper that did not impact the score:\n\t- Citations throughout the paper had wrong formatting. Often \\citep should have been used instead of \\citet.\n\t- Page 1, last par., last sentence: Thus, they need to “be” modeled differently.\n\t- Page 2, last par., line -2: Principle >> Principal\n\t- Page 3, par. 2, line 4: the observation matrix Y is N \\times T (not N \\times K).\n\t- Page 4, line 2 of Eq. (3.2): first argument misses Y.\n\t- Code was included but no description or readme file was provided for how to run the experiments."}