{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The authors proposed to mix together multiple styles by proposing two frameworks: 1) serial style transfer (SST), which combines style transfer methods in series; and 2) parallel style transfer (PST), which combines style transfer methods in parallel.\n\nThe paper is clearly presented. It is interesting to see work on mixing up different styles, since it is not extensive studied so far. Though not much studied, this topic is not new [ref 1], [ref 2]. The authors didn't provide a thorough literature review on mixing multiple styles in the related work or anywhere else in the submission.\n\nIn terms of the methodology, the novelty is quite limited. The proposed SST and PST are simple frameworks to mix different styles, which, by the way, are fully based on existing style transfer methods. At some point, PST is similar to [ref 2], and the difference is minor. PST linearly combines the losses for different styles to construct the final loss, while [ref 2] linearly combines together the features for different styles.\n\nAbout experiments, it is not clear about how the predefined parameters (e.g. \\alpha, w_1, w_2, etc.) are determined. They were just empirically set and mentioned in the experiment section.\n\nIt is appreciated to see more results in the Appendix, as well as the user study. However, due to lack of novelty, I think this submission may not be qualified for acceptance at this moment.\n\nMinor:\nI think the authors should give their proposed framework another name instead of using \"cascade,\" which has a similar meaning of \"series.\"\n\n\n[ref 1] Google's arty filters one-up Prisma by mixing various styles. https://www.engadget.com/2016/10/27/google-style-transfer-tech/\n[ref 2] Pegios, et al. Style Decomposition for Improved Neural Style Transfer. ArXiv, 2018."}