{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "The paper presents a new embedding based system for Knowledge Graphs (KGs). The main characteristic of the proposed system is that it is able to preserve the subsumption hierarchy between relations in the embedding space.\n\nThe proposed system seems valid and technically sound to me. However I have two main concerns:\nPresentation. The paper is full of typos (see [Details] below for some of them. The figures have several errors. TransE, TransH, TransR, KALE are cited without the references to the main papers. Moreover, it is rather confusing using the term relational space both for “relation vectors” and “relation hyperplane”. It seems the paper was written in a hurry and therefore it makes the paper hard to follow, it is a pity, because the proposed approach seems intriguing.\nExperiments. The system was evaluated on a small dataset. It is not clear if the proposed system can scale.\n\nFor these reasons I think the paper is not ready for publication and that a revision is necessary.\n\n[Details]\nPage 1.\n“R^dand”\n“(.” twice at the end of a citation\nFigure 2.\n“viweing”\n“His_family_of” is not defined anywhere\nFigure 2b. \nIt seems that all the relations are wrong\nPage 4.\n“(ex) A)”\n“(ex) B)”\n“space(Figure 3b)”\nWhen Figure 4 is cited the symbols and the names used in the text does not match with the ones in the figure\n“We evaluate TransINT on Freebase 122 (respectively created by Vendrov et al. and Guo et al.)”. These bibliographic citations do not make any sense. FB122 was released by Bordes et al.\n\n[Minor]\nThere is too little space between the text and the captions of the figures.\n"}