{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "The authors propose TransINT, a novel graph embedding method that builds upon methods such as TransH (Knowledge graph embedding by translating on hyperplanes, Wang et al 2014), TransE (Translating Embeddings for Modeling Multi-relational Data, Bordes et al 2013), and appears to offer state of the art performance on the Freebase link prediction benchmark. \n\nThe manuscript is OK overall in terms of writing (although it could use some copy editing for grammar) and relevant to this community. This reviewer is not familiar with knowledge graph embeddings, and found it difficult to follow the main ideas and contributions. The introduction could certainly be written in a clearer way, first stating the general problem and then building up from existing solutions to the proposed method. Many of the figure captures seem to contain typos (details below), making it particularly confusing to follow. The results appear impressive, but I will leave it to reviewers with more experience in the field to judge how it stacks up against recent work. \n\nMinor comments:\n- In the first paragraph, there are two instances where closing brackets have been replaced by opening brackets. \n- Section 2, where transH is mentioned for the first time, it's missing a reference\n- Incomplete sentence \"Let ri be a binary relation x, y entities\".\n- Figure 2: h,t are not defined. is_family is mislabled as is_parent\n-Figure 3: The line for is_parent_of is mislabeled as is_mother of.\n-  Section 5, \"We evaluate TransINT on Freebase 122 (respectively created by ...\": What do you mean by \"respectively\" if there only Freebase 122 and no other dataset? Maybe forgot KALE here, it's mentioned a few sentences later for the first time and never defined.\n"}