{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "The paper proposes a contextual reasoning module following the approach proposed by the NIPS 2011 paper for object detection. Specifically, the algorithm proposed by NIPS 2011 are first converted to end-to-end modules step-by-step, and then added to the detection framework Faster R-CNN. The comparison is only to one other baseline (Relation Module), and some improvements are show especially for small objects.\n\n+ Context reasoning is an important but unsolved problem in vision, it is a good attempt to apply CRF to object detection\n\n- The subset results are not convincing. For example, AP_L has decreased dramatically from 51.2 to 44.9. This is shocking. Large objects should maintain a similar performance if the contextual module really works. This result is actually very negative to me.\n- I am not sure the idea of applying conCNN to 6 categories of COCO is a great idea to begin with: context reasoning requires a lot of categories, especially those with few examples to benchmark with. If the categories are supplied with a lot of training examples, it is very hard for context to really help there. I would at least stick to full set of COCO (I am fine with reducing the number of training images), or switch to the recently proposed LVIS dataset:\nhttps://www.lvisdataset.org/\n- I think the work did a less comprehensive literature survey for object detection with context reasoning. For example: \nQi, Lu, et al. \"Sequential context encoding for duplicate removal.\" Advances in Neural Information Processing Systems. 2018.\nChen, Xinlei, and Abhinav Gupta. \"Spatial memory for context reasoning in object detection.\" Proceedings of the IEEE International Conference on Computer Vision. 2017.\nThere are actually many other attempts from different groups that try to nail down this problem, please at least review them in the paper.\n\nOverall this is a paper that's not ready. There might be technical contributions (still with the presence of Zheng et al ICCV 2015, it is limited), but the paper needs to be refined in many ways to get accepted."}