{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper proposes a curriculum learning strategy for face recognition and verification learning. The proposed strategy adaptively modulates the weight of the wrongly classified samples throughout the training.  The modulation coefficient used is directly linearly dependent  on the average similarity of the positive samples (that is pairs of features belonging to the same face class in the training triplets). The average similarity is computed with momentum 0.99 across training batches. It is logical to expect that this modulation factor is small at the early stages of training as the backbone has not yet learned a good feature representation that would result in high correct similarity, yet near the end of training the positive similarity increases, and the hard examples get to be modulated with higher coefficient. The proposed training strategy is evaluated on numerous benchmarks and demonstrates consistent improvements in the range of 0.02% to 0.6% accuracy. Some claims on the improved stability of the proposed approach are made.\n\nAlthough I am not an expert on most recent face recognition techniques, I feel this paper drives an interesting point and has a useful contribution to the community. Therefore I recommend acceptance. However, I urge the authors to consider improving a few points:\n\n1. there is a certain discussion on why focal loss is not a valid choice for a curriculum learning strategy. I feel I am not entirely convinced, and I suggest the authors to simple run the comparative experiments on all of their tests.\n\n2. Some notations used are not so well explained and some are introduced only after already being used, I suggest to improve that. In particular the N(.) and the I(.) and the angles that appear without proper definition (it is possible to understand from the context, but I would not burden the reader).\n\n3. I feel like more ablation studies could be done on the design choices of the modulation function."}