{"title": "Experimental section is very limited, and it is difficult to draw concrete conclusions from it.", "review": "The authors propose a generative adversarial network (GAN) to tackle the task of generating new chemically stable crystallographic structures with increased domain complexity. The proposed architecture, named CrystalGAN, consists of two steps where in each step a CycleGAN network is employed. \nThe application seems novel and the use of CycleGAN seems to be an interesting direction. However, the paper contains major problems which makes it unsuitable for publication at ICLR 2019.\n\nMajor problems:\n-\tThe clarity of the text needs to be improved a lot. Many important parts are obscure and difficult to interpret. \n-\tThe “feature transfer” step seems to be the most important trick in the proposed architecture, however, the “feature transfer” section is rather superficial and do not even detail what exactly the authors mean by “feature”. It is not clear how the ternary compositions are created using the generated binary compositions.\n-\tI have had a hard time trying to understand the reason for using the two proposed steps:\no\tIt is not clear why Step 1 is necessary. As far as I understand, one could do “feature transfer” directly on the input data (AH, BH) and then feed it to the “Step 2”.\no\tLooks like the main reason for using Step 2 is to enforce the geometric constraints. If that is the case, why not just directly apply the geometric constraints on data generated in “Step 1 + Feature Transfer” and then use the resulting data as the final output? (This should be at least a baseline)\no\tAdditionally, there is no guarantee that the data generated in Step 1 is of good quality. Training a generator (Step 2) using bad data, will result in bad data. \n-\tThe type of input/output data should be more clearly detailed.\n-\tThe experimental section is very limited, and it is difficult to draw concrete conclusions from it. As a paper that is focused on a new application, the experimental section should be far more extensive. \n-\tThe comparison with a standard GAN and DiscoGAN do not make sense. Of course these two types of GANs will not be able to generate ternary compositions if they are trained with binary compositions only. A more reasonable comparison would be with GAN /  DiscoGAN trained using the dataset generated by “Step 1 + Feature Transfer” or by Feature Transfer applied to the raw data.\n\nSome additional questions/comments:\n-\tEqs. (3) and (4) are not regular reconstruction loss functions, they are cycle consistency losses.  \n-\tEqs. (12) and (13) do not look correct. The “sum” and the “min” (inside the sum) use the same variable index “i”. I do not understand these equations.\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}