{"title": "The paper is well written, however some experimental results are incomplete/unclear and discussion is lacking", "review": "1. The numbers in Table 1 should be compared with the %-age of examples that were actually fooled to begin with by using each adversarial attack scheme under study. Only then can the recovery performance of the hand-tuned bilateral filtering be put into perspective.\n2. In case of the adaptive filtering method, the parameters for bilateral filtering are predicted by a standalone classifier. For the experiments to be fair, any incoming image, whether adversarially perturbed or not, must be filtered using the parameters predicted by the classifier. Thus, are the results in the column titled 'clean' pertaining to when natural (unperturbed images) are filtered and tested? If not, then what are the accuracy values in that case.\n3. Also in Table 2, the case (B) measures the ability of the adaptive filtering to change the predicted label from the adversarial label to a 'new' one.  In this case, it is important to measure/verify whether the 'new' label is benign or malignant (which may well depend on the specific task of classification and the semantic associations of the output classes). Without this analysis for the 'new' class, it seems irrelevant and even misleading to quote this measure.\n4. It is unclear what the relation between the results in Table 2 and Table 3 is. How are the values in the two tables linked, if at all?\n5. In Table 3., once again, what does 'clean' column report? Are the natural images adaptively filtered and then tested for accuracy? If not, then do also report those numbers in a separate column. \n6. It is really evident in Table 3 that as the adaptive filtering is applied and the robustness seems to improve (as measured in terms of the accuracy figures for the various attack schemes), the accuracy for natural/clean images consistently and significantly drops. There has not been discussed anywhere in the paper. What does this imply? It should be highlighted in text and maybe even graphically, plotting the tradeoff between robustness gain (on adversarial images) and accuracy loss (on clean images). \n7. Some claims in the paper are unsubstantiated: (a) 2nd para, pg 7 - an adversarial detector or a human eye would be able to detect those attacks. Do the authors have any quantitative figures to share on how well a detector or human subjects would fare at this task? (b) Larger perturbations are visually discernible and thus less adversarial? Again, from the images in row 2, fig2, one can notice that there is a higher quotient of noise but this doesn't in any way interfere with the recognisability of those images by a human. How are they less adversarial when humans are not affected by the perturbations as concerns the classification task?\n8. What does the column title 'natural' in Table 5 correspond to, especially as it is a subcolumn of an attack scheme? Also, the numbers in Table 5 seem to be the fooling rates. This is inconsistent with the remaining tables where accuracies are being presented. Do you think it would be better to convert these to accuracy figures too?\n\nI am interested in knowing the authors' responses on the above points before I can propose my final rating.", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}