{"title": "Conditional convolutional nets with transformations at latent space. Similar models have been studied before.", "review": "This paper proposed a conditional convolutional net for image synthesis. The main novelty, as the authors argued, is to apply transformations at latent space, with the weights of these transformations are also learned. The authors applied this model to a number of view synthesis tasks. \n\nThe paper is complete and in general well-written. The proposed system works reasonably well. I suggest the authors explain how the CTU mappings are learned in the main paper (step 2 of the workflow in section 3), instead of in the supp. This will help readers better understand the proposed CTU.\n\nMy main concern is the authors seem unaware of the many papers that have studied the problem a while ago. The idea of simultaneously learning features and transformation parameters was explored at NIPS 2016 with various names---dynamic filter networks [A], spatial transformer predictors [B], and cross convolutional networks [C]. While the first two learn transformation parameters applied to the image space, cross convolutional networks learn features and transformation parameters in latent space. It’s unclear to me how novel this paper is given these prior methods. They should at least be cited and discussed, and ideally compared with.\n \nMy second concern is the proposed CTU mappings are task-specific, and need to be hand-designed given the data. This limits the applicability of the system. This is maybe why results on mostly on carefully designed synthetic data. It’d be great to see results on real, in-the-wild images, as those NIPS 2016 papers did.\n\n[A] Dynamic Filter Networks. NIPS’16.\n[B] Unsupervised Learning for Physical Interaction through Video Prediction. NIPS’16.\n[C] Visual Dynamics: Probabilistic Future Frame Synthesis via Cross Convolutional Networks. NIPS’16.\n\n== post rebuttal ==\n\nThe authors didn't address my concerns. I've lowered my rating to 2.", "rating": "2: Strong rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}