{"title": "A good submission but not good enough", "review": "This paper presented a relational graph attention networks that could consider both node \nfeatures and relational information (edge features) to perform node-level and graph-level \nclassifications. The basic idea is to combine the graph attention networks (Veličković et \nal. 2017) and the relational graph networks (Schlichtkrull et al. 2018) to derive a hybrid \nnetworks. This paper is generally easy to follow and written clearly. Several experiments \nare conducted to demonstrate the performance of the proposed model. Although some promising \nresults have been achieved, I think there are several limitations regarding the novelty and \nsignificance of the proposed model. \n\ni) The proposed architecture is mainly adopted from the graph attention networks (Veličković \net al. 2017) and the relational graph networks (Schlichtkrull et al. 2018). Such a simple\ncombination is a good attempt to incorporate both node features and edge features but the\nnovelty is quite limited. \n\n\nii) In table 2, I don’t really see any promising results compared to baselines. There are \nlittle improvements over the baselines or even significantly worse. More importantly, \ncompared two schemes of this work, the ones with attentions are “almost” identical with ones\nwithout attentions, which implies that the proposed attentions mechanism is not really useful\nin practice. For most of newly proposed graph embedding algorithms, it is hard to convince \nit is indeed better without some significant improvements (at least 2% absolute accuracy more). \n\niii) For MUTAG dataset, the statistical information of this dataset is quite different from\nwhat I used to use. MUTAG is a standard dataset for testing graph-level classification for \nboth graph kernels and graph networks. MUTAG is a dataset of 188 mutagenic aromatic and \nheteroaromatic nitro compounds with 7 discrete node labels. Each chemical compound is labeled \naccording to whether it has mutagenic effect on the gram- negative bacterium Salmonnella \nTyphimurium. Could you explain why your MUTAG is now a single graph and is cast as node \nclassification problem?\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}