{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper propose a dual generator approach for learning to generate point clouds.  The proposed algorithm is a adversarial autoencoder with learned prior generation of point clouds. From this point of view, the novelty of the paper is limited, also, the authors failed to discuss all the related works properly. \n\n1. The problem of the point cloud generation of Achlioptas et al., (2018) is it can't generate arbitrarily many number of points. This issue has been discussed and addressed in those works \n\n* Li et al., Point Cloud GAN, ICLR workshop, 2019.\n* Yang et al., FoldingNet: Point Cloud Auto-encoder via Deep Grid Deformation, CVPR, 2018\n* Groueix et al., AtlasNet: A Papier-Mâché Approach to Learning 3D Surface Generation, CVPR 2018\n* Yang et al., PointFlow: 3D Point Cloud Generation with Continuous Normalizing Flows, CVPR 2019\n\nWith stronger prior in the generation process is even studied\n* Groueix et al., 3d-coded: 3d correspondences by deep deformation, ECCV, 2018\n* Li et al., LBS Autoencoder: Self-supervised Fitting of Articulated Meshes to Point Clouds, CVPR 2019\n\n2. The two generator approach is nothing new.  The first generator g_1 is the same as the \"learned prior\". There are many related works,  e.g.\n* Tomczak et al., VAE with a VampPrior, AISTATS 2018\n* Zhao et al., Adversarially Regularized Autoencoders, ICML 2018\n\n3. The paper is not well written, there are several wrong formats of citations and some typos, especially on math symbols, which hinders the reading.  (e.g. G is undefined in Algorithm 1)"}