{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "The authors trained recurrent neural networks (RNNs) augmented with episodic memory on a random dots motion discrimination (RDMD) task. They observe that agents with the episodic memory system learn to perform the task in fewer trials than those without. Further, they observe that varying the types of memories stored strongly influences the agents' performance.\n\nMy major concern about this paper is that it doesn't seem to provide new insight into the neuroscience of perceptual decision making or episodic memory. Do we believe that episodic memory/the hippocampus are actually involved in perceptual decision making tasks like RDMD? Is there evidence/discussion in the neuroscience literature suggesting that the hippocampus is invoked in RDMD in primates or humans? If the answer to either of these questions is yes, then it's necessary to make that case in the introduction/motivation section of this paper. If the answer to both is no, then I'm not sure what the purpose of modeling RDMD with episodic memory is.\n\nBasic Clarifications\nHow do you sample memories to retrieve? How are those retrieved memories then used? Are they provided as input to the RNN? Are they reinstated?\n\nHow are you training the parameters? You're using policy gradients, should we assume you're also using backprop/backprop through time?\n\nOther comments\nThis sentence doesn't sit well \"existing theory fails to describe how the brain selects experiences, from many possible options, to govern the decisions that are made.\", given\nMattar, M. G., & Daw, N. D. (2018). Prioritized memory access explains planning and hippocampal replay. Nature neuroscience, 21(11), 1609.\n\n\"This means that the additional viewing time for difficult trials was devoted to integrating sensory information.\" This claim doesn't seem justified.\n\nTypos\nrecognitive function -> cognitive function\nto predicting -> to predict\nat the beginning of the trial -> at the beginning of training\nOur result suggesting -> Our result suggests\n"}