{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "Summary: \nThe paper provides new information theoretic definitions for disentanglement under which the combination of statistical independence of factors and conditional independence are sufficient for achieving disentanglement. They then argued that existing approach do not successfully enforce conditional independence and thus propose new architecture that they claim improve the enforcement of conditional independence, and then show empirically that their methods work.\n\nDecision:\nReject. This paper makes a number of claims that are either conceptually problematic or mathematically incorrect.\n\nIssue 1: Conceptually problematic definitions of disentanglement\n\nFirst, their definition of disentanglement is problematic as it admits models that are arguably not disentangled. The proof that their definition admits such undesirable models can be constructed exactly via Locatello’s impossibility theorem in conjunction with use of an invertible model to ensure that “for any factor z_j, its containing information in data is irrelevant to other factors”. \n\nFor a simpler example consider the case of an invertible discrete latent variable model G: Z -> X where p(Z) is uniform. Suppose further that each dimension of Z is interpretable. Such a model satisfies the author’s information theoretic definition of disentanglement. However, if you permute the space of Z via a permutation function P, the resulting model will still satisfy the author’s information theoretic definition but fail to be interpretable. \n\nIssue 2: Misuse of the term conditional independence\n\nConditional independence of q(z|x) is strictly a consequence of the variational family of choice. The assertion that increasing the “no-sharing-parameter” block will further encourage conditional independence in q(z|x) is thus incorrect. Once you have committed to using a factorized Gaussian variational family, you are using a q(z|x) strictly satisfies conditional independence. Increasing the no-sharing-parameter block is will not “encourage” any additional independence. \n\nI am completely willing to accept the possibility that increasing the no-sharing-parameter block may empirically improve the recovery of interpretable features. However, attempting to justify the no-sharing-parameter block by appealing to a flawed application of information theory and misunderstanding of the variational family in VAEs hurts the legitimacy of the paper. \n\nI strongly recommend the authors to rethink the narrative of the paper."}