{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "On its surface structure, the paper looks well organized and existing literature on disentangled representations is well reviewed. However, the paper is extremely difficult to read and it is hard to follow the reasoning of the authors. I hope that the authors can clarify misunderstandings during rebuttal.\n\n“Existing works on disentangled representation learning usually lie on a common assumption: all factors in a disentangled representation should be independent. We argue that this assumption is not sufficient and another assumption is vital for disentangled representation learning: information contained in each factor of a disentangled representation is irrelevant to others, i.e. the containing information about data of factors is isolated. “\n\n-How can the first sentence be claimed if there is not a consensus about the formal definition of disentangled representations as stated in the introduction?\n- Assuming that ‘.. [Independence] is not sufficient  for disentangled representation learning’. Then you propose an additional assumption that seems to be the central contribution of the present paper:\n\n‘information contained in each factor of a disentangled representation is irrelevant to others, i.e. the containing information about data of factors is isolated’.\n\n- I don’t understand this notion of information that must be different than independence, namely that ‘information contained in each factor [...] is irrelevant to other [factors] ’ and \n‘the containing information about data of factors is isolated’.\n\nI guess the notions of ‘data of factors’, and ‘information being isolated’, ‘irrelevant information’ need to be clarified. The text in the introduction is unfortunately also not very helpful\n\n“... Since each factor [...] corresponds to a single factor of variation in data, \neach factor only contains the information of the corresponding factor of variation in data.”\n\nI think there is a collection of ‘factors’ and a collection of ‘factors of variation in data’, and between these two objects there is a correspondence. The statement ‘each factor only contains the information of the corresponding factor of variation in data’ implies that a ‘factor of variation in data’ is an object that posses information that is contained in the factor.\n\t\t\t\t\nAt the end of the introduction, the authors state \n‘conditional independence originates from no-sharing-parameter block and the independence’ of noise in reparameterization trick, which can be regarded as inductive biases on model. \n\nThis statement is alarming as it hints at a clash of terminology, the concept of independence in the information theoretic/probabilistic sense -- that is the density of two random variables can be written exactly as the product of marginals -- with ‘the lack of a functional dependence’. \n(Consider the Box-Muller method for generating independent Gaussian random variables x and y, where x = r cos(2pi u) and y = r sin(2 pi u) where u is uniform on the unit interval and r is exponential with rate 2. x and y are independent random variables but they are both functions of  r and u. Hence parameter splitting is not necessary for independence.)\n\nThen, we encounter (9) and the following statement \t\t\t\t\n\"To conclude, conditional independence originates from no-sharing-parameter block and the independence of noise in reparameterization trick, which can be regarded as inductive biases on model.\"\n\nUnfortunately, this conclusion is not correct. (9) is the defining property of an encoder with a factorized Gaussian -- it does not follow from 'non-sharing' of parameters. To see this, assume each mu_j = f(x), i.e. all means are the same, all parameters are shared. This is not a very flexible encoder distribution but still enjoys the same conditional independence structure, because parameter sharing and independence are different concepts. \n\n(8) is misleading as mu and sigma are not random variables in a VAE.\n\nI suspect there may be some interesting ideas here but the paper clearly needs further iterations for clarification of concepts so it is accessible for the general technical audience.\n"}