{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes to combine beta-VAE and t-SNE for anomaly detection.\nAlthough the problem and the proposed approach is relevant, I have the following concerns.\n\n- The problem setting is not well explained.\n    In particular, it is not clear whether the setting is unsupervised or not.\n    It seems that the proposed method is for unsupervised anomaly detection.\n    However, the authors mention that beta-VAE is trained on normal data, which means that it is not unsupervised.\n    Please clarify this point.\n- The originality and the technical quality of the proposed method is not high as it is a straightforward combination of two existing method.\n    If the proposed combination has some theoretical advantage for anomaly detection, the paper becomes more interesting.\n    However, there is no theoretical analysis of the proposed method, hence the significance of the contribution is hot high in its current state.\n- Experimental results are not convincing.\n    * The authors argue that the t-SNE step is important as the proposed method is better than the naive beta-VAE.\n      However, Figure 2 shows that in most cases the score becomes better as \\alpha gets larger and shows the best score if alpha = 1.\n      From Equation (2), this means that the t-SNE step does not contribute to the anomaly detection performance.\n      This inconsistency should be carefully discussed.\n    * Also, Figure 2 shows that beta should be small and the best score is achieved when beta = 0 in most cases.\n      This means that representation learning is not meaningful and the raw representation (feature vectors) may be already effective for anomaly detection.\n      Hence the significance of the proposed method is not convincing.\n"}