{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This work proposes a method to transfer information from PET imaging data from the medical domain, where data is highly available, to the industrial one, where data is scarce, in the context of non-destructive material quality evaluation. The basic idea seems interesting, but unfortunately in the present form he paper is very difficult to appreciate, as it lacks of important details concerning methodology, experimental results, and comparison with respect to the state-of-the-art. Moreover, the manuscript still appears in a draft form. Sentences are often broken, the text presents many typos and grammar mistakes, and the citations are not understandable. \n\nMissing methodological details are grouped in the following parts of this review.\n\nSection 3.2 Encoder\nParagraph 2: The authors claim that they introduce the knowledge of migration learning without explaining it. Where does this concept come from? Is there a literature about it or is this a new concept?\n\nMedical images are fitted though a variational auto encoder (VAE) (citation missing). The encoder description is minimal and lacks of implementation details (see Eq. 3), while the decoder description is missing throughout the paper. \n\nEq. (2): the authors write that they obtain a distribution p(x) according to Eq. (2), but this equation is just the formula for the sample mean, where p(x) is sampled and not computed.\n\nEq. (3): f1 and f2 are never made explicit in the paper so we do not know if they are linear or non-linear functions. The prior p(Z) is decomposed as a summation of posteriors p(Z|X) and the choice to have these posteriors equal to N(0,1) (1-dimensional, which is unusual) regardless of the data point X is not explained.\n\nSection 3.3 Feature extraction memory module\nFeature extraction from industrial images is done through principal component analysis (PCA). In the same paragraph is written that features are extracted through convolution neural networks (CNN). So it is not clear if there is an arbitrary choice to use PCA or CNN, and what are the conditions when this happens.\n\nEq. (6): the score between z_t (medical image distribution) and y_s (industrial image feature vector) is computed as scalar product dot(z_t , W_a * y_s). The key link is the linear mapping W_a, which is never made explicit in the paper. How do the authors compute W_a ?\n\nSection 4.1 Implementation details\nthe networks called “identification network” and “front-end network” are not well defined. They may refer to the  VAE, the CNN, the Adversarial Nets. There is too much ambiguity. A captioned figure can help in resolving the ambiguities.\n\nSection 4.2 Dataset\nIn the first paragraph the authors cite a dataset of CT images, while the main focus of the paper is on PET images. How the CT images comes into play?\n\nSection 4.3 Evaluation\nThe authors compare their method with respect to other three methods, namely VAE, DCGAN, and WGAN.\nThe implementation details of the competing methods are not described so we cannot be sure about the fairness of the comparison.\n\n\nOther considerations\nIntroduction, 4th paragraph: “imaging quality is higher” With respect to what? Usually PET images have the worst quality in the medical domain.\nIntroduction, 3rd-to-last paragraph: “We use the medical CT image ...”. Should be PET images\n\nRelated work: This section is a list of works and the relation with the current paper is not highlighted.\n“lung cancer cakes” what are they?\n\nParagraph 3.2: “excessive pursuit of quality” why is it bad? “migration learning” do they mean transfer learning? Equation 2 and 3 in relation to a clustering problem never pointed out before in the paper.\n\nParagraph 4.1. What is the meaning of “Adam algorithm(=0.5)” ?\n\nFigures 1 and 2 have very minimal captions. What do they represent?\n\nCitation formatting problem: name and surname are switched. Journal/conferences often omitted."}