{"title": "Decent idea but need more motivating experiments.", "review": "The paper proposes to reparameterize the discriminator to be an explicit function of two densities so that one could inject domain specific knowledge easily. As the authors say, that one way to inject domain specific information is by learning an energy function. Making use of this intuition, authors proposed to  regularize the discriminator in  \n(GANs) framework by leveraging structured Gibbs distributions.\n\nI found the introduction a bit hard to read. Otherwise paper is written in a readable way. \n\nSomething which I like about this paper, is authors use the proposed method for actual RL problems as compared to just image generation. I think this is important as well as interesting.  As a community we should be moving towards evaluating generative models for the problems where we actually want to use generative models for.\n\nSome questions:\n\n- I'm not sure if the paper is really novel as the authors themselves point out that it corresponds to adding adversarial component in R2P2. \n- I also did not find results very convincing. As I said, its important to evaluate on RL problems ONLY if it makes sense on toy problems first. Like in the paper, authors made a big claim about reducing spurious modes, but it has not been demonstrated any where per se. May be authors can construct a toy problem in which they can show that the spurious mode issue, and how the proposed method kills these spurious modes.  This also reminds me of the literature in Boltzmann machines and more recently in Variational Walkback [1]. This could also be cited, and could be interesting to authors.\n\n[1] Variational Walkback, https://arxiv.org/abs/1711.02282. The authors in Variational walkback also make the assumption p == q. \n\nWhat would make the paper stronger ?\n- Constructing toy problems in order to illustrate the mode coverage and spurious modes issue would be interesting.", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}