{"title": "Regularization of GANs to remove spurious modes - but is this what is needed?", "review": "Summary: The paper tries to answer the problems of regularizing GANS. They reparametrize the discriminator to be an explicit function of two densities: the generator probability density function q and a structured Gibbs distribution v.  \n\nComments:\n1: This paper focuses on mode coverage problems, where spurious modes of learned model(q) not supported by target model(p) are pruned off.  It is not clear why this is a significant problem.  GAN trained models typically suffer from mode collapsing, requiring additional noise injection to support generation of diverse data.  This work seems to argue that the opposite is worth paying attention to, focusing on removal of modes.\n\n2: The implementation of the architecture is similar to R2P2, except for the introduction of a new adversarial component. But according the evaluation in table 1 and table 2, we see that baseline model R2P2 performs better in -H(p,q) and for -H(q, pKDE) the value is near equal to their model. \n\n3: They assume the generator is invertible, which enables the analytic evaluation of the q. But no supporting evidence or design architecture for the statement above is provided.\n\n4: The explanation of imposing structure on the model distribution is not clear. In the introduction they first claim “we cannot impose structure directly on the joint distribution of a GAN’s outputs.” But after they claim “we submit that regularizing the structure of a GAN’s generator and discriminator is generally more difficult than imposing meaningful structure directly on the model distribution, which we will refer to as q. These two statements conflict because the model distribution is a joint distribution of GAN’s outputs.\n\n\n6 Typos: \n1)\tin equation(1) we should minimize q for all the terms. \n2)\tin equation(1) first term is unrelated with v. \n3)\tin equation(1) the sup is for the last two terms. \n4)\tin equation(2) in RHS of equation the first term q_ |  should be q_ .\n\n7: Writing could be improved.\n\n8: In table 2 what’s the meaning of evaluation metric Road%\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}