{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper proposes a novel deep machine learning model called TabNet for learning from tabular model. The system builds on sequential feature acquisition that is aggregated to perform decisions. The performance of TabNet is evaluated in a set of experiments.\n\nThe paper proposes a network architecture which seems to achieve good performance on a set of experiments. However, I am missing a motivation for parts of the model. A broader ablation study in which certain components of the model are replaced by simpler network structures could be instructive; the current ablation study only investigates hyper-parameters and a few design choices -- but what happens for example if a feature transformer is simply replaced by fully connected layer instead of the used architecture, i.e. how general is the structure? Regarding experiments I am also missing details and a broader comparison with other methods.\n\nSome more questions/comments:\n* What is the training criterion used?\n* In Table 1, what precisely is AUC? Area under \"accuracy over selected features\"? If so, what does the number \"No sel.\" mean?\n* Why is \"No sel.\" performing relatively bad? Overfitting? \n* What about stronger feature selection baselines, like those based on Shapley values?\n* What do the errors in table 1 mean? Which numbers are marked in bold? This seems misleading when looking at the \"error bars\".\n* What are the std errors for all other tables?\n* What is the \"ratio\" in Figure 6a? Why does the figure not show INVASE?\n* There are other instance-wise feature selection methods, e.g. Chao Ma et al.'s \"EDDI: Efficient Dynamic Discovery of High-Value Information with Partial VAE\" or . How does the proposed method compare against those?\n* For making a claim about tabular data in general, more datasets should be considered.\n\nMinor comments:\n* Figure 1: It would support the reader to explain the blocks in the figure caption."}