{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper introduces a novel class of clean-label attacks of deep model training procedures (from scratch) using a meta-learning inspired approach. \n\nPros:\n1) Transferability across different training strategies is a particularly important novelty of this work, I think.\n2) I find it particularly impressive that a clean-label attack is shown to work when training from scratch, which reduces the amount of knowledge about the model needed by the attacker.\n3) The meta-learning formulation presented here may prove to be the starting point of many future investigations.\n4) Multi-targeted attacks and third-party attacks appear to be novel contributions of this paper, but there is too little context given to judge that from the text alone.\n\nCons:\n1) The figures are not too informative. Could you please provide more examples in an appendix?\n2) The writing could be much improved, especially for making the paper more accessible to a wider audience.\n3) Details of the meta-learning procedure and related works are almost non-existent. While the authors provide a discussion of what's possible and challenging for current adversarial attack methods, many details and citations are missing. This makes the many comments and explanations in the text obscure, although they may be correct and insightful. Could you please work on the writing and assume that I know nothing of the SOTA in adversarial attacks? I am willing to read the paper again.\n4) There is far too little detail about experimental procedures. Please provide a detailed discussion with references to established procedure or previous works!\n- What are the meta-training/meta-validation and meta-testing sets? \n- What is a reasonable baseline you could compare against? If nothing else, please argue for that in the paper and perhaps provide an ablation of your method as a baseline.\n\nAs far as I can tell, the paper may be introducing an approach with potential, but many clarifications are required. The paper is not self-contained enough to even attempt to guess how important or novel the presented results are. Hence, all I can do is judge the little I have managed to understand from the paper. While this may be enough for a workshop, I cannot at this point recommend acceptance, primarily because of the writing. "}