{"title": "The proposed criterion has has already been examined in some prior works while  little is discussed on the related works.", "review": "This paper considers the optimization of the prior in the latent variable model and the selection of the likelihood function. The authors propose criteria for these problems based on a lower-bound on the negative log-likelihood, which is derived from rate-distortion theory.\n\nThere are some interesting points in the derivation of the proposed quantities and how to compute them while the main criterion c(z) has already been examined in some prior works. Although the results of experiments are promising, they are somewhat weak enough to demonstrate the usefulness of the proposed quantities.\n\n- The note right after Eq.(7) is unclear. It would be nicer to discuss more clearly the property of c(z) about overfitting.\n\n- The derived quantity c(z) in Eq.(6), appearing in the optimality condition (the equation following Eq.(13)), has been pointed out since early times, e.g. in\nLindsay, B. G. (1983). The geometry of mixture likelihoods: A general theory. The Annals of Statistics, 11(1), 86–94.\nIt was used in the machine learning community too:\nNowozin, S., Bakir, G. (2008). A decoupled approach to exemplar-based unsupervised learning. In Proc. ICML.\n, and its connection to rate-distortion theory was pointed out:\nWatanabe, K., Ikeda, S. (2014). Entropic risk minimization for nonparametric estimation of mixing distributions. Machine Learning, 99(1), 19–136.\nHowever, little is discussed on these related works.  \n\n- Section 2: Shannon's rate-distortion theory is formulated by a general source distribution of X. It would be better to mention that the authors consider the empirical distribution of the data sample as the source distribution.\n\n- The results of experiments only show the potential of glossy statistics in some variational auto-encoder models. Isn't it possible or better to demonstrate its practicality more concretely using small toy models? \n\nPros:\n- nice connection between the optimization of the prior (or likelihood function) and rate-distortion theory\n\nCons: \n- lack of discussion on important related works\n- weakness of the experiments\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}