{"title": "Several inconsistencies", "review": "This paper proposes a new detection method for adversarial examples, based on a prior network, which gives an uncertainty estimate for the network's predictions.\n\nThe idea is interesting and the writing is clear. However, I have several major concerns. A major one of these is that the paper considers \"detection of adversarial attacks\" to mean detecting adaptive and non-adaptive attacks, while the latter are (a) unrealistic and (b) a heavily explored problem, with solutions ranging from clustering activations, to denoising the image via projection (in particular, once can use any of the circumvented ICLR 2018 defenses which all work in the non-adaptive sense, and check the prediction of the denoised image vs the original). Thus, the paper should focus on the regime of adaptive attacks. Within this regime:\n\nMotivation:\n- This work seems to suggest that dropout-based detection mechanisms are particularly successful. While Carlini & Wagner finds that the required distortion (using a specific attack) increases with randomization, the detection methods which used dropout were still completely circumvented in this paper.\n\n- The claim that adversarial examples are \"points off of the data manifold\" is relatively unmotivated, and is not really justified. Justification for this point is needed, as it forms the entire justification for using Prior Networks.\n\n- Detecting adversarial examples is not the same problem to detecting out-of-distribution samples, and the writing of the paper should be changed to reflect this more.\n\nEvaluation:\n- 100 iterations is not nearly enough for a randomization-based or gradient masking defense, so the attacks should be run for much longer. In particular, some of the success rate lines appear to be growing at iteration 100.\n\n- There is no comparison to any other method (in particular, just doing robust prediction via Madry et al or something similar); this should be added to contextualize the work.\n\n- The term \"black-box\" attacks can take on many meanings/threat models. The threat models in the paper need to be more well-defined, and in particular \"black-box attacks\" should be more accurately defined. If black-box attack refers to query-based attacks, the success rate should be equal to those of white-box attacks (or very close to it), as then the attack can just estimate the gradient through the classifier via queries.\n\n- The fact that the attacks do not reach 100% on the unprotected classifier is concerning, and illustrates the need for stronger attacks.\n\nSmaller comments:\nPage 1: Abstract: Line 4: missing , at the end of the line\nPage 1: Abstract: Line 5: “However, system can“ missing a before system\nPage 1: Abstract: Line 10: “have been shown” should be “has” instead of “have”\nPage 1: Abstract: Line 13: “In this work” missing a , after\nPage 1: Last paragraph: Line 2: “investigate” missing an s and should be “investigates’\nPage 2: Section 2: Line 5: “in other words” missing a , after\nPage 2: Section 2: Line 8: “In order to capture distributional uncertainty”  missing a , after\nPage 2: Last paragraph: Line 2: “Typically” missing a , after\nPage 3: Paragraph 2: Line 1: “In practice, however, for deep,” no need for the last ,\nPage 3: Section 2.2: paragraph 1: Line 2: “a Prior Network p(π|x∗; θˆ), “ no need for the last ,\nPage 3: Section 2.2: paragraph 1: Line 3: “In this work“ missing a  , after\nPage 3: second last paragraph: Line 1: refers to figure as fig and figure (not consistent)\nPage 3: second last paragraph: Line 3: “uncertainty due severe class“ missing “to” before “severe”\nPage 4: Paragraph 1: Line 2: “to chose” should be “to choose”\nPage 4: Paragraph 2: Line 1: “Given a trained Prior Network“ missing a , after\nPage 4: Paragraph 2: two extra ,\nPage 6: paragraph 1: Last line: 5 needs to be written in words and same for 10 in the next paragraph\nPage 7: section 4.2: paragraph 3: “For prior networks” need a , after\nPage 8: Paragraph 1: Line 6: “and and”\nPage 8: Conclusion: Line 4: “In section 4.2” needs a , after\nPage 8: Conclusion: Line 7: “it difficult” missing “is”\nPage 8: Conclusion: Line 9: “is appropriate” should be “if” instead of “is”", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}