{"title": "An improvement to relaxed sort operators; some even-harder experiments", "review": "This work builds on a sum(top k) identity to derive a pathwise differentiable sampler of 'unimodal row stochastic' matrices. The Plackett-Luce family has a tractable density (an improvement over previous works) and is (as developed here) efficient to sample. \n\n[OpenReview did not save my draft, so I now attempt to recover it from memory.]\n\nQuestions:\n- How much of the improvement is attributable to the lower dimension of the parameterization? (e.g. all Sinkhorn varients have N^2 params; this has N params) Is there any reduction in gradient variance due to using fewer gumbel samples?\n- More details needed on the kNN loss (uniform vs inv distance wt? which one?); and the experiment overall: what k got used in the end?\n- The temperature setting is basically a bias-variance tradeoff (see Fig 5). How non-discrete are the permutation-like matrices ultimately used in the experiments? While the gradients are unbiased for the relaxed sort operator, they are still biased if our final model is a true sort. Would be nice to quantify this difference, or at least mention it.\n\nQuality:\nGood quality; approach is well-founded and more efficient than extant solutions. Fairly detailed summaries of experiments in appendices (except kNN). Neat way to reduce the parameter count from N^2 to N.\n\nI have not thoroughly evaluated the proofs in appendix.\n\nClarity:\nThe approach is presented well, existing techniques are compared in both prose and as baselines. Appendix provides code for maximal clarity. \n\nOriginality:\nFirst approach I've seen that reduces parameter count for permutation matrices like this. And with tractable density. Very neat and original approach.\n\nSignificance:\nMore scalable than existing approaches (e.g: only need N gumbel samples instead of N^2), yields better results.\n\nI look forward to seeing this integrated into future work, as envisioned (e.g. beam search)", "rating": "8: Top 50% of accepted papers, clear accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}