{"title": "I am skeptical about the need of using POS tags for the text style transfer task.", "review": "The paper presents a neural network architecture for unsupervised text style transfer. The key differential of the proposed architecture is the use of part-of-speech tagging (POS) information to enforce  content preservation. The authors limit the use of POS tags to identify nouns, and employ them in the computation of two loss functions: POS loss and language model loss.\nThe authors present experimental results for two different datasets and show competitive results when compared with other recently proposed neural net architectures.\n\nThe paper have some major issues, as listed below, which makes me inclined to vote for rejection:\n-\tThe novelty is very limited. The use of nouns to enforce content preservation was already explored by Melnyk et al. (2017) and the idea of using language models was already proposed by Yang et al (2018). Although the way that the losses are computed in each of these papers are somewhat different from the submitted paper, the key ingredients are the same. Additionally, the authors do not present any comparison with these methods.\n-\tThe proposed strategy goes in a different direction of the current trend in Deep Learning-based NLP approaches. Researchers are trying to move away from classical pipelines that use NLP tools such as POS taggers. Moreover, it is not clear if the POS-based loss is essential for the architecture because there is no ablation experiments showing the importance of each one of the component: attention, POS loss, lm loss. The ablation experiment presented is quite weak and only shows the contribution of the lm loss. Additionally, another recent paper (dos Santos et al.  2018) has shown that just using back-translation or attention is enough to have good content preservation. In summary, I am skeptical about the need of using POS tags for the text style transfer task.\n\nSome minor questions/comments:\n(1)\tWhy do you name your method “structured”? Because of the use of nouns? As far as I understand, a set of nouns do not save the structure of the original sentence where they are employed.\n(2)\tModel description is not clear. Passages like “After switching the style representation, we can get the generated sentence ~yi” should be improved to include more detail and clarity.\n(3)\tWhat exactly is d_i in eq. (8)? Is it the normalized distance between the noun “i” in the input and all nouns in the output ?\n(4)\tThe authors have used the following question for the human evaluators: “Which sentence has an opposite sentiment of the original sentence and at the same time preserves the content of it?”. I am not sure if this is the right question to be asked since it is quite geared towards the type of transfer that their model does. I was expecting a more neutral question.\n(5)\tThe authors do not inform what POS extends for. Please note that ICLR has a diverse audience, NLP researchers are not the majority in this conference.\n\n\nReferences:\nYang et al. Unsupervised Text Style Transfer using Language Models as Discriminators. Arxiv 2018\nDos Santos et al.  Fighting Offensive Language on Social Media with Unsupervised Text Style Transfer. ACL 2018.", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}