{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper contributes theoretically to the information bottleneck (IB) principle. In particular, the author(s) provided theoretical reasoning on the phase transition phenomenon: when the beta parameter of IB varies, the generalization performance changes in a stepwise manner rather than continuously. The core result is given by theorem 1: the phase transition betas necessarily satisfy an equation, where the LHS is expressed in terms of an optimal perturbation of the encoding function X->Z.\n\nOverall, the reviewer believes that this work is a solid contribution to the IB principle, and should be accepted. Remarkably, this work gives the first formulation on the phase transition of IB, which was an empirical observation. Furthermore, the author(s) give an algorithm to find the transition betas, which agrees with empirical studies on CIFAR and MNIST datasets.\n\nThe reasons for the weak acceptance instead of a strong acceptance are explained by the following weaknesses.\n\nAs a theoretical contribution, it is important to have good formulations and clear statements. The quality of the mathematical statements is not satisfactory and can be largely improved.\n\nDefinition 1: introduce the concept of relative perturbation first. As a definition, it must be self-contained. Therefore introduce the second-order variation first (don't point to the appendix).\n\nLemma 0.1: inf_r(z|x) \\mathcal{G} \\ge \\beta, is equivalent to \\forall r(z|x), \\mathcal{G}\\ge\\beta, the latter is more elegant. What is \\mathcal{G}, anyway?\n\nLemma 0.2:  State the condition on the scale of the $\\Delta\\theta$. The reviewer suspects that if $\\Delta\\theta$ is large enough, the statement can be violated.  This lemma feels like a digress. Why the Fisher information is needed for explaining the phase transition?\n\nTheorem 1: the statement is fine. It is better to have all conditions/assumptions listed as this is the core theorem. To be more complete, the authors can discuss the number of roots after the theorem and what happens if there is no root. In general, there have to be a few remarks after theorem 1.\n\nDefinition 2: \\rho_r(X,Y;Z) is defined with respect to what? For example, state \"Given a joined distribution p(X,Y), the representation maximum correlation....\". Use a different equivalent symbol for definition, such as \":=\".\n\nTheorem 2: Again, \\forall{f(x,z)} is with respect to what? In the \"if\" part of the \"if-then\" statement, \"\\forall{f(x,z}}, it can be decomposed as ..\" is a false statement, change to \"If f{x,z} can be decomposed\"\n\nIn the abstract, avoid citations, and explain X, Y, Z, p(z|x), for completeness.\n\nAs the paper is over the recommended length,  the reviewer is asked to be harsher in the assessment."}