{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "In this paper, the authors studied the phase transition in the information bottleneck, which is defined as the point where the IB loss landscape changes. The authors give a theorem showing the practical condition for IB phase transitions which is related to Fisher information. Then an algorithm finding IB phase transitions are proposed and applied to MNIST and CIFAR10 dataset.\n\nThe paper is well-organized. The problem formulation, definition, theorem, algorithm and application form a whole story about finding IB phase transition. However, I found that the motivation of this paper is not very clear. Why do we want to find the IB phase transition accurately by running such a complicated algorithm (Algorithm 1). Usually, the scalar \\beta is considered as a hyperparameter. By tuning \\beta, one can easily produce Figure 1 and see some phase transition points. One can also tune \\beta to learn different classed as shown in Figure 3(b). So designing a complicated coordinate-descent based algorithm to find a parameter seems overkilling the problem.\n\nMoreover, the mathematical part of this paper can be made more accurate. For example, in definition 1, the authors write \"\\eta << \\beta\" and \"|\\epsilon| << 1\", where the quantities \\eta and \\epsilon are used many times in the proof. However,  \"<<\" is not a rigorous mathematical symbol. The authors should consider rewrite their proof by using limit.\n\nTherefore, I think the motivation and the mathematical quality of this paper can be further improved before getting accepted.  "}