{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "In recent years, the information bottleneck has emerged as a useful framework for understanding deep networks.\nIt provides a framework for theoretically motivating the choice of a intermediate representation T when learning to predict Y given X.  The constrained optimization required by the information bottleneck is often pursued using Lagrange multipliers.  Previous work by Kolchinsky, et al pointed out that, when Y is a deterministic function of X, the Lagrange multiplier technique breaks down, and also that solutions to the information bottleneck criterion are degenerate.  They proposed a simple modification to the objective arising from application of Lagrange multipliers that, in a sense, always \"works\", even in the case that Y is a deterministic function of X.  \n\nThis paper proves that a more general family of modifications of the Lagrange multipliers, in a sense, \"work\".   They also provide solid experiments supporting this theory.  They also show how the appropriate Lagrange multiplier depends on the amount of \"compression\" from X to T desired. \n\nThe paper is very clear and very well-written.  The description of previous work is extensive, and interesting.  In a sense, proving that a more general family of methods work makes it clear why the method of Kolchinsky, et al worked.  Having a mapping from the desired compression level to the required Lagrange multiplier seems potentially valuable.\n\nOn the other hand, I do not see why it is especially valuable to have methods to compute the degenerate solutions in the deterministic case.  Generally, the contribution feels a little incremental and technical to me.  I would not argue against accepting the paper if others like it."}