{"title": "Interesting idea, but insufficient comparison to existing work", "review": "PAPER SUMMARY\n-------------\nThis paper proposes a method for inferring the latent state and making predictions based on a sequence of observations. The idea is to map the observation to a latent space where the relation to the latent state is linear, and the dynamics of the latent state are locally linear. Therefore, in this latent space a Kalman filter can be applied to infer the current state and predict the next state, including uncertainty estimates. Finally, the predicted latent state is mapped to a prediction for the observation or some other variable of interest.\n\nThe experiments show that the proposed approach slightly outperform LSTM and a GRU based approaches.\n\n\nPOSITIVE ASPECTS\n----------------\n- The idea of applying a Kalman filter in a latent space is interesting.\n- The experimental results show that the proposed approach outperforms LSTM and a GRU based approaches.\n- The paper is well written.\n\nNEGATIVE ASPECTS\n----------------\n- The observation noise sigma^obs is a function of the observation itself. This seems strange, since typically the observation does not contain itself the information about how much it has been corrupted by noise. This choice should be discussed in more detail, especially what kind of assumptions this implies about the underlying process.\n- I believe that a more detailed comparison to existing approaches finding a latent space from a sequence of observations would be necessary, both on a technical as well as on an experimental level. For instance, a technical comparison to the approach from Watter et al. 2015 would be appropriate, since it is similar in the sense that the latent space is optimized to have locally linear dynamics. \nFurthermore, an experimental comparison to Watter et al. 2015 and [1] would be relevant.\n\n\n\n[1] Wahlström et al. 2015 - From Pixels to Torques - Policy Learning with Deep Dynamical Models\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}