{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "I Summary\nThe paper directly answers two sanity checks for saliency maps proposed by Adebayo et al (2018): 1. randomizing the weights of a model to prove that the input's resulting saliency map is different from a trained model' saliency map.  2. randomizing the inputs' labels to make the same proof. The authors propose a \"competitive version of saliency method\" which uses the saliency scores of every pixel for each labels and zero out: positive scored pixels that would not be maximal for the predicted class and negative scored pixels that are not minimal for the worst predicted label.\nOverall the method solves the aforementioned sanity checks, the authors claim it also generates more refined saliency maps.\n\nII Comments\n\n1. Content\nThe paper can be hard to read, due to multiple writing mistakes, abrupt phrasing, not well-articulated sentences. However, the idea is easy to understand and interesting but the contribution does not seem strong enough in its actual state. \nMy main concern is that the method seems to be designed only to answer the sanity checks: the resulting saliency maps can hardly be seen as more informative as other existing methods (eg figure 1). Quantitative measures (ROAR & KAR, Hooker et al. 2018) or surveys to show that the newly obtained saliency maps are more refined or help to best localize regions of interest would be a big bonus.\n\n2. Writing\nThe paper comports numerous typos, those do not impact the score of the review except if the sentence is not understandable. Please see the following points as support to improve the clarity of the paper.\n- Abstract last sentence: \"Some theoretical justification is provided\" -> \"Some\" is vague and makes your claim less credible -> \"theoretical justifications are given in the last paragraph to support our method...\"\n- Intro \n   paragraph 2 first sentence lack some words, l 2 product -> a product\n   \"See paper XX et al\" -> \"As in XX et al, we can see that\" or \"As stated in XX et al\", \"See\" is too familiar, formalizing the phrasing gives more credibility to your work\n- Related work\n  \"To give an example, does the map change a lot if we blank out or modify a portion of the image that humans find insignificant Kim et al. (2019)? \" This is not very well articulated, \"a lot\" is vague and a little familiar, \"significantly\" could be used here. Moreover, the citation is a little abrupt \"as we can see in XX\" would work better \nLittle typo on etc..\n\"fare best\" -> far better? The wording is still vague, it would help to add a quantitative measure\nthat's -> that is\n- Section 3\n\"This figure highlights\" -> which figure? (I think you just missed citing the fig here)\n- Section 4\nFirst sentence: Why is it a good idea? The claim is a little abrupt and could be detailed a little more\n\"destroy the saliency map\" -> destroy is a very strong word\n\"These random variables are complicated.\" -> This statement seems a little out of place and abrupt\n\"some constants\" -> \"constants\" (too vague otherwise as before)\n- Subsection 4.1\n\"randomly sampling a few such methods\" I believe there is a typo?\n\"See figure 3\" is abrupt as a sentence itself \"as you can see in figure 3 bla bla\"\nFigure 4 The image is small and hard to see on printed paper (same for the images in the appendix, they could be stacked over multiple lines instead of just one horizontal row)\nDefinition 2 punctuation at the end\n- Section 5\n\"The available code for these maps is slow, and computing even gradient for all 1000 ImageNet labels can be rather slow.\" What is the aim of this sentence?\n- subsection 5.3 \nlables -> labels\n\nIII Conclusion\nThe method itself is interesting, it would be interesting to see more qualitative results on the obtained saliency map itself: Does it produce more information? Is it more meaningful etc. Because as of now, it only seems to answer the two aforementioned sanity checks.  As for the writing, it is not always clear and can impede the understanding of the paper. I would be glad to change my review if those points are addressed.\n"}