{"title": "Review", "review": "Summary:\nThis paper gives a novel adversarial defense that consists of denoising images before classification. The denoising procedure consists of passing an image through a bidirectional GAN, which the authors use to map inputs to the latent space and then back to the original input space. \n\nNovelty:\nThe exact mechanism through which this paper operates is novel, but many similar defenses have been proposed before that involve a latent space mapping followed by a mapping back to the original space; examples include DefenseGAN and PixelDefend. \n\nConcerns:\n- The evaluation is not thorough enough: Only two attacks are considered (FGSM and PGD, with the former being strictly weaker than the latter)\n- DefenseGAN is similar in defense mechanism but the authors do not attempt to use the attacks of Athalye et al 2018 (ICML 2018) in their evaluation. We thus do not have strong lower bounds on adversarial robustness.\n- In Figure 5b, the attack FGSM performs better than PGD, but FGSM is the single step case of PGD. This indicates that the attacks were not tuned properly, as you should always have PGD as a stronger attacker than FGSM\n- The method does not perform as well as adversarial training in standard defense tasks\n- Several writing/clarity errors (detailed below)\n\nSmaller edits:\nPage 2: paragraph 2: second last line: \"feed\" instead of \"fed\"\nPage 2: bullet 1: under our contribution: line 3: \"which are unchanged\" instead of \"which is unchanged\"\nPage 3: paragraph 3: second last line: \"two distribution\" missing an s (plural)\nPage 3: Section 2.2: paragraph 2: line 2: \"here are two most famous attacks\" missing \"the\" before \"two most famous\"\nPage 4: Section 3.2: first paragraph: line 4: \"the latent codes is decomposed\" should be \"are\" instead of \"is\"\nPage 5: Paragraph 1: line 9: \"E are trained\" should be \"E is trained\"\nPage 5: Section 4: Paragraph 1: last line: \"are those have access \" should be \"are those which have access\" missing which/that\nPage 6: Last paragraph: Line 1: \"the attacker can only access to the classifier\" there is no need for \"to\"\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}