{"rating": "6: Weak Accept", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #5", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "Summary\nThis paper proposes an attribution method, linearly estimated gradient (LEG) for deep networks in the image setting.\nThe paper also introduces a variant of the estimator called LEG-TV, which includes a TV penalty, and provides a \ntheorem on the convergence rate of the estimator. The paper finds that the LEG attributions pass sanity\nchecks. \n\nMy recommendation\nOverall, I am recommending this paper as a weak accept. There are several points to address with\nregards to the exposition and flow of the paper, which is my biggest issue with this paper. I believe\nthe authors can address this point and I am willing to raise my point on this basis. The paper also\nprovide some theoretical analysis of the proposed method, which is typically lacking for most\nof the interpretation methods in this domain. \n\n\nPossible Improvements\n- The LEG method is not sufficiently motivated. Here, I am specifically referring to the functional\nform of the estimated itself in definition 1. See the question section  for some of the issues \nI raised there. \n- From figure 4, we see that the method passes the proposed sanity checks which seem like a \nkey motivation for this work, however, the authors don't give an explanation for why this is the\ncase.\n- The paper notes that LEG can be estimated using an LP; it would have been great for the authors\nto completely spell this out in the appendix or somewhere in the text. What is the exact form of the\nLP? What are the constraints? \n- As the authors know, the two evaluations presented in the paper: sanity checks, and the zeroing\nout procedure (in figure 5) don't actually tell us which method is a good method, just rule out a method.\nI would encourage the authors to design a toy task where the ground truth attributions are know, then\ntrain a model to be 100 percent or so accurate on this task. You can then obtain LEG-TV estimates\nfrom this model and compare to the ground-truth. \n- I found the proof of lemma 1 confusing, the authors say it follows trivially, but I don't see it. For example, \nthere should be a factor of 2 somewhere after taking the derivative wrt to $vec(g)$, but I don't see it. It is\nfine for the authors to spell out the derivation here if possible. \n-The paper ends quite abruptly with no conclusion or discussion. It would be great to include a wrap up\nsection that puts the contributions into context. \n- I get the sense that this method should be computationally intensive, though the paper says otherwise.\nIt is fine for a method to be computationally intensive, but can the authors speak to this issue?\n\n\nSome Questions\nDefinition 1: I had a difficult time understanding this definition. What is $g$ here? I assume\nit is the gradient based on the reference to the first order Taylor expansion. In addition, why\nis the estimand squared? Further, What does it mean to take expectation wrt $F + x_0$. I was\nparticularly confused by the last point, because F is a continuous distribution, while presumably\n$x_0$ is the point of interest. The paper notes in several places that it can sample from $F + x_0$,\nis this equivalent to sampling from $F$ and adding point $x_0$?\n\nWhat is LEG0 in figure 5?\n\nIs $\\kappa$ in your theorem 1, the condition number of the covariance matrix of the perturbation?\n\n\nConclusion\nOverall, the paper provides a nice method along with analysis on convergence rates and other statistical\nproperties. Several of the key issues/questions I have about the paper are raised above. None of these\nshould be dealbreakers but would require the authors to flesh out more details and possibly justify\ncertain choices. In general, I think more effort should be put into the flow and writing of the paper.\nOverall, this is an interesting contribution."}