{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This papers studies reservoir computing in random RNNs. I *believe* this paper finds that by aligning inputs with directions that are high variance for spontaneous activity (which in this case means phase shifting inputs to specific phases relative to spontaneous activity), that the inputs then more effectively drive the network. I found the presentation in this paper extremely confusing though.\n\nDetailed comments:\n\nIn many places:\n\"brain\" -> \"the brain\"\n\"\\citet\" -> \"\\citep\"\n\nIt's unclear in the abstract whether you are studying biological or artificial neural networks.\n\"brain reformats input information to generate reliable responses for performing computations\"\nI don't know what this means\nOverall, I only had a vague idea what high level results the paper was going to show based on the abstract.\n\nEq. 2 and surrounding text:\nIs theta being used as a scalar angle, and then also being used as a subspace? This is confusing. (it's more confusing in that the first use only determines a relative orientation, while the later provides an absolute orientation)\n\nre: definition of theta_chaos\nAre the spontaneous dynamics in the first two PCs more chaotic than in other directions? I would expect the opposite. What justifies calling these directions the chaotic directions?\n\n\"previous work Rajan et al. (2010a;b) have shown that spatial structure of the input does not have a keen influence on the spatial structure of the network response. Here, we bring in this association explicitly with subspace alignment.\"\nHere, and elsewhere, I am consistently confused about the relationship between spatial structure, structure across hidden units, and phase structure.\n\n\"almost similar\" -> \"similar\"?\n\n\" In the 180◦ phase difference case, we see exactly opposite stability phenomena with “chaos” converging to more stable attractor.\" I have a hard time understanding why these two handwritten words should be expected to have these specific different properties."}