{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "Overview: Using a reservoir of recurrent, randomly-connected spiking neurons, this paper studies how input stimuli may be modified to produce more robust responses. Specifically, this entails adjusting the phase of a sinusoidal input such that the leading principal components of the variation in the reservoir’s response match the leading principal components of its spontaneous and unstimulated chaotic dynamics. The reservoir’s ability to discriminate different stimuli, even in the presence of noise, is shown to be improved by aligning them to different principal components of its chaotic dynamics, both between stimuli and within a single stimulus in the presence of noise. The authors provide a statistical physics-driven outline of the theoretical analysis underpinning this result, and qualitatively demonstrate the effectiveness of their approach to a simple handwriting generation task. \n\nThis paper addresses an important question and provides a result that is of interest, however, the overlap between this and previous related work is quite significant. In particular, this paper is heavily indebted to Rajan et al’s work in “Inferring Stimulus Selectivity from the Spatial Structure of Neural Networks” and “Stimulus-Dependent Suppression of Chaos in Recurrent Neural Networks”, two papers from nearly a decade ago from which it borrows most of its approach and theoretical analysis. The work presented here is a logical extension of these papers, and in some respects lacks originality. That being said, the demonstration that merely aligning the phase of a sinusoidal input (as opposed to identifying a resonant frequency, as in Rajan et al) is adequate to improve stability is an interesting result. The theoretical analysis is not at all new, but does provide a nice way to understand the empirical results, and in its presentation here is more understandable to non-statistical physicists than in the original formulation.\n\nSpecific comments:\n- “Anatomical studies demonstrate that brain”, “Brain actively…” -> most instances of “brain” should be changed to “the brain”\n- Given that this is a standard liquid state machine, it should be explicitly called that and some citations to the relevant literature (e.g. Maass, , \"Real-time computing without stable states: a new framework for neural computation based on perturbations\") should also be provided.\n- It’s difficult to understand why the effect of changing input phase changes (granted, somewhat unpredictably) the orientation of the resulting circular oscillation. Providing some intuition would be helpful.\nIn particular, why is the relationship between phase and subspace orientation in the left plot of Fig/ 1 (c) symmetric about 180°?\n- Reservoir model schematic from fig. 2 should be moved to fig. 1\n- Fig. 1 (a), thetas appear to represent the normal vectors of the first two PCs of activity, which should be made explicit.\n- Equation (2): Notation is unclear. Basis vectors should either be arranged into matrices, or “SingularValueOf” should be changed to an inner product\n- Visualization of the chaotic activity in 3D PC space would be helpful, consider moving it out of the appendix.\n- Fig. 2 (d), dashed lines should be noted as direction vectors in caption\n"}