{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "\nThe paper provides an iterative linear method to identify causal influences of putative cause matrix to signal matrix. The idea is a natural extension of previous forward and backward such as CCA and PLS. The paper has provided consistency guarantee and several synthetic and real data experiments as support. \n\nTechnical questions:\n\n1) The estimation of binary causal influence matrix E is set as \\hat{E} = Diag(\\hat{H}). Why is Diag(\\hat{H}) guaranteed to have binary elements?\n\n2) The Theorem 1 needs more explanation about why it proves consistency, which is currently isolated from other parts of the paper. Why E\\hat{H} = \\hat{H} guarantees the consistency of \\hat{E} = Diag(\\hat{H})?  For example, \\hat{H} can have more all-zero rows than E which still satisfies E\\hat{H} = \\hat{H}  but  \\hat{E}  is not equals to E. In an extreme case,  \\hat{H} = 0 will have  E\\hat{H} = \\hat{H} but is clearly not consistent. \n\n3) How does the Eq (4),(5) give an estimation \\hat{E}?\n\n4) By Eq. (10,11), H and G seem to be determined give X,Y. Then what are the maximization of Eq. (12,13) over? \n\n\nGeneral comments:\n\n1) How does the problem in Eq.(1) differ from variable selection in linear regression where a plenty algorithms exist such as LASSO, spike-slab prior, SCAD, etc. ?\n\n2) The experiments are a bit weak with a simple synthetic experiment and a real dataset with just four features. Can experiment directly demonstrate the correctness of the theorem?\n\nTypo:\n\nPage 1, “are are based on”\n\nIn general, I think B2B is an algorithm that has improvement over CCA and PLS. I am looking forward to the author response to address my above concerns."}