{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "In this paper, the authors study the classic GCN and proposed the new convolution operator with wider spatial scope and robust properties. The proposed models could improve the accuracy in both benign and evasion setting on synthetic, ie., SBM dataset and real world benchmark graphs. However, I have the following questions for the authors:\n\n1. In the paper, compared to the classic GCN, the authors replace the adjacent matrix $A$ with the proposed “variable power operator”. However, the proposed “variable power operator” is very similar to “k-th order polynomials of the Laplacian”, which has been fully discussed in [1]. Could you distinguish the differences between the proposed “variable power operator” and “k-th order polynomials of the Laplacian”? And as the authors proposed to use high-order matrix  some recent models which also explores high-order matrix such as [2, 3] may also need to be selected as baseline methods. \n\n2. As it is clearly defined in [4,5], all the five attack methods adopted in the paper are poisoning (training time) attacks methods. However, the proposed models are claimed to defense against evasion (testing) attacks. Why choose the poisoning attacks methods here? The experiment with the evasion attack method [6] is suggested to be added. \n\n3. When the proposed models are applied to other kind of graph data, ie., social network, according to the small world theory, the \"variable power adjacency matrix\" would be very dense when $r>2$ with 2-layer GCN. The efficiency of the proposed might be an issue. Is it possible to add one experiment with demonstrating the running time on the real world social network?\n\n[1] Defferrard, Michaël, Xavier Bresson, and Pierre Vandergheynst. \"Convolutional neural networks on graphs with fast localized spectral filtering.\" Advances in neural information processing systems. 2016.\n[2]Wu, Felix, et al. \"Simplifying graph convolutional networks.\" International Conference on Machine Learning. 2019.\n[3] Abu-El-Haija, Sami, et al. \"Mixhop: Higher-order graph convolution architectures via sparsified neighborhood mixing.\"  International Conference on Machine Learning. 2019.\n[4]Zügner, Daniel, and Stephan Günnemann. \"Adversarial attacks on graph neural networks via meta learning.\" In ICLR 2019.\n[5]Bojchevski, Aleksandar, and Stephan Günnemann. \"Adversarial Attacks on Node Embeddings via Graph Poisoning.\" International Conference on Machine Learning. 2019.\n[6] Dai, Hanjun, et al. \"Adversarial attack on graph structured data.\" International Conference on Machine Learning. 2018.\n\n\n"}