{"experience_assessment": "I have published one or two papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors propose a method for lossless image compression based on using\nfully convolutional VAE models. These models are shown to generalize well when\nthey are trained on small images (e.g. 32x32 and 64x64) and then applied to\nmuch larger images. The method is based on a fully vectorized implementation of\nbits back with asymetric numeral systems coding which is much faster than\nprevious non-vertorized implementations. An improvement with respect to similar\nmethods is to use a dynamic discretization of the latent variables which avoids\nhaving to callibrate a static discretization (as in previous methods).\nFinally, the authors initialize the bis back process with information about a\nfew initial images which are coded using a different codec.  The experiments\nperformed illustrate the gains of the method in terms of compression ratio and\nspeed.\n\nClarity:\n\nThe paper is extremelly well writen and it is very easy to read. The athors\nindicate that they will release open-source code to implement all their\nresults, which is very wellcome to improve reproducibility. However, I have to\nsay that the part describing the vectorized implementation of their method was\nrather confusing and the paper could benefit a lot from clarifying this part.\n\nQuality:\n\nThe experiments performed are sound and illustrate the gains produced by their\nmethod (although they do not achieve state of the art results). In particular,\nthe experiments show the speed up gain by the proposed vectorization and the gains\nproduced by the dynamic discretization. The experiments also show how the methods\ntrained on smaller images generalize well to larger images.\n\nNovelty:\n\nThe proposed approach is novel up to my knowledge. Although the methodological\ninnovations are not that advanced, the vectorization in the specific\napplication considered is novel, as well as the dynamic discretization.\n\nSignificance:\n\nThe proposed contributions are significant in my opinion. The vectorization\napproach can be very useful in practice and the dynamic discretization can also\nbe useful as shown by the experiments. One criticism could be that the authors\ndo not achieve state of the art results, but I consider this a minor thing."}