{"title": "Interesting direction, experiments are unconvincing", "review": "Updated after reading author revisions:\nI appreciate the clarifications, the response answered almost all of my small technical questions.  That plus the new error analysis increases my opinion about the paper, and I'm no longer concerned that the rule templates are hand-generated given their generality and small number.  I am still concerned that we don't actually know how well the methods work, because the test sets are small and the performance differences between the methods (in Table 1) are quite close.  I will raise my score one point.\n\nThe authors might try to evaluate using k-fold cross-validation with the training set, to obtain more examples for evaluation.\n\nOriginal review:\n\nThe paper presents a technique for using prolog along with neural representations and Open IE to perform reasoning with weak unification.\n\nI like the basic direction of trying to combine prolog with neural models, and the weak unification notion.  The approach seems sufficiently novel, and the GRL is a reasonable heuristic.\n\nI do, however, have significant concerns about the experiments.  The data sets are selected subsets of other standard benchmarks, rather than the entire benchmarks, and the test sets are quite small (e.g., the \"developer\" column where the NLProlog approach shows some of the larger wins -- when ensembled with previous techniques -- is based on a test set of only 29 examples).  Given the hand-annotated nature of much of the input knowledge (the rule templates), this introduces an important concern that the experimental wins will not be robust in more realistic settings where different knowledge may be required.\n\nMinor comments/questions\npage 2: \"without the need to transforming\"\nI did not understand how individual symbols, predicates and entities, have embeddings that come from sentence vectors (Section 4.1).\nThe learning objective in Section 4.2 seems reasonable, but I did not understand how \"evolution\" was part of the strategy there.\nThe example rule template for transitivity isn't actually transivity unless p_i=p_j for all i,j, I found that a little confusing.\nWhere are \"t-norms\" (mentioned at the top of page 6) used?  I did not see this.\n\"candidates entities\" -> \"candidate entities\"\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}