{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper contributes an enhancement to GCN by constructing a second graph (affinity graph of topological features) for graph convolution. Among the authors' several attempts of leveraging  topological features, this is the only successful one. Other (unsuccessful) attempts include, for example, concatenating the topological features with the BOW features in citation networks.\n\nThe reader appreciates the authors report both successful and unsuccessful results.\n\nThe work is well presented, with an extensive historical account of the roles of the graph structure in node classification. In fact, topological features were popularly used prior to the emergence of graph neural networks. The rapid progress of deep learning forges a mindset of abandoning feature engineering. It is not bad to see that graph features return in some form.\n\nThat said, if the contribution of this work is interpreted as feature engineering, the contribution does not sound significant enough. The reader interprets from this work that what topological features are important to the end task is case dependent. The authors obtain this insight through empirical evaluation, wherein labeling information is used. This methodology, however, does not seem to be extendable to real scenarios, where most of the labeling information is unrevealed.\n\nThe empirical evaluation does not seem strong enough, either. Table 1 indicates that using topological features improves prediction on only half of the data sets.\n\nMinor comment: The terminology \"dual graph\" has a different meaning in standard graph theory (see, e.g., https://en.wikipedia.org/wiki/Dual_graph). The authors are advised to use a different wording.\n"}