{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "** Summary\n\nThis paper propose to adding the topology of each node as auxiliary information to improve the node classification accuracy in the graph. Specifically, the authors show that using adjacency matrix as the topology representation is better than directly using the topology, like the degree or centrality. The results suggest that using the extra information in the form of adjacency matrix brings marginal improvement on some of the tested datasets.\n\n** Weaknesses\n\n1. This paper is poorly written and hard to follow. There are multiple un-defined terms which are important to understanding the proposed idea. For example, in the first line of Section 5.1, there are 2 terms “neighbor class” and “node self-topology”. There is no context about what they are. Is “neighbor class” the class labels of the neighbors of a given node or is it the class labels of a pair of nodes who are neighbors in the graph? What is “node self-topology”? This term only occurred once in the paper. In the first bullet of page 4, the authors mentioned that the nodes with similar topology are connected in the dual graph. How is the similarity on topology measured? What are the most important topology feature? They are core to the proposed idea and therefore should be in the main content.\n\n2. The empirical results are not persuasive. Although the authors claim that the proposed method outperforms all the state of the art methods, it is hard to tell the difference on the accuracy according to Table. 1. For example, the gap between the authors’ re-implementation and the existing method (70.9 compared with 72.5) is larger than the gap between the re-implemented model with or without the proposed extra information (72.2 compared with 70.9).\n\n3. The comparisons are not fair. For example, compared with GAT, the T-GAT has an extra dual graph which means extra parameters and computations during training and testing. This is not reflected in the comparison."}