{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "Summary\n\nThis paper introduces a new model architecture for doing text classification. The main contribution is proposing a deeper CNN approach, using both word and character embeddings (as well as label embeddings with attention). The paper claims improved performance over baselines. \n\nDecision\n\nI reject the paper for 3 main reasons:\n1) Very misleading claims regarding establishing a new state of the art. The baselines used for comparison don't include any of the best existing published results. \n2) Lack of positioning within the literature. In particular, no mention nor discussion of Transformers (self-attention) networks, including BERT and XLNet approaches, which are the state of the art in text classification. \n3) Lack of justification/explanation for the proposed architecture. One key argument made is that current models are shallow, but it appears that only CNN models are considered for that comparison. More discussion is needed to understand why the new aspects of the proposed network are importantly different from other existing approaches.\n\nAdditional details for decision\n\nThe results from this paper are significantly inferior to the best results published. With a few quick searches, I found that there are several approaches performing better than the proposed model on every dataset considered in the analysis, as you can see below.\n\nhttp://nlpprogress.com/english/text_classification.html\nhttps://github.com/sebastianruder/NLP-progress/blob/master/english/sentiment_analysis.md\nhttps://paperswithcode.com/sota/text-classification-on-yahoo-answers\n\nExtra notes (not factoring in decision)\n\n- Consider spacing out the 3 rightmost blocks in Figure 1, I found the layout confusing and there's space available.\n- In section 3, I would have liked more explanation for the motivation of the various design choices."}