{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This paper targets training generative adversarial networks with a formulation that is motivated by mass transport of fluid flows. While generalized transport formulations are popular for GANs by now, especially the Earth Mover's distance and the Wasserstein GAN version that this paper is based on, this submission instead frames the problem with a divergence-free flow model inspired by Navier-Stokes. The problem of matching output distributions then becomes one of inferring a suitable flow field that aligns the distributions. \n\nThe proposed model is discretized in a Lagrangian manner, and divergence freeness is ensured trivially by a constant particle count. Matching the point clouds in terms of distribution is done via a gaussian mixture model to obtain smooth distributions. (This probably doesn't scale too well to large paricle numbers due to the global support, but the paper also focuses on smaller 2D cases.) As mentioned in the text, the method in the end shares similarities with point cloud registration (ICP).\n\nA synthetic test with a square target shape and an initial centered distribution is shown to highlight that the method can re-distribute parts of the initial cloud towards all sides of the target shape. \n\nAs a tougher case, a digit generator with MNIST data is shown, which however, does not reach a level of quality we could expect from other existing methods for generative models.\n\nWhile I found the initial motivation of the paper quite interesting (and novel as far as I can tell), the discretized version is somewhat disappointing. The smooth matching of point clouds does not retain too much of the initial fluid flow model. Unfortunately, the MNIST test also indicates that the method has problems scaling to higher dimensions. This is a central challenge for GANs, and based on the submission I don't have the impression that the proposed formulation is competitive with existing GAN methods. "}