{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposed a generative network based on fluid flow solutions of mass transport problems. The paper is difficult to follow due to a poor structure and obvious technical mistakes. Detailed comments are as follows:\n\n1. The dual formulation used in the objective of WGANS involves expectations with respect to data distributions. When authors introduced WGANs, it is extremely loose and essential wrong to state that \"In the case of WGANs a simpler expression is derived where we use the score directly setting g to the identity and h = −g, and require some extra regularity on the score function\".\n\n2. The organisation of the paper makes it difficult to read:\na) While the relevant work is discussed only briefly in Section 1 and contain incorrect statements (see an example above), detailed discussions of two toy examples in the introduction section distract the reading.\n\nb) Section 2 is a combination of related work and proposed work. For example, it starts more like a section introducing the dynamic transport formulation of mass transport problems (Equations 2.3a-2.3c), but in fact it contains the authors' proposed approach (2.4a-2.4b), which makes it difficult to tell the authors' contributions. Moreover, the connection between 2.3a-2.3c to 2.4a-2.4b is not clear to me.\n\n3. Multiple notations are not properly defined or conflicting: what are $\\rho(x,t)$ and $\\rho(1,x)$?\n\n4. Very limited experimental validation with no comparison to other algorithms.\n\n5. Multiple typos in the paper, e.g. \"Equation equation 1.1\"."}