{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The paper is well written and an interesting read. I think it complements well the existing literature. \n\nUnfortunately, I think the paper overstate its claims. It is clear that permutation groups are the natural language of all graphs (Kondor and Trivedi, 2018) and (Bloem-Reddy and Teh, 2019). It is less clear that knowledge graphs also comply with another set of group axioms. Why would the set of relations be closed? Say, Owns \\cdot Spouse_of = ? . I cannot see why and how this is necessary. Must all embedding methods be closed? I understand it could be the case for Euclidean embeddings, which only showcases that Euclidean embeddings are not ideal for KGs. But can't embeddings be defined over a (Riemann?) manifold, such that some embedding mappings (Owns \\cdot Spouse_of = ? ) need not be defined? The manifold, however, means that the relations no longer form a group. I see no easy fix. Btw, I disagree with what TorusE did (the relations described in the paper do not form a Lie group).\n\nThe rest of the paper is straightforward, just applying the definitions of groups. I found the classification of different methods interesting, and should be made more clear in the experiments. \n\nThe experimental results are interesting but their significance is unclear. Please add standard deviations to all experiments. We cannot have a sense of the significance of the results without knowing how many runs were executed, how they were executed (e.g., k-fold cross-validation, bootstrapping), and their standard deviation.\n\nI dispute that the paper proves that the definition of groups emerges purely from the nature of the knowledge graph embedding (KGE) task. I would actually say the opposite, it is clear to me that for most KGs, their relations do not fit the definition of a group. I am open to be (formally) proven wrong. E.g., can you list all relations in FB15K and show that they fit the group axioms?\n\nFixing the paper: Maybe the paper could be rewritten, constrained to Euclidean spaces? Then prove (formally) that the group axioms are a sufficient(?) and necessary(?) condition for such embeddings? \n\nMinor issues:\nhonestly could not make sense of the abstract:\nThe sentence choices\n-  \"which suggests that a group-based embedding framework is essential for model design\" \n- \"Our theoretical analysis explores merely the intrinsic property of the embedding problem itself without introducing extra design\"\nin the abstract are very strange. It means nothing to a reader at that point. What a model design? What is an extra design? A modeling assumption? A model prior? \n\n\"Using the proposed framework, one could construct embedding models that naturally accommodate all possible local graph patterns, which are necessary for reproducing a complete graph from atomic knowledge triplets\" => what is an \"atomic knowledge triplet\"? Why are they necessary to reproduce a complete graph? This is all very confusing.\n\n\" contradicts to the entity regularization\" =>  contradicts the entity regularization\n\nReferences:\nKondor, R. and Trivedi, S., 2018. On the generalization of equivariance and convolution in neural networks to the action of compact groups. ICML\nBloem-Reddy, B. and Teh, Y.W., 2019. Probabilistic symmetry and invariant neural networks. arXiv:1901.06082.\n"}