{"title": "The novelty and supporting theory is not significant", "review": "The paper introduces a new approach to combine small RBMs that are pretrained in order to obtain a large RBM with good performance. This will bypass the need of training large RBMs and suggests to break them into smaller ones. The paper then provides experimental evidence by applying the method on \"invertible boolean logic\". MCMC is used to find the the solution to large RBM and compare it against the combined solutions of smaller RBMs.\n\n\nThe paper motivates the problem well, however, it is not well-written and at times it is hard to follow. The details of the approach is not entirely clear and no theoritcal results are provided to support the approach. For instance, in the introduced approach, only an example of combination is provided in Figure 1. It is not clear how smaller RBMs (and their associated parameters) are combined to obtain the larger RBM model. From the experimental perspective, the experimental evidence on \"invertible boolean logic\" does not seem to be very convincing for validating the approach. Additionally, the details of the settings of the experiments are not fully discussed. For example, what are the atomic/smaller problems and associated RBMs? what is the larger problem and how is the corresponding RBM obtained? Overall, the paper seems to be a report consisting of a few interesting observations rather than introducing a solid and novel contribution with theoretical guarantees.\n\nRemark: \nThe term \"Combinatorial optimization\", which is used in the title and throughout the body of paper, sounds a bit confusing to the reviwer. This term is typically used in other contexts.\n\nTypos:\n** Page 2 -- Paragraph 2: \"Therefore, methods than can exploit...\"\n** Page 3 -- 2nd line of math: Super-scripts are missing for some entries of the matrices W^A and W^{A+B}\n** Page 5 -- Last paragraph: \"...merged logical units is more likly to get get stuck in a ...\"\n** Page 5 -- Last paragraph: \"...and combining their distributions using the mulistart heuristic...\"\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}