{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The authors present a learned method for speeding up optimization of LP, with an application to the TSP problem. In particular, they discuss choosing a pivoting strategy in the simplex algorithm that is set up as a 2-class classification problem, taking the simplex tableau and outputting one of two classes (Dantzig or steepest edge). They consider both the supervised learning approach where they first compute the optimal policy Q*, as well as the RL approach.\n\nThe paper presents a quite interesting approach to solving the TSP, using NNs on top of the tableaus. I enjoyed the presented ideas, however the authors could have done a great job of clearly presenting their work. Notation is not the best, and the experiments are quite limited, indicating limited practical value of the current approach. Detailed comments follow:\n- Especially given that the authors have 2 more pages for writing, it would be beneficial to add more visualization and intuitive explanations of the presented ideas.\n- The notation should be improved, especially given that there isn't that much notation anyway. E.g., eq (1e) and the following one are not quite clear, what is M? Is it a scalar, or a set? Reading closely it becomes clear it is a set, but the authors use upper-case letter both for scalars and sets, leading to confusion. This is very easy to fix, and would help readers quite a lot.\n- The first paragraph in Section 4 is literally a copy-paste of the last paragraph in Section 3.\n- Accompanying Section 4 discussion, would be good to add a figure showing an example tableau. Actually, tableau is not even mentioned here and is the main input to the network, it is only mentioned later.\n- Using just 5 cities does seem small, indicating limited practical value of the method. Please comment on the actual full size of the exact graph of the relaxation, and why is it infeasible to store. Currently the explanation is hand-wavy.\n- \"The state space is the set of possible simplex tableau\", so you enumerate all the possible tableaus of extreme points prior to training? It seems yes, but would be good to explain that explicitly.\n- In \"Reward function\" section, \"as the objective value ...\", please add a reference to eq (1a) here. It helps readers follow the text by referencing already introduced parts.\n- Where did the equations for rewards come from? They are just given, without much explanation or intuitive discussion.\n- Above Section 5.1, \"where s_{t-1} -> s_t\", where is this notation even used?\n- Typo: \"value of at\"\n- Is it \"tableau\" or \"tableaux\"? Choose one.\n- Section 5.1, are both outputs updated at each iteration? It says that a random action is taken, but is that after Q-values for both actions are checked? It seems yes, but it is not clear. \n- In general, a number of small details are missing, and the authors should make sure to not skip them. This introduces confusion to the text which should clearly be avoided.\n- \"Epsilon is decayed appropriately.\" How?\n- Please define an epoch. In particular, what constitutes a 0.5 epoch, and how does the update actually work here? So you store examples into batches, keep them on the side, and once half an epoch passes only then use them to update the model? It seems yes, but again would be good to be more gentle in explanations.\n- Maybe add an algorithm illustrating the methods? In addition to visualization mentioned above.\n- Figures are not really super visible. Also, figures should have captions, so text go below the figure.\n- Figure 2 is referenced in Section 6.2, where it should be Figure 3.\n- \"weighted\" vs. \"unweighted\" iteration should be defined earlier. It is nowhere introduced, and while it may be clear what it means, it is not clearly defined and it should be.\n- \"Adams optimizer\"? Do you mean Adam?\n- Experiments are somewhat weak, and seem to indicate that the method does not have much practical value. Is the method useful beyond 5-city size?"}