{"title": "Strong paper for environment in which outcomes are strongly influenced by exogenous factors", "review": "The paper introduces and develops the notion of input-dependent baselines for Policy Gradient Methods in RL.\n\nThe insight developed in the paper is clear: in environments such as data centers or outside settings external factors (traffic load or wind) constitute high magnitude perturbations that ultimately strongly change rewards.\nLearning an input-dependent baseline function helps clear out the variance created by such perturbations in a way that does not bias the policy gradient estimate (the authors provide a theoretical proof of that fact).\n\nThe authors propose different methods to train the input dependent baseline function:\n   o) a multi-value network based approach\n   o) a meta-learning approach\nThe performance of these two methods is compared on simulated robotic locomotion tasks as well as a load balancing and video bitrate adaptation task.\nThe input dependent baseline strongly outperforms the state dependent baseline in both cases.\n\nStrengths:\n   o) The paper is well written\n   o) The method is novel and simple while strongly reducing variance in Monte Carlo policy gradient estimates without inducing bias.\n   o) The experiment evidence is strong.\n\nWeaknesses:\n   o) Vehicular traffic has been the subject of recent development through deep reinforcement learning (e.g. https://arxiv.org/pdf/1701.08832.pdf and https://arxiv.org/pdf/1710.05465.pdf). In this particular setting exogenous noise (demand for throughput and accidents) could strongly benefit from input dependent baselines. I believe the authors should mention such potential applications of the method which may have major societal impact.\n   o) There is a lot of space dedicated to well know facts about policy gradient methods. I believe it could be more impactful to put the proof of Theorem 1 in the main body of the paper as it is clearly a key theoretical property.", "rating": "9: Top 15% of accepted papers, strong accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}