{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "1) Summary\nThe manuscript presents a theoretical convergence analysis of gradient-based saddle point algorithms to solve min-max problems with a bilinear objective function. In particular, the analysis covers block updates and joint updates.\n\n2) Quality\nThe paper -- being a theoretical analysis rather than a new algorithm -- seems mathematically rigorous but lacks motivation and also explanation.\n\n3) Clarity\nThe notation is pretty clear and the results seem convincing but the mathematical formulation in eq. 2.1 and related assumptions (E being invertible, b and c being) need to be better justified in order to make the paper accessible to a broader audience. \n\n4) Reproducibility\nThe data is mainly synthetic and the codes for the update schemes are available. This should render the results reproducible.\n\n5) Evaluation\nThe evaluation is on synthetic settings and the results on the convergence seem convincing but a subtantial optimization problem remains for future work.\n\n6) Questions/Issues\n  A) Not sure about the implications, isn't the set of saddle points in eq (2.2) equivalent to x=y=0? If this is intended, there needs to be some explanation.\n  B) It is not clear how well the results of the bilinear setting are applicable to the general case of bivariate functions. E.g. below eq (2.5) and below eq (5.1). There needs to be more justification.\n  C) The start of Section 2 kicks off a little rough i.e. the formal setting could be better motivated.\n\n7) Details\n  a) Section 2, below eq 2.2: \"biliner games\" -> \"bilinear games\"\n  b) Capitalization in references: Nash, GAN, Potenzreihen, Einheitskres\n  c) References: \"méthode iterative de résolution d'une équation variationelle\""}