{"title": "A co-trained logistic regression can discover task-dependent stop words", "review": "This paper is unacceptable to me in current form.  I would find it acceptable if it were rewritten to be \"a much more straightforward description and demonstration of how a simple strategy is competitive with (unnecessarily) complex approaches on an important problem.\"\n\nI found this paper's layout and exposition frustrating.  There is a space for papers that demonstrate simple approaches to complicated problems are competitive (e.g., Hellinger PCA for word embeddings).  Such papers, when done well, 1) clearly indicate the importance of the problem, 2) propose a simple solution, and 3) show it is competitive.   Instead, this paper 1) defers important motivation (e.g., federated mobile/cloud computation) to the end of the experiment section, 2) disguises a simple solution as complex via excessively ornate discussion, and 3) mostly fails to show it is competitive.\n\nBag-of-words uses a one-hot vocabulary encoding of the input but trains directly on the task rather than indirectly via the classifier.  Whereas, \"word embedding\" co-trains with the classifier but uses word embeddings.  I'm really curious to see whether directly training on the class label using the word embedding representation with a sparsity-enforcing regularizer would do just as well as \"word embedding\" eliminating the need for co-training.  In any event, it would be more convincing baseline.\n\nI don't understand how the data aggregation step works when the selector and classifier are co-trained, since it appears to assume a collection of selectors is already present before training the classifier.\n\nNone of the experimental results are compelling to me.  The differences seem so slight that I would prefer the simplest approach, which is the L1 regularized logistic regression for feature selection.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}