{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper presented a CRM model which is VAE with separate priors for save and unsafe modes and utilize it in  RL  for roundabout planning task. \n\nPros:\n1. The motivation of the work is clear and solves an important task\n2. The approach is sensible \n\nCons:\n1. Experimental evaluation is very weak. It is only performed on one task which is on getting out of the roundabout.  \nIt also does not compare with any real-baseline methods. It is only the proposed method compare with the weaker version of the method. \n\n2. Using a mixture of Gaussian for VAE has been used in many works before, such as Nazabal, Alfredo, Pablo M. Olmos, Zoubin Ghahramani, and Isabel Valera. \"Handling incomplete heterogeneous data using vaes.\" arXiv preprint arXiv:1807.03653 (2018).\nAlso, make such prior should be equivalent to regular Gaussian prior with multi-head decoder as in figure1 (b) in VCL paper https://arxiv.org/pdf/1710.10628.pdf where s is T there. \n\nSo, this work did not discuss these approaches and the novelty of the work is also limited. \n\n3. How to set the mean of s may be critical for the performance. Analysis needed. \n\n4. The method should at least compare with conditional VAE used in the same way in RL. In this case,  the label is s and I believe that the latent space will be meaningful regarding s.\n\n5.. The second term in the right-hand-side of equation (7) has missed some constant factor. \n\n5. How figure 5 shows CRM could efficiently model the latent constraint? It only shows that the model converged. \n\n6. Writing needs to be improved. There are grammatical mistakes here and there.  \n\n\n\n"}