{"title": "Novelty not clear", "review": "Summary:\nThe paper is well written and easy to follow. The paper proposes a Python package for optimization and applications on Riemannian manifolds.  \n\nComments: \n\nC1.\nThe main concern of the package is on novelty. That there exist other packages, e.g., Pymanopt [1], Manopt [2], ROPTLIB [3], which do a similar job as Geomstats. It is hard to understand from the paper on what is the key contribution of the present package. The paper does try to highlight the differences between the Goemstats package and others by emphasizing the lack of “choice of other metrics and high computational costs of” others. This is, however, not shown in the paper as to how Geomstats is better in terms of computational complexity. On the choice of the metrics too, it should be noted that all the new geometries of the manifolds (for different metrics) can be easily added to the toolboxes [1,2,3]. Those toolboxes are modular and come with a lot of solvers and have already been used in many large-scale applications.\n\nHaving said that, one key strength of the Geomstats package is that it can be used in a deep learning framework in a relatively straightforward manner. This is mentioned in the paper but is not properly emphasized. However, here also, the paper does not say what algorithms can be used as part of Geomstats (except the stochastic gradient descent optimizer). \n\nOverall, I got the impression that the proposed package positions itself as a package of Riemannian manifolds (and all of the differential geometric notions). If that is so, then this is problematic. Pymanopt and others already do that fairly well, and consequently, the justification for a new package on that basis is difficult.  \n\n[1] https://pymanopt.github.io/\n[2] https://www.manopt.org/\n[3] https://www.math.fsu.edu/~whuang2/Indices/index_ROPTLIB.html\n\n\nC2.\nThe citations are not properly rendered. It is hard to distinguish between the equations in the paper and the references in the paper.\n\nC3.\nInstead of multiple use cases in the paper, could the paper focus one particular use case to show the important functionalities of Geomstats? Currently, it seems that the paper is more about surveying where all Riemannian geometry is useful.\n", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}