{"title": "nice direction of research, but limited applicability", "review": "The current paper considers the relation between convolutional neural networks and Gaussian processes from theoretical and practical point of view.\n\nThe main contribution of the paper as presented by the authors is 2-fold:\n1. Some theoretical justifications about the correspondence between GPs and convolutional networks with infinitely many channels are provided.\n2. The formulas for GP kernel computation for the considered network is provided and some experiments are conducted (on MNIST).\n\nI personally enjoy the ideas of the close relation between certain types of neural networks and GPs and I really like the idea of authors that kernels based on convolutional networks might be more practical compared to the ones based on fully connected networks. It might be easier to encode certain invariance for complex objects via multilayered structures then via more simple explicit kernels.\n\nHowever, I see couple of important issues:\n1. The theoretical justification provided is basically heuristic argument and, speaking rigorously, is not a theorem. The proper proof should be based not on layer-by-layer convergence, but on the convergence with all the parameters tending simultaneously to infinity (see Matthews et al, 2018). Also, I doubt that the limit with infinite number of channels is as meaningful as the limit with infinite width of layer, as wide networks are used much more often in practice than networks with many channels.\n2. The practical applicability is very limited as the kernel obtained has very high computational complexity. The authors theirselves comment that computing kernel matrix takes more time than inverting it. Thus, the applicability beyond MNIST is a big question for the proposed approach.\n\nTo sum up, I think that the present paper targets an important direction of work, but the contribution itself is somehow limited (and relative obvious based on the recent papers on relation between fully connected networks and GPs).", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}