{"title": "Proposed method has several limitations, experimental setup is unclear and the results are not convincing.", "review": "This submission proposes a method for learning to follow instructions by splitting the policy into two stages: human instructions to robot-interpretable goals and goals to actions. The authors claim to achieve better data efficiency, adaptability, and generalization as compared to the baselines.\n\nHere are some comments/questions:\n- One of the biggest limitations of the proposed method is that it can only work for one-to-one or many-to-one mapping of instructions to goals. As I understand (please correct me if I am wrong), the method can not work for contextual instructions where the goal depends on the environment and the same instruction can map to different goals, such as 'Go to the largest/farthest object'.\n- Another limitation of the method is that it requires a set of goals G, which is not trivial to obtain especially in partially observable environments such as embodied navigation in 3D space.\n- The experimental setup is unclear and several crucial details are missing:\n\t- \"An instruction for approaching one of the five targets in the arena is generated and passed to the agent at first.\" -> how is the instruction generated?\n\t- There's no example of the environment or the instruction in the submission\n\t- \"Within the instruction become approaching more than one targets, one of two added targets is selected as internal targets pair with one of the remaining targets.\" I do not understand this sentence. How are the targets generated in the trajectory-oriented task? How are the instructions generated in this task?\n- Experimental results are not convincing:\n\t- The introduction motivates the need for understanding human instructions and the abstract says 'Given a human instruction', but I believe experiments do not have any human instructions.\n\t- All the environments seem to be fully-observable, it is not clear whether the method would work in partially-observable environments.\n\t- Only vanilla PPO and BC cloning are used as baselines. There are several competing methods for following instructions which the authors cite such as Hermann et al. 2017, Chaplot et al. 2017, Misra et al. 2017, etc. Why weren't any of these approaches used as a baseline?\n- The submission requires proof-reading, there are several typos in the manuscript (some are listed below), some of them make it very difficult to understand the setting.\n\n- Typos:\n- Sec 3.1 on Pg 4 mentions 'CEM' multiple times, it's not defined until 3.3.2 on Pg 6.\n- Pg 3 Theses sets -> These sets\n- Pg 7 where the Reacher pointing at -> where the Reacher is pointing at\n- Pg 7 What reacher observes the word is its fingertip’s position, coordinates in two dimension. -> something is wrong in this sentence.\n- Pg 7 Then comes to the trajectory-oriented task, there are only a few differences from above -> something is wrong in this sentence.\n- Pg 7 Within the instruction become approaching more than one targets -> something is wrong here", "rating": "3: Clear rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}