{"title": "A simple and interesting idea on how to map data in a discrete (Wasserstein) space", "review": "This paper learns embeddings in a discrete space of probability distributions, endowed with a (regularized) Wasserstein distance.\n\npros:\n\n- interesting idea, nice results, mostly readable presentation.\n- the paper is mostly experimental but the message delivers clearly the paper’s objective\n- the direct visualisation is interesting\n- the paper suggests interesting problems related to the technique\n\ncons:\n\n- to be fair with the technique, the title should mention the fact that the paper minimises a regularised version of Wasserstein distances (Wasserstein -> Sinkhorn ? put “regularised\" ?)\n- and to be fair, the paper should put some warnings related to regularisation -- this is not a distance anymore, sparsity is affected by regularisation (which may affect visualisation). Put some reminders in the conclusion, reword at least the third paragraph in the introduction.\n- the paper could have been a little bit more detailed on Section 2.3, in particular for its third paragraph. Even when it is an experimental paper.\n- the direct visualisation is interesting in the general case but has in fact a problem when distributions are highly multimodal, which can be the case in NLP. This blurs the interpretation.\n- the paper delivers a superficial message on the representation: I do not consider that nice having modes near physical locations (Paris, France) is wrong. It is also a city. However, it would have been interesting to see the modes of “city” (or similar) to check whether the system indeed did something semantically wrong.\n\nQuestions:\n\n- beyond that last remark comes the problem as to whether one can ensure that semantic hierarchies appear in the plot: for example if Nice was only a city, would we observe a minimal intersection with the support of word “city” ? (intersection to be understood at minimal level set, not necessarily 0).\n\n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}