{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "In this paper, the authors studied a so-called source-free domain adaptation problem. They aimed to propose a universal DA method for different relationships between the target label set and the source label set, without accessing the source domain data in the adaptation phase.\n\nThe problem studied is an interesting and practical problem for domain adaptation. The proposed solution looks promising at the high level. However, there are some major concerns.\n\n1. The term \"source-free\" is misleading. Indeed, a \"source domain\" is needed in the procurement stage. Based on the the proposed method, there is still an assumption on the source domain, i.e., there is an overlapping label set between the source domain and the target domain. Given a target domain, if there are not overlapping labels between the target domain and the source domain, the proposed method will fail to work. In this sense, the term \"universal\" is also misleading.\n\n2. In the proposed procurement stage, a key step is to generate the so-called \"negative\" source instances. The authors proposed two heuristic approaches, one for image data, and the other for non-image data. These two approaches looks okay, but not convincing as no deeper analysis is provided. Moreover, in experiments, only the image domain is used. The effectiveness of the approach for non-image negative instances generation is not verified.\n\n3. In prediction, for the case where the target domain has a set of private labels, the proposed method can only predict all instances of private labels as \"unknown\" if successful. This may not be useful in practice. \n\nHere are the minor concerns:\n1. Authors attempted to compress much content into 9 pages, which makes to the paper a little difficult to follow.\n\n2. In the literature of transfer learning or domain adaptation, a similar problem setup was studied around 10 years ago, which was focused on the application of web text mining. \n\"Xiang et al., Source-Selection-Free Transfer Learning, IJCAI-11\""}