{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "Strengths:\n-- The paper is well written and easy to follow\n-- Learning graph representation learning is a very important problem\n-- The performance of the proposed approach are strong on the existing data sets\n\nWeakness\n--  the novelty of the proposed method is marginal\n-- Some real-case study on why the model works are not presented.\n-- The data sets used in the experiments are too small\n\nThis paper studied learning the hierarchical representation of graphs. Comparing to the previous work DiffPool, the author proposed to use multiple node representations and multiple pooling functions. Experimental results on a few data sets prove the effectiveness of the proposed approach.\n\nOverall, the paper is well written and easy to follow. Learning the hierarchical representation of graphs is an important and also interesting problem. However, I feel the novelty of the proposed method is marginal. And besides, though illustrated using artificial example in the introduction, it is not clear why the proposed method work in practice. Specifically, I have the following questions:\n(1) How does multiple convolutional method compared with just concatenating the weight matrix W_i, in other words, we can just use a much larger node embedding size. From equation (2) and (3), I feel these two are identical. The authors should explain this.\n(2) Similar concerns in the multiple pooling case.\n(3) It would be more convincing that the authors presented a few real cases to prove the effectiveness of the proposed approach instead of only using the artificial examples in introduction."}