{"experience_assessment": "I have published in this field for several years.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "\n\nThis paper claims to propose an extension of the Transformer architecture specialized for the mobile environment (under 500M Mult-Adds).\nThe authors propose their method called \"Long-Short Range Attention (LSRA),\" which separates the self-attention layers into two different purposes, where some heads focus on the local context modeling while the others capture the long-distance relationship. \nThey also demonstrate consistent improvement over the transformer on multiple datasets under the mobile setting. \nIt also surpasses the recently developed comparative method called \"Evolved Transformer\" that requires a far costly architecture search under the mobile setting.\n \nThis paper is basically well written and easy to follow what they have done.\nThe experimental results look good.\n \nHowever, I have several concerns that I listed as follows.\n \n1,\nI am not sure whether my understanding is correct or not, but it seems that the proposed method, LSRA, is not a method specialized for mobile computation.\nIn fact, in the paper, they say, \"To tackle the problem, instead of having one module for \"general\" information, we propose a more specialized architecture, Long-Short Range Attention (LSRA), that captures the global and local information separately.\" \n \nThere is no explicit discussion that LSRA is somehow tackling the mobile setting.\nThere is a large mismatch (gap) between the main claim and what they have done.\nIn other words, LSRA can be simply applied to standard-setting (non-mobile setting). Is there any reason that the proposed method cannot be applied to the standard-setting?\nIf my understanding is correct, the paper must be revised and appropriately reorganized to clear this gap.\n \n2,\nI am not convinced of the condition of the so-called \"mobile setting (and also extremely efficient constraint).\" \nPlease provide a clear justification for it.\n \n"}