{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "Summary.\nThe paper presents a predictive control approach where an agent learns to drive conditioned on predicted future road angles and lane centeredness over time. The effectiveness of the proposed approach is evaluated in the TORCS racing simulation environment. An existing DDPG approach is used as a baseline. Though an interesting problem is addressed, its technical and theoretical contribution is weak.\n\nStrengths.\n1. The paper addresses an interesting problem -- building a model that is predictive of future events and outcomes.\n2. The proposed approach is evaluated in the TORCS simulation environment and shows better performance than the baseline, i.e. DDPG.\n\nWeaknesses.\n1. vs. existing predictive control approaches\nThough the motivation behind this work is interesting, approaches have been introduced to address similar problems. Unfortunately, these approaches are neither properly introduced nor compared well. Some work may include:\n\n[1] Ebert, F., Finn, C., Dasari, S., Xie, A., Lee, A., Levine, S., “Visual foresight: Model-based deep reinforcement learning for vision-based robotic control,” arXiv 2018.\n[2] Tamar et al., “Learning from the Hindsight Plan - Episodic MPC Improvement,” ICRA 2017.\n\nIn addition, there is a large volume of references for the model predictive control (MPC). Some work may include:\n\n[3] Rosolia et al, “Learning Model Predictive Control for Iterative Tasks, A Data-Driven Control Framework,” IEEE T Automatic Control, 2018.\n\n2. Needs more rigorous explanations of the model.\nThe proposed model depends on conventional RL building blocks and uses similar MDP notations, but using conventional notations with different definitions could make readers confused. For example, gamma is usually used for a discount factor, but gamma in this paper is used as a continuation function, which is not clearly defined, i.e. why there is m number of gamma functions? \n\n3. vs. Existing deep driving models.\nAs cited, the work by Chen et al. successfully showed that a ConvNet can predict intermediate features (i.e. distances to lanes) and a simple PID controller can control a vehicle in the TORCS simulator. The work by Bojarski et al. predicts a curvature of driving, which captures information about the shape of the road ahead. More recent driving models [4,5] predict multiple waypoints, which may reduce the need to use the proposed future prediction technique.\n\n[4] Bansal et al., “Chauffeurnet: Learning to drive by imitating the best and synthesizing the worst,” RSS 2019.\n[5] Zeng et al., “End-to-end Interpretable Neural Motion Planner,” CVPR 2019.\n\nMinor concerns.\n1. Figures need more work to visualize better (i.e. hard to see texts, missing legends, and missing x and y labels).\n2. Typos"}