{"title": "Essentially a better retrieval method", "review": "The paper tackles the problem of multiple-choice reading comprehension problem, notably ARC, along with two datasets that the authors create from RACE and MCScript. The paper proposes to retrieve a passage by concatenating only the essential terms with each choice, and then use a reading model to obtain the answer from question-choice-passage triple. The paper obtains ~3% improvement over the previous SOTA on ARC and non-trivial improvements on the other two datasets that the authors created.\n\nThe paper is generally well-written and I did not have much problem understanding it. Also, the result is encouraging in that it was able to improve ARC by identifying essential terms and then just using them (concatenated with each choice) to retrieve a good passage. However, I have two concerns:\n\nOne is that the test dataset is very small. If I understood it correctly, it only has 200 questions (10% of 2k). 3% improvement hence corresponds to 6 questions. Since the dataset is 4-choice, getting 6 more questions right is certainly within the range of randomness. So it is not clear if the improvement is statistically significant. While the model also gets an improvement over the other two datasets, they are created by the authors and only have relatively weak baselines (which were implemented by the authors).\n\nThe second weakness is that the model is essentially proposing a better way to retrieve a passage. TF-IDF is a completely unsupervised method of weighing the importance of each word. Hence it is not surprising that the supervision of essential terms (on their importance) improves retrieval accuracy. There is nothing much new in the reader model (quite standard approaches for MRC), so I am worried about the novelty of the paper.\n\nOverall, while I think it is encouraging to know that a carefully designed retrieval model can improve ARC, the contribution does not seem to be significant enough for ICLR.\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}