{"title": "This paper proposed a PDE based perspective to understand and parameterize CNNs. The current manuscript missed some very important references (see below). The theoretical guarantees from PDE field are also not convincing. Besides, the experimental results are also weak.", "review": "In general, understanding CNNs as a PDE is definitely correct and useful. However, many existing works, not only the papers mentioned by the authors, but also other ones, including [1, 2, 3] listed below, have investigated this topic and proposed many different network architectures based on this understanding. For example, in [1, 2, 3], authors also proposed a DCT based parameterization scheme for convolution operator and FFT is also considered to speed up the computation. Thus I think the proposed idea is a little bit incremental. \n\nAs for the particular parameterization schemes, I am afraid the idea is somehow handcraft and thus it is not very clear why the proposed diagonal and circulant operator can properly approximate the original convolution architecture, especially from theoretical side. Authors have claimed that one may borrow theoretical investigation from PDE to address this issue. However, I believe this is definitely not a trivial work. For example, the stability properties of PDE are mostly built on based specific formulation and discretization of PDEs. But the proposed architectures definitely not fit these assumptions. Thus transferring existing theoretical results in PDE area to the proposed scheme is not a straightforward work.  \n\nFor the experimental part, I am afraid the results are also weak. For example, please notice that many works have proposed schemes to simplify the network architectures. I believe authors should compare more existing works to demonstrate the superiority of the proposed one. Also, I suggest authors to demonstrate the proposed schemes on not only high-level, but also low-level vision tasks. This is because the reaction diffusion based architectures have been widely used in these areas, such as [3].\n\n[1] Jakob Kruse, Carsten Rother, and Uwe Schmidt. Learning to Push the Limits of Efficient FFT-based Image Deconvolution. ICCV 2017\n[2] Uwe Schmidt and Stefan Roth. Shrinkage Fields for Effective Image Restoration. CVPR 2014\n[3] Yunjin Chen, Thomas Pock:Trainable Nonlinear Reaction Diffusion: A Flexible Framework for Fast and Effective Image Restoration. IEEE TPAMI 2017\n", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}