{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "Overview:\nThe authors propose a new task of Semantic Instance Completion where given a RGB-D scan of a room, they predict 3D objects in the scene (via instance segmentation masks) and complete the partial scans at the object level. They claim the following contributions:\n1. \"We introduce the task of semantics instance completion for 3D scans\",\n2. \"We propose a novel, end-to-end 3D convolutional network which predicts 3D semantic instance completion as object bounding boxes, class labels and complete object geometry\",\n3. \"We show that semantic instance completion task can benefit semantic instance segmentation performance\".\nThey also report experiments on Scannet and SUNCG.\n\nMAJOR COMMENTS:\n1. My biggest critique regarding this submission is it's novelty/value relative to prior work (Dai et al, 2018 and Hou et al, 2019). I agree with the aim of the authors and like the idea of completing the partial scan to be able to do better instance segmentation. However, this is not a novel idea per se in my opinion. As the authors themselves mention in Section 2, Related Work: 3D Scan Completion, other works have looked into trying to complete the scan which can be followed by a semantic instance segmentation approach (a baseline the authors compare against). The main contribution as I see it is doing the two tasks of instance segmentation and scan completion jointly in a single network. From an implementation perspective, this means adding a 3D unconv stream with Instance completion loss and Proxy completion loss; binary cross entropy terms that compare prediction scan geometry with ground-truth at object category and scene level respectively. This is made clearer when comparing Figure 2 of this work and of (Hou et al, 2019). Given this context, this paper feels more like a journal submission which improves upon (Hou et al, 2019) instead of a conference submission by itself. \n2. The authors claim that they outperform state-of-the-art approaches by over 15 in mAP@0.5 on ScanNet (Abstract). I find this misleading. I give the benefit to the authors in saying that the \"correct\" comparison is between the predictions and ground-truth for \"completed\" scans. However, ground-truth is not available for this comparison. The other meaningful comparison (which the authors also do) is propagating their semantic instance labels (from completed scan) to input partial scan and then evaluate on the task of Semantic Instance Segmentation. This comparison is done in Table 2 and shows significant improvement. However, looking at the results on ScanNet Benchmark (http://kaldir.vc.in.tum.de/scannet_benchmark/semantic_instance_3d), the numbers are worse than state-of-the-art. There is also a difference in the categories on which the model is evaluated. This also leads to another critique.. The authors only compare against (Hou et al, 2019) instead of the other methods on the benchmark. The other works need to be mentioned in the Related Work and compared against in Table 2.\n\nRATING:\nGiven the two critiques above, I have marked this as a WEAK REJECT. "}