{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "This paper studies the problem of re-rendering the appearance of an object from novel viewpoints, given reference images of the same object as input. Multi-view reconstruction and camera poses are used to generate depth images to be used as additional input to the network. The authors propose an EffectsNet architecture to derive view-independent Lambertian reflectance maps and train the network in a self-supervised way through re-projection. From the target viewpoint, the image is re-textured by a blending network and view-dependent lighting effects are added back, to generate a novel-view rendering.\n\nApplication may be limited due to the fact that the network is re-trained from scratch for each object instance. Another weakness is insufficient evaluation against other deep-learning based IBR approaches. It is nice to see comparison with Hedman et al. (2016 and 2018) but I feel that details are missing. Figure 6 and L3-4 of page 8 claim a better MSE and qualitative results for a single example, but the difference is not obvious and to validate the claim that the proposed approach \"leads to superior reproduction of view-dependent appearance\" (Page 3 under Image-based Rendering), I think a more systematic evaluation on multiple objects and views is needed.\n\nDespite the weaknesses, I am leaning towards Weak Accept because I think the benefits (requiring less training examples and being able to generate a more temporally coherent images) are convincing. Using surface reflectance decomposition to reduce photometric inconsistency in projection-based self-supervision is also novel for this task. But I think a more thorough comparison with Hedman et al. would be crucial in justifying the design choices.\n\nOne potential improvement for future work is that it may be possible to compute confidence maps in the diffuse image estimation step and use that to improve blending of the warped images."}