{"title": "Interesting theoretical study with issues in motivation and experiments", "review": "The paper introduces scattering transforms on graphs by adopting diffusion wavelet constructions, and gives an extension of the scattering transforms to non-Euclidean domains. The main result consists of a stability analysis of the non-adaptive representation under deformation of the underlying graph metric, also defined in terms of graph diffusion.\n\nPros: \n\nThe study addresses the important problem of representation stability of non-Euclidean CNNs, which is a timely topic. The theoretical analysis builds an interesting connection between the diffusion graph geometry and the analysis of deep networks.\n\nCons: \n\n- It is unclear what type of graph is the primary consideration, either (a) expander/small-world with large spectral gap, e.g. social network, or (b) irregular mesh embedded in a Euclidean space or on an intrinsic manifold - as originally considered in diffusion wavelet, and in the Euclidean CNN/scattering transform theory - which often fails to present a spectral gap. The formula suggests (b) while the analysis and experiments point to (a). A coverage of both cases is unlikely. \n\n- The deformation considered is proposed in terms of the graph metric perturbation, which appears to lack sufficient motivation. This is not apparent from the experimental results (How is the x-axis of plots in Figure 1 related to \"perturbation\"?). Will such deformation reduce to that as being considered for irregular meshes in computer vision applications e.g. in [1]? The proposed model would be more convincing if the class of \"covered deformations\" can be clarified and the relevance to practices of non-Euclidean CNNs can be better addressed.\n\n- The experimental section lacks performance and comparison in a controlled environment, e.g., on synthetic data with more samples to show statistical significance. There also appears to be a gap between theory and experiment: can the dependence on spectral gap be empirically supported, even only qualitatively, e.g., by a comparison on small world graph v.s. others?\n\nOverall, the recommendation is still in favor of acceptance. Finally, the reviewer would like to raise the following questions:\n\n- As the result is presented as an extension of the Euclidean scattering transform, will the stability result recover the traditional one in Mallat et al. when the underlying graph is a regular grid (though the definition of deformation differs in appearance)?\n\n- What about the computational efficiency, scalability and storage cost of the algorithm? It would also clarify the computational procedure by providing an algorithm box or release of code. However, assuming that the focus of the paper is on theory, computation is a relatively minor point.\n\n[1] Boscaini, D., Masci, J., Rodolà, E., & Bronstein, M. (2016). Learning shape correspondence with anisotropic convolutional neural networks. In Advances in Neural Information Processing Systems (pp. 3189-3197).\n", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}