{"title": "Important problem. Some convincing results. Some missing baselines. Some missing previous work. Limited novelty.", "review": "This paper proposes an approach to disentangle the impact of \"age\" while quantifying the impact of narrative transcripts on predicting dementia. \"Age\" is a confounder as it impacts both the narrative transcripts (due to change in cognitive abilities with age) and dementia (as one gets older they're more likely to get dementia). \n\nThe paper proposes an adversarial approach which essentially learns to correctly predict dementia classification using narrative text but adversarially predicts \"age\" to deconfound the impact of \"age\". The paper also contributes by extending the fairness metric proposed by (Madras et. al. 18) to continuous attributes. The experimental results are shown on dementia datasets based on DementiaBank and FamousPeople to highlight the efficacy of the proposed approach.\n\nThe paper is well written and nicely describes the motivation for the problem being solved. That said, the paper has several weaknesses:\n\n1). There is a rich literature these days on adversarially protecting sensitive attributes OR relatedly text understanding in confound-controlled settings. Some of the papers that the authors missed and should cite are: \"Deconfounded Lexicon Induction for Interpretable Social Science\"; \"Interpretable Neural Architectures for Attributing an Ad’s Performance to its Writing Style\" (both Pryzant et. al. '18); \"Towards robust and privacy-preserving text representations.\" (Li et. al. 18) etc. \n\nConditioning on that work, the methodological novelty of the proposed approach is little. I consider the extension of the metric proposed by (Madras et al. 18) to continuous sensitive attributes-- as touted by authors-- as straightforward. The only novel contribution in my eyes is the use of adversarial techniques for the important problem of dementia prediction-- a very important problem.\n\n2). The paper discusses the weaknesses of the conventional approaches to the confound-controlled problem e.g. \"Controlling A\", \"Controlling X\", \"Pre-adjusting X\". However, it does not mention or compare against another set of popular approaches in statistics and social sciences for such problems-- matching-based approaches such as propensity-score matching which match dementia patient with a control who is most similar to them on attributes such as age.\n\n3). Also, how would a conventional \"residualization\" approach fare relative to the proposed approach? That is, first regress (potentially non-linearly) narrative transcripts on age and compute the residual i.e. part of variance in text not explained by age. Finally, regress this residual on dementia. \n\n4). In the experiments section, the authors mention that they did not directly optimize the fairness metric i.e. FP/FN rates as it is non-differentiable. That is true, but they definitely need to provide that baseline as it will provide an upper-bound on the most fair solution that could be achieved and would help put the results in perspective. (There are methods out there for non-differentiable objective functions, though of course they might lack theoretical guarantees.  I believe that having any such baseline numbers is more important than having none at all.)\n\n5). It's surprising that the simplest of the methods i.e. age-indep-simple and age-indep-autoencoder have the best fairness scores in Table 2. Why is that? Why don't more complex approaches based on consensus and entropy fare better? ", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}