{"title": "A renewed attempt for adapting dialog responses to emotional context", "review": "The paper describes a new study about how to make dialogs more empathetic.\nThe work introduced a new dataset of 25k dialogs designed to evaluate the\nrole that empathy recognition may play in generating better responses \ntuned to the feeling of the conversation partner.  Several model\nset-ups, and many secondary options of the set-ups are evaluated.\n\nPros:\n\nA lot of good thoughts were put into the work, and even though the techniques\ntried are relatively unsophisticated, the work represents a serious attempt\non the subject and is of good reference value.\n\nThe linkage between the use of emotion supervision and better relevancy is interesting.\n\nThe dataset by itself is a good contribution to the community conducting studies in this area.\n\nCons:\n\nThe conclusions are somewhat fuzzy as there are too many effects\ninteracting, and as a result no clear cut recommendations can be made\n(perhaps with the exception that ensembling a classifier model trained\nfor emotion recognition together with the response selector is seen\nas having advantages).\n\nThere are some detailed questions that are unaddressed or unclear from\nthe writing.  See the Misc. items below.\n\nMisc.\n\nP.1, 6th line from bottom: \"fro\" -> \"from\"\n\nTable 1:  How is the \"situation description\" supposed to be related to the\nopening sentence of the speaker?  In the examples there seems to be substantial\noverlap.\n\nFigure 2, distribution of the 32 emotion labels used:\nthis is a very refined set that could get blurred at the boundaries between similar emotions.\nAs for the creators of those dialogs,  does everyone interpret the same emotion label the same way?\ne.g. angry, furious; confident, prepared; ...; will such potential ambiguities impact the work?\nOne way to learn more about this is to aggregate related emotions to make a coarser set,\nand compare the results.\n\nAlso, often an event may trigger multiple emotions, which one the speaker chooses to focus on\nmay vary from person to person.  How may ignoring the secondary emotions impact the results?\nTo some extent this is leveraged by the prepending method (with top-K emotion predictions).\nWhat about the other two methods?\n\nP. 6, on using an existing emotion predictor:  does it predict the same set of emotions\nthat you are using in this work?\n\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}