{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This work presents a new online training scheme which is amenable to non volatile memories and particularly applicable to smart edge devices. This deals with 4 challenges with smart edge learning paradigms - low weight update density, weight quantization, low auxiliary memory, online learning and show experiments to understand benefits. \n\nDisclaimer: I am far from an expert on this domain, so my review is not very well calibrated or informative. \n\nHow exactly are you implementing optLR in Section 4.2?\n\nMaybe the section 4.3 can instead go to prior work/related work rather than be described in this paper if it’s not being used very much. It seems important for the mixing of the lower SVD elements in the OK method but perhaps can be removed. \n\nI think for people less familiar with the area, a more intuitive explanation of section 4.4 would be helpful. \n\nGenerally how much does the algorithm suffer from using an SVD type approximation for learning?\n\nThe new contributions of this paper are to use a running estimate of Q_L, Q_R and weightings using modified Gram Schmidt. \n\nNot immediately clear how the scheme described related to the quantization point in the challenges. \n\nExperiments seem to show the proposed benefits but are done with artificial models/simulations. Would it be easy to implement this on chip and try it on actual hardware? Can we also compare to things like OK/UORO in the experiments?\n\nOverall seems like a novel and interesting way to do SGD on the edge, I think that a little bit simpler explanation would make the paper more readable and some additional comparisons would also benefit the paper. "}