{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This work is about Deep Neural Network Models with interpretable components. The authors replace network input with outputs of predefined (manually selected) filters, e.g. sharpening, embossing, color and edge filters. Experiments done on MNIST and ImageNet verify that the proposed architecture has comparable/slightly better performance than original network structure. \nStrength:\n1. Handcrafted features + CNN concept is not new. Many believe this typical structure can hardly lead to good result. This paper explains deteriorated result is mainly due to badly selected filters. If the filters are selected well, comparable performance can be achieved. \n2. The paper also design method to obtain filter score which can indicate the contribution of a typical filter to the final classification result. It provides a direct way for people to understand the relationship between image attributes and the classification result.  \n\n\nWeakness:\n1. It is necessary to verify whether the network is applicable to various tasks, e.g. detection/segmentation. However, limited experiments are done in this work. \n2.  As the pre-defined filters can only extract low-level features, the framework can only learn the impact of the superficial features, e.g. color, edge to the final classification result. It is doubtful that this architecture can be used interpret the contribution of high-level abstract features. \n3.  Authors have shown that number of filters can directly affect the final classification performance. However, they did not analyse the contribution of different types of filters to the results. \n4. Image outputs of sharpening and blurring filters preserve most visual information of the original image. If remove the two filters, will the final classification results differ very much? If replace this two with the original image, what will be the result? \n5. Normalized random filter provides the best result, but little analysis and discussion are done to explain why it is the best. How many random filters are used? What's the similarity/difference between random filter + CNN and CNN with first layer fixed with initial weights?  \n\nThis paper does not verify the effectiveness of the architecture on various types of computer vision tasks, e.g. detection/segmentation. It also misses important analysis of contribution of different filters to the performance.  The proposed network can only help us to interpret the impact of superficial features, e.g. color, edge and shape to the classification result. This may not work for tasks when low-level feature dose not perform well, e.g. large-scale face recognition task.  \n"}