{"rating": "6: Weak Accept", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "OVERALL:\n\nI don't work on ATP and am not particularly well suited to review this paper, but I am\nslightly inclined to accept for the following reasons.\n\n1. It's an important problem and not much work is done on it.\n2. Creating new environments is hard, valuable work that is (IMO) insufficiently incentivized in our community,\nand I think accepting papers that do this work is a good policy.\n3. The experiments, to my super-inexperienced eye, seem well designed and like they address\nobvious questions readers would have.\n\nHowever, I have no idea if e.g. the baselines used in this paper are reasonable, so\nI would appreciate someone with more experience on that topic weighing in.\n\n\nSome limitations of the paper:\n\n1. I'm not actually convinced there's much that's methodologically new here. \nIt seems like mostly an application of existing RL techniques to an ATP environment.\n\n2. The writing is not particularly clear, and could use substantial editing (but this\nis something that could be fixed during the discussion period).\n\n3. The focus on Robinson arithmetic seems kind of limiting.\nThough I am sympathetic to the reasoning given in the paper, it's unclear to me (again, as a non-expert),\nthat the techniques that work in this context will actually work in the context considered by e.g. [1]\n\nDETAILED COMMENTS:\n> In the training set, all numbers are 0 and 1 and this approach works more often.\nYou have this sentence twice in different places.\n\n> it is insightful to compare...\nNot a very idiomatic use of insightful?\n\n\n[1] Deep network guided proof search.\n"}