{"rating": "3: Weak Reject", "experience_assessment": "I have published in this field for several years.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "In this work, a method was proposed to train capsule network by projectively encoding the manifold of pose-variations, termed the space-of-variation (SOV), for every capsule-type of each layer. Thereby, the proposed method aims to improve equivariance of capsule nets with respect to translation (rotation and scaling).\n\nThe proposed method is interesting and the initial results are promising. However, there are various major and minor problems with the work:\n\n- There are various undefined functions and mathematical notation, such as the following:\n\n- Please give formal and precise definitions of groups and group representations for readers who are not familiar with mathematical groups.\n\n- What are GetWeights and Agreement used in Algorithm 1?\n\n- Please define “routing among capsules” more precisely.\n\n- How do you calculate Pool() more precisely?\n\n- In the paper, the results are given for a general class of groups. However, it is not clear how these results generalize even for some popularly employed groups, such as Z^n, S_n, SO(n), SE(n) etc., with different symmetry properties, base space, and field type.\n\n- Please check the following paper for a detailed discussion on group equivariant CNNs with different group structures, and elaborate the theoretical results for particular groups (e.g. at least for p4m used in experiments) :\n\nT.S. Cohen, M. Geiger, M. Weiler, A General Theory of Equivariant CNNs on Homogeneous Spaces, NeurIPS 2019\n\n- Please define the norms used in Algorithm 2.\n\n- How do you calculate accuracy of models? Are these numbers calculated for a single run, or for an average of multiple runs? If it is the former, please repeat the results for multiple runs, and provide average accuracy with variance/standard deviation. If it is the latter, please provide the variance/standard deviation as well.\n\n- Have you performed analyses using larger datasets such as Cifar 100 or Imagenet? It would be great to provide some results for larger datasets to explore their scalability. \n\n- Please define accuracy given in tables more precisely, use dot \".\" at the end of sentences in captions.\n\n- There are several typo/grammatical errors, such as the following:\n\n-- Homegenous -> homogeneous\n\n--  for with prediction networks\n\n-- Please proof-read the paper in detail and fix the typo etc."}