{"title": "Some clarity issues", "review": "This paper presents a mean-replacement pruning strategy and utilizes the absolute-valued Taylor expansion as the scoring function for the pruning. Some computer vision problems are used as test beds to empirically show the effect of the employment of bias-propagation and different scoring functions. The empirical results validates the effectiveness of bias-propagation and absolute-valued Taylor expansion scoring functions.\n\nThe work is generally well-written and the results are promising, and the theoretical explanation in 3.3 is intriguing. However, I think the following issues need some further clarifications:\n1. What's the exact difference and connection between the mean-replacement pruning technique, and the bias-propagation technique in Ye et al., (2018) and the mean activation technique in Morcos et al. (2018)? The authors only mention that mean replacement pruning extends the idea in Ye et al. (2018) to the non-constrained training setting, but it is very unclear what \"constraints\" are talked about. Some more detailed and formal comparisons should be added, together with potential empirical comparisons.\n2. In the abstract, the authors claim that they \"adapt an existing score function ...\", but from the main text it seems that absolute-valued Taylor expansion score is exactly the same one in Molchanov et al. (2016). Is this a typo (or misleading claim) in the abstract?\n3. There are no comparisons of the approach proposed in this paper with some existing state-of-the-art, apart from some simple comparisons between whether bias-propagation is adopted and some inner comparisons among different scoring functions.\n\nIt would also be much better if some charts/tables with certain metrics for improvement apart from pruning penalties (e.g., compression rates, or inference speed, etc.) instead of simply illustrative figures are shown. \n\n### some smaller suggestions/typos ###\n1. The plot legends/labels are kind of inconsistent with the description before the figures. For example, in the main text the authors mainly use \"pruning penalty\", while in the figures the y-axes are typically labelled as \"\\Delta-loss after pruning\", and the plot tag at page 5 bottom is different from those used in the plots, which introduces some unnecessary confusion.\n2. It is very unclear how the authors arrive at the conclusion \"This results suggests ... the training process\" from the \"winning ticket\" hypothesis.\n3. Several typos that can be easily spell-checked (e.g., \"the effect or pruning\" -> \"the effect of pruning\", etc.).\n\nI hope the authors can address these issues. Thanks!", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}