{"title": "Not self-contained paper.", "review": "This paper proposes a novel graph convolutional neural network to tackle the problem of zero-shot classification. To learn the classifier of unseen classes, the relational structure between classes are used as the input of graph convolutional network (GCN). And then the model imposes the output of GCN to be weights of a classifier learned from a supervised classification model such as ResNet, in the hope of having a good classifier for unseen classes while fitting the known classes.\n\nOverall, the paper is not self-contained. It is almost impossible to understand the overall architecture without prerequisites (GCNZ paper in this context). The description of each module is relatively clear, however, it fails to give an overall connection between different modules used in the proposed paper. For example, it has never been described what would be the input feature of the GCN or DGP modules (such as the number of nodes should be the same as the number of all classes). There is no explanation why the output of GCN should resemble the final weight of the ResNet, and what this means to solve the zero-shot learning problem, and eventually how the knowledge graph would help to solve the problem of zero-shot learning. I personally found the answers to these important questions from the description in GCNZ paper. Therefore, although the model improves the performance of the previous work, I don't think it is publishable in its current condition.\n\n- Missed some of recent work. Recent papers [1,2] incorporates attention mechanism to deal with the potential dilution in GCN. Although DGP uses different weighting based on the distance from a node, the attention mechanism is clearly more expressive than the distant-wise weighting used in this paper.\n- Section 3.5 should be in the experiments section since it describes the details of experiments.\n\n[1] W.L. Hamilton, R. Ying, and J. Leskovec. Inductive representation learning on large graphs. arXiv preprint,\narXiv:1603.04467, 2017.\n[2] Velickovic, P., Cucurull, G., Casanova, A., Romero, A., Lio, P., & Bengio, Y. (2017). Graph attention networks. arXiv preprint arXiv:1710.10903, 1(2).\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}