{"title": "Not convincing", "review": "This paper aims to provide additional information in addition to class labels, which can be used to explain classification results. Although the direction of this paper makes sense, it has a few critical problems as follows:\n\n1.  There is no semantics in binary classification. and each branch does not have any particular meaning. The LSTMs are probably trained to minimize the risk, which can be defined as making a mistake at the early stages. Also, two branches in the tree seem to always have the exactly (or at least almost) same number of classes, which is very artificial. I am not sure what kind of additional information can be obtained other than some sort of information similar to taxonomy. It is actually not a taxonomy because the binary decision in each step does not correspond to semantic hierarchy as mentioned earlier\n\n2. The proposed method has very weak scalability. Although the paper claims that this method is generic and can be applied to various problems, it is not straightforward to be used in more complex problems such as object detection and image segmentation. In these cases, the algorithm needs to generate binary tree for each object instance or image pixel.\n\n3. Experiment is very weak and the method is tested on very few small datasets. Especially, experiment on MNIST is meaningless because the tree corresponding to the dataset is very shallow according to Figure 2. Evaluation of zero-shot learning is minimal.\n\n4. There should be some discussion about cost to add the proposed network. How many parameters are needed? How much time should we spend more for training and testing?\n\nThis paper should be formulated as taxonomy learning problem and compared with the papers about it further. The main idea may be okay, but the quality of the paper is below standard of the conference.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}