{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "Overall the proposed pipeline for video inbetweening, which gradually increases the resolution in temporal dimension using a fully convolutional network instead of rnns, seems very good. \n\nHowever, I think current experiments do not fully evaluate the effectiveness of the proposed method. Specifically,\n\n1. I do not see much discussion on the motivations of various architectural designs in section 3. \n\n2. how do you obtain the initial noise tensor u? And seems u already introduces diversity in the proposed method, it looks redundant to add n^(l) at each level. I do not see much discussion on this in section 3, and the ablation study also doesn't include this.  This brings another concern about the ablation study, which I think could be conducted more thoroughly, since the proposed method includes many components. (e.g. why using max(0, 1- g_e - g_s) rather than a third gate g_z ?)\n\n3.  it is hard to say whether the proposed method is better than baselines according to Table 3 only. At first, I agree FVD is better than SSIM considering the diversity. However, Table 3 compares the proposed method with baselines in terms only SSIM. Secondly, in terms of SSIM the proposed method performs worse than baselines on BAIR and KTH with large margins, but the comparison is conducted between 7 frames of baselines and 14 frames of the proposed method.  Table 3 indeed needs a lot of improvement.\n\n4. Finally, the authors suggest video inbetweening could handle the cases where the temporal distance between consecutive frames is large. I would like to see such samples or related experiments. \n\n5. Minor point, the qualitative samples are too small to view.\n\nConsidering these points, I think the experiments could be improved before publication."}