{"title": "Fun, albeit incremental paper", "review": "Summary\n\nThis paper derives a new policy gradient method for when continuous actions are transformed by a\nnormalization step, a process called angular policy gradients (APG). A generalization based on\na certain class of transformations is presented. The method is an instance of a \nRao-Blackwellization process and hence reduces variance.\n\n\nDetailed comments\n\nI enjoyed the concept and, while relatively niche, appreciated the work done here and do believe it has clear applications. I am not convinced that the measure theoretic perspective is always\nnecessary to convey the insights, although I appreciate the desire for technical correctness. Still,\nappealing to measure theory does reduces readership, and I encourage the authors to keep this in\nmind as they revise the text.\n\nGenerally speaking it seems like a lot of technicalities for a relatively simple result:\nmarginalizing a distribution onto a lower-dimensional surface.\n\nThe paper positions itself generally as dealing with arbitrary transformations T, but really is \nabout angular transformations (e.g. Definition 3.1). The generalization is relatively \nstraightforward and was not too surprising given the APG theory. The paper would gain in clarity\nif its scope was narrowed. \n\nIt's hard for me to judge of the experimental results of section 5.3, given that there are no other \nbenchmarks or provided reference paper. As a whole, I see APG as providing a minor benefit over PG.\n\nDef 4.4: \"a notion of Fisher information\" -- maybe \"variant\" is better than \"notion\", which implies there are different kinds of Fisher information \nDef 3.1 mu is overloaded: parameter or measure?\n4.4, law of total variation -- define \n\n\nOverall\n\nThis was a fun, albeit incremental paper. The method is unlikely to set new SOTA, but I appreciated\nthe appeal to measure theory to formalize some of the concepts.\n\n\nQuestions\n\nWhat does E_{pi|s} refer to in Eqn 4.1?\nCan you clarify what it means for the map T to be a sufficient statistic for theta? (Theorem 4.6)\nExperiment 5.1: Why would we expect APG with a 2d Gaussian to perform better than a 1d Gaussian\non the angle?\n\n\nSuggestions\n\nParagraph 2 of section 3 seems like the key to the whole paper -- I would make it more prominent.\nI would include a short 'measure theory' appendix or equivalent reference for the lay reader.\n\nI wonder if the paper's main aim is not actually to bring measure theory to the study of policy\ngradients, which would be a laudable goal in and of itself. ICLR may not in this case be the right\nvenue (nor are the current results substantial enough to justify this) but I do encourage authors to\nconsider this avenue, e.g. in a journal paper.\n\n= Revised after rebuttal =\n\nI thank the authors for their response. I think this work deserves to be published, in particular because it presents a reasonably straightforward result that others will benefit from. However, I do encourage further work to\n1) Provide stronger empirical results (these are not too convincing).\n2) Beware of overstating: the argument that the framework is broadly applicable is not that useful, given that it's a lot of work to derive closed-form marginalized estimators.\n", "rating": "7: Good paper, accept", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}