{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The authors propose a multi-agent communication framework(SARNet) using memory-based attention network. The main framework is to facilitate inter-agent communication and prior\ninformation to help decision.\n\nMain issues:\n1. In the Introduction part, the author claim the TarMAC does not use memory in the communication step, however TarMAC uses GRU policy to generate action and message, it does use the memory to generate message. So maybe you should look up it again.\n2. The main framework is so similar to TarMAC, I can hardly to conclude the novelty in this paper. Can you make a more detailed comparisons with TarMAC? Can the Questiion Unit be considered as the Targeted Communication part in TarMAC? If so, the main difference between SARNet and TarMAC is they use different ways to aggregate information in Memory Unit?\n3. For the experiment part, there need more figures and analysis. I think there may be need some learning curve figure or the final reward to prove the SARNet outperformed baselines. For example, in POCN, the agents are guided by dense reward, the the reward do measure the performance. The paper just provided the collisions and average dist in the environment, which is a good way to analysis emergent behavior but not enough to evaluate the algorithm. The attention visualization in Figure3 should place the correspond scene to demonstrator the learnt attention is meaningful. The main contribution from my perspective is the Memory Unit, however the paper just do the ablation study with noise in memory unit, this is not enough. The noise in memory part can be reasoned to the robustness problem in neural network also. You can test whether agents choose different strategies for same situation when their experience is different."}