{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "--- Overall ---\n\nI thought the authors presented a simple, but interesting idea for encoding temporal information as input to a discrete time model; however, I think the paper could use more intuition for why this approach should work and the experimentation does not appear to support use of the method. \n\n--- Major comments ---\n\n1. My understanding of the argument for this approach is that it supports easier learning for the functions we think may be present in our data, however, this is not clearly demonstrated in the paper. In particular, I never fully understood why time embeddings were preferable to simply including absolute time and time deltas. I imagine an argument of the form: \"A common function we might want to learn in health care is f, however, computing f from time deltas requires the network to learn XYZ complex function, whereas when using time embeddings it can be calculated more simply as ABC.\" I recommend using specific examples. There is a lot of extra room in this paper, so you can tutorialize a bit to make your point really clear.\n\n2. The experiments appear to show that using missingness indicators works better in most cases than using time embeddings. If this is the case, then why should I use time embeddings? In general, I try to promote publishing negative results, but since there is no error analysis, I don't feel like I understand why one approach is better than the other. Further, time deltas would seem to be the most comparable approach to time embeddings (certainly they are the most frequently mentioned alternative method in section 3) and should probably be included in the experiments."}