{"title": "Nice approach, but needs to be situated within the relevant work much better", "review": "This paper looks at system identification for a multi-link robot based upon combining a neural network with the manipulator equations.  Specifically, the authors propose to model the robot dynamics using the typical manipulator equations, but have a deep neural network parameterize the H(q) and g(q) matrices.  They illustrate that the method can control the systems of a simualted 2-dof robot and real Barrett WAM arm, better than a pure neural network modeling approach, PID control, or an analytic model.\n\nOverall, I think there is a genuinely nice application in this paper, but it's not sufficiently compared to existing approaches nor put in the proper context.  There is a lot of language in the paper about encoding the prior via a PDE, but really what the authors are doing is quite simple: they are doing system identification under the standard robot manipulator equations but using a deep network to model the inertia tensor H(q) and the gravity term g(q).  Learning the parameters that make up H(q) and g(q) is completely standard system identification in robotics, but it's interesting to encode these as a generic deep network (I'm somewhat surprised this hasn't been done before, though a quick search didn't turn up any obvious candidates).  However, given this setting, there are several major issues with the presentation and evaluation, which make the paper unsuitable in its current from.\n\n1) Given the fact that the authors are really just in the domain of system identification and control, there are _many_ approaches that they should compare to.  At the very least, however, the authors should compare to standard system identification techniques (see e.g., Wu et al., \"An overview of dynamic parameter identification of robots\", 2010, and references therein).  This is especially important on the real robot case, where the authors correctly mention that the WAM arm cannot be expressed exactly by the manipulator equations; this makes it all the more important to try identify system parameters via a data-driven approach, not with the hope of finding the exactly \"correct\" manipulator equations, but with finding some that are good enough to outperform the \"analytical\" model that the authors mention.  It's initially non-obvious to me that a generic neural network to model the H and g terms would do any better than some of these standard approaches.\n\n2) A lot of the derivations in the text are frankly unnecessary.  Any standard automatic differentiation toolkit will be able to compute all the necessary derivatives, and for a paper such as this the authors can simply specify the architecture of the system (that they use a Cholesky factorization representation of H, with diagonals required to be strictly positive) and let everything else be handled by TensorFlow, or PyTorch, etc.  The derivations in Sections 4.2 and 4.3 aren't needed.\n\n3) The authors keep referring to the Lagrangian equations as a PDE, and while this is true in general for the actual form here it's just a second order ODE; see e.g. https://en.wikipedia.org/wiki/Lagrangian_mechanics.  Moreover, these are really just the standard manipulator equations for multi-link systems, and can just be denoted as such.\n\nDespite these drawbacks, I really do like the overall idea of the approach presented here, it's just that the authors would need to _substantially_ revise the presentation and experiments in order to make this a compelling paper.  Specifically, if they simply present the method as a system identification approach for the manipulator equations, with the key terms parameterized by a deep network (and compare to relevant system identification approaches), I think the results here would be interesting, even if they would probably be more interesting to a robotics audience rather than a core ML audience.  But as it is, the paper really doesn't situation this work within the proper context, making it quite difficult to assess its importance or significance.", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}