{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "The authors present a new analysis pipeline \"BBSC\" for processing single-cell RNA-seq data based on a low-rank representation of gene expression. \n\nI have the following comments:\n\n1 - In the introduction, the method is motivated by an application in cancer, whereas the proposed pipeline is more generally applicable to any single-cell data\n\n2 - In order to reveal commonalities across subsets of cells with great variability such as cancer cells across patients, the authors propose a bi-state frequency model. However, the interpretation and appropriateness of this model for this problem is unclear. What do the burst frequency and k_size mean in the context of single-cell expression? The authors should motivate modeling assumptions using empirical observations and tests. \n\n3 - I also find the bi-state switching model for expression problematic given the sparsity (\"dropouts\") in scRNA-seq data which involves a low sampling (capturing) rate of transcripts per cell. Hence, we have a large portion of unreal zeros which could be confused with off states with this model.\n\n4 - I find the evaluation of the method especially on real data inadequate. First, the authors claim to infer more diverse subpopulations with BBSC which could be achieved with tuning parameters of many clustering algorithms to get a more refined clustering (e.g. reducing k in kNN-based clustering methods). Second, speculation based on a tsne map is not sufficient, since only local distances are preserved and global distances between discrete states in a tsne map have no meaning. Proper quantification of the difference and impact of BBSC is missing. Showing shared differentially expressed genes with no benchmark is not helpful. Finally, the method has not been compared to the numerous analysis methods for analyzing/clustering scRNA-seq data. See Chen, Geng, and Tieliu Shi. Frontiers in genetics 10 (2019) for a partial list.\n \nFor the above reasons, I do not agree that this method can reveal intra-cluster heteroegeneity.\n\nMinor:\nAbstract: \"new and clustering analysis\""}