{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "The authors provide a new method which they call \"bi-state and boolean matrix factorization for scRNA-seq data\" (BBSC) for clustering scRNA-seq data. It is based on a binarization of gene expression profiles into on/off states. Besides that they introduce \"PFAST“, a fast binary factorization (BMF) method, which adapts to the large scale of scRNA-seq data. With these techniques, the claim is that they are able to increase the resolution in identifying distinct cell types or functions. They apply their methods to head and cancer data, which reveals findings with a potential in preventing cancer progression.\n\nStrengths: An approximate gene expression bi-state model is proposed that is based on the frequency of expression occurrence and a binarization process. This concept of binarizing information in scRNA-seq data potentially enables to process the data with new methods that were previously not applicable\n\nWeaknesses: \n\n1. Only very specific genes work in a switch-like on off state with a viable threshold, there are many genes whose mode of operation are more analog with the level of the expression affecting responses. The authors do not distinguish between these types of genes nor hark to any prior literature on deciding what to discretize. \n\n2. There has been some literature by Saez-Rodrigues et al on boolean models of genes, the authors neither cite nor put their work in context of this. \n\n3. Within the characterization of on/off expression states, the parametric assumptions and the empirical assumption that the lowest none zero expression value of each gene approximates the error distribution, might not be right. \n\n4. The authors set up a \"strawman\" pipeline. Indeed there are some papers that make the mistake of using a 2-dimensional representation such as tSNE (which does not preserve density) to perform clustering. However, the majority of papers do not cluster ON TOP of tSNE and this is bad practice. Clustering on spectral dimensions, or community detection are more principled methods of processing data while simply using tSNE to visualize. The authors should use this more sensible pipeline to compare against. \n\n5.  Additionally, more details on and explanations of the silhouette score were missing.\n\n6. The authors do not do not offer enough background into boolean matrix factorization. For example they don't mentio cofactoring or BDDs which could be relevant here. In general, too much prior knowledge about binary matrix factorization is assumed. It should be further explained, otherwise it limits the usefulness for many people because they don’t see the value of the work.\n\n7. The PFAST algorithm is not well-explained. Within the section that explains PFAST, it is not a good argument to say that 95% of the noise has been eliminated to legitimate an extensive binary pattern mining.\n\n8. The formatting of the paper is not great. This involves the placement of pictures same as the algorithms. The algorithms should not only be formatted in a way that they are directly beneath each other, they also need to be more explained, as now it remains too unclear on what they actually do. "}