{"rating": "1: Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "Compared with classic analysis pipeline, the authors proposed BBSC as a new clustering analysis method for scRNA-seq data. In order to solve the BBSC pipeline, the authors proposed a fast and efficient BMF algorithm, named PFAST. The experimental report PFAST has the best experimental performance and takes the shortest running time. Overall, it is a complete research work on single cell analysis.\n\nThe related work in this paper is not enough. This paper only discusses the difference between the BBSC pipeline and the original method pipeline. The comparison algorithm in this article does not represent state-of-the-art. In my knowledge, there are many clustering methods for scRNA-seq, such as Biclustering (Zeisel et al. Science 2015), SC3 (Kiselev et al. Nat. Methods 2017), seurat 3.0 (Butler et al., Nature Biotechnology 2018. Stuart*, Butler*, et al., Cell 2019) and so on. I think the author should compare the method proposed in this paper with these methods. In particular, the method of seurat is currently a better method for single-cell clustering.\n\nIn single-cell clustering, we know that subclusters and subtypes are not a completely equivalent concept. This paper should do more analysis of subclusters results to support the viewpoint of this paper, such that they find more cell subtypes in real cancer data.\n\nThe paper is badly presented. The full name of this abbreviation should be clearly marked in the first occurrence of the abbreviation. Such as BBSC, PFAST, ASSO, PANDA and so on.\n\nThere are numerous grammar errors, e.g., there are over 4 grammar errors in the third sentence of the abstract “Current dimension reduction methods tend overly eliminate the expression variations correspond to less dominating characteristics, such we fail to find the homogenious properties of cancer development”"}