{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "= Summary \nThis paper presents a new weakly supervised approach for learning object segmentation with image-level class labels. The proposed neural network is trained to estimate an object mask and predict the groundtruth class label of the masked input image in which pixels outside of the object mask are filtered out. Further, the network is learned to predict the uniform class distribution when the the estimated object area is filtered out. The entire architecture is trained in an end-to-end manner with classification losses only. On a few datasets, the proposed model outperformed a set of existing techniques computing class attention maps.\n\n= Decision\nI would recommend to reject this submission. \n\n(1) The target task is neither practically useful nor technically interesting.\nThe target task is to learn class-agnostic object segmentation, and is a reduced version of ordinary weakly supervised semantic segmentation whose goal is to predict class-wise segmentation masks. Thus, the target task seems too restricted, not practically useful, and not interesting technically.\n\n(2) The experimental evaluation is not sufficient due to the following reasons. \n- All previous methods listed in the table are out-of-dated. Also, many important and closely related models (e.g., adversarial erasing, Grad-CAM, and many others drawing class attentions) are not compared with the proposed one. \n- The comparisons do not look fair enough since the experimental setting is favorable to the proposed method. The goal of the experiments is aligned with that of the proposed model, i.e., predicting only binary object masks in a class-agnostic manner, while most previous models in the table generate class-wise segmentation masks. More importantly, the datasets used for evaluation are not common benchmarks in weakly supervised segmentation, and the proposed model may not work on the public benchmarks like PASCAL VOC and MS-COCO since they in general have no restriction on the number of classes and instances appearing in an image. \n\n(3) The writing quality of this paper is far below the standard of ICLR.\n- The task \"point-wise localization\" is not clearly defined in the paper, and its name sounds quite confusing as it is also not clearly described in the paper what is the \"point\".\n- The recursive erasing algorithm given in an appendix must be introduced in the main manuscript since the authors claim that it is one of the most important contributions of the paper.\n- It is not clearly described what is the main difference between the proposed recursive erasing algorithm and the closely relevant approaches.\n- Overall, the manuscript is badly organized with paragraphs often too long, awkward sentences, grammatical errors, typos, and so on.\n\n"}