{"title": "Adversarial reconstruction loss is an interesting idea, but the paper need more polishing", "review": "==============Updated=====================\nThe authors addressed some of my concern, and I appreciated that they added more experiments to support their argument.\nAlthough I still have the some consideration as R3, I will raise the rating to 6.\n\n===========================================\n\nThis paper is easy to follow. Here are some questions:\n\n1. The argument about ALI and ALICE in the second paragraph of the introduction, “… by introducing a reconstruction loss in the form of a discriminator which classifies pairs (x, x) and (x, G(E(x)))”, however, in ALI and ALICE, they use one discriminator to classify pairs (z, x) and (z, G(z)). Therefore, “… the discriminator tends to detect the fake pair (x, G(E(x))) just by checking the identity of x and G(E(x)) which leads to vanishing gradients” is problematic. Therefore, the motivation in the introduction may be some modification.\n\n2. The authors failed to compare their model with SVAE [1] and MINE [2], which are improved versions of ALICE. And we also have other ways to match the distribution such as Triple-GAN [3] and Triangle-GAN [4], I think the authors need to run some comparison experiments.\n\n3. The authors should discuss more about the augment mapping a(x), i.e., how to choose a(x). I think this is quite important for this paper. At least some empirical results and analysis, for example, how inception score / FID score changes when using different choices of a(x).\n\n4. This paper claims that the proposed method can make the training more robust, but there is no such experiment results to support the argument.\n\n[1] chen et al. Symmetric variational autoencoder and connections to adversarial learning, AISTATS 2018.\n[2] Belghazi et al, Mutual Information Neural Estimation, ICML 2018.\n[3] Li et al. Triple Generative Adversarial Nets, NIPS 2017.\n[4] Gan et al. Triangle generative adversarial networks, NIPS 2017.", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}