{"title": "Interesting paper! Please address the concerns listed below.", "review": "Paper summary:\nThis paper studies the problem of point cloud generation using deep autoregressive models. More specifically, it proposed a novel architecture called PointGrow network that is able to iteratively generate 3D point cloud unconditionally or conditioned on semantic context (e.g., 2D image, class label, or partial 3D point cloud). Key design is a context-aware operation that aggregates all the previously generated points dynamically by fetching and averaging. For experimental evaluations, this paper used a subset of ShapeNet (objects from 7 categories), ModelNet40 and PASCAL 3D+ dataset. \n\n==\nNovelty & Significance:\nThis is a very interesting paper that applies the pixelCNN (Oord et al. 2016) framework to 3D point cloud generation. Despite the high-quality generation results shown in the paper, reviewer feels the novelty of this paper is quite limited: (1) The iterative generation has been explored to some extent in image domain; (2) Similar self-attention operators have been proposed before on point cloud recognition and generation (e.g., Qi et al 2017, Wang et al 2018).\n\n==\nQuality & Presentation:\nOverall, this paper provides solid comparisons with previous work in terms of generation quality and representation power. However, reviewers have a few concerns in terms of experimental design.\n\nQ1: For the unconditional version, please comment on the performance when training the proposed PointGrow network on all categories. Does it work or not?\n\nQ2: In Figure 3, the visualization of self-attention field looks a bit noisy. For example, most of the activated context points are not very relevant to the point on the table (on 3rd row, 7th column of Figure 3). Please clarify this in the rebuttal.\n\nQ3: In Table 1 and Table 2, it makes more sense to provide information  such as model complexity as well. \n\nQ4: For unsupervised feature learning, the results will be much more convincing if the proposed model is also trained on 55 categories. It is an important ablation study.\n\nQ5: The shape completion experiment is a bit artificial. As the points are generated by some pre-defined order, the PointGrow framework may not be able to perform shape completion task in general (e.g., to complete the shape given two wings of an airplane).\n\nQ6: For image condition interpolation (see Figure 9), reviewer would like to know the performance with other categories. Please comment on the performance in the rebuttal.\n\n", "rating": "6: Marginally above acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}