{"title": "Does not read well, no clear motivation", "review": "This paper proposes an anomaly detection system by proposing the combination of multiple-hypotheses approach with variational autoencoders, and using a discriminator to prevent either head of the model to produce modes that are not part of the data.\n\nThe combination between multiple-hypotheses approach with variational autoencoders seems rather artificial to me. Why do we need to parameterized a fixed set of hypothesis if we can generate as many outputs as we want just by sample several times from the prior of the VAE? Maybe I am missing something, which brings me to the following point.\n\nThe paper is difficult to read: the motivation is not well explained, the link between anomaly detection and multiple-hypothesis methods (both in the title of the paper) is not clear. The approach seems to build on top of Breunig et al. (2000), unfortunately this paper is not well described, e.g. what does it mean global neighborhood?\nThere are many other sentences in the paper that I find difficult to understand, for example:\n\"Lfake itself consists of assessment for noise- (xˆz∼N(0,1)) and data-conditioned (xˆz∼N(µz|x,Σz|x)) hypotheses and the best guess given by the WTA objective.\"\n\nOn top of that there are many other elements in the paper hampering the comprehension of the reader. For example:\nWTA is used without being defined before (winner takes all)\none-to-mapping --> one-to-one mapping?\nL_[Hyps] is the same as L_[WTA]?\nMDN is not defined until Sec. 5, and doing so without giving any description about it.\nTable 3 is never referred to.\nIs Table 5 reporting results on the Metal anomaly dataset? If so please mention it in the caption.\n\nIn the experiments it is difficult to see which parts of the models make the main difference. For example, it would be interesting to have an ablation experiment assessing the importance of the discriminator.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}