{"rating": "6: Weak Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "This work presents a method to use active learning to control the labeling process to gather training data in the context of a semantic segmentation application. In particular, authors define actions, states and rewards, and slightly modify DQN, to learn a policy to select informative image regions to obtain pixel labels. The proposed strategy contains several novelties related to the model and the application domain. Furthermore, the paper is clear and well written. \n\nOne weak part of the proposed method is the predefined split of each image into 24 regions that are used to define the population of sampling candidates. I believe that, for the case of semantic segmentation, the arbitrary definition of the boundary of each region might degrade performance. This because for this application the real object boundary is highly informative. Actually, this could be a major reason to explain that the proposed method only presents a modest boost in performance with respect to baselines, which is clear only for the under-represented categories. \n\nA point that it is not clear to me is the initial training of the segmentation network. Also, it is not clear how is the process to train the segmentation network after the inclusion of each new batch of labeled data (do the segmentation network is trained incrementally with just the new data?). Finally, I believe it will be good to include information about the computational complexity of resulting model.\n\nIn summary, the idea of using AL and RL to control the labeling process in a semantic segmentation application is interesting and particularly relevant for this application. While the proposed method has some weaknesses, it is novel and it will be of interest to people interested in semantic segmentation. I rate the paper as weak accept."}