{"title": "Simple and elegant CNN adversarial attack. Some typos", "review": "*Summary:* The present paper propose a new way of overcoming state of the art defences against adversarial attacks on CNN. This is done efficiently by noticing that many defences agains adversarial attacks have a an attention shift, and exploiting it efficiently via CNN invariance to translations. The authors shows that the proposed method can fool many state of the art defences.\n\n*Clarity:* The paper is well written and easy to follow. To the best of my knowledge the maths are correct. However the shift mechanism is still not clearly understood. See answer to R1.\n\n*Originality and Significance:*  to the best of my knowledge the proposed method is new and the paper looks complete enough to be fully reproducible. The experiments show that on a wide selection of dataset, many state of the art method are significantly sensitive to the proposed attack. If the paper is accepted ot would be really nice to provide a link to the code used. As the experiments showed that the proposed attacks fools many state of the art defences  and the method is new I believe this paper has a good significance/impact.\n\n*Questions:*\n   - Have you tried to fool the defences with other invariants that CNN are also known to be invariant too? eg rotations or diffeomorphism? Would it be possible to obtain the same computational 'trick' as in eq 9?\n   - I would see the continuous version of the method as integrating over all the possible translation T_{uv} over a measure mu(u, v) (instead of T_{ij}, w_{ij}) is that correct?\n   - Have you tried something else than the gaussian kernel for the convolution? Do you have a proof / explaination / experimental evidence that other kernels such as a uniform / laplacian are less performant than a Gaussian kernel? (point 1) page 5 is convincing but point 2) is irrelevant in my opinion).\n   - Could you propose new defences agains your attack?\n\nTypos:\nsome references (eg p 3) are broken (ie ??)\n", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}