{"experience_assessment": "I have published in this field for several years.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "EEG-based brain-computer interfaces is a difficult task, as the signal is noisy, vary from subject to subject and classical machine learning techniques are still deficient for certain subjects.\nThe authors propose a DWT-based deep net, where convolutional layers are applied on a wavelet decomposition of the signal.\nTo avoid the curse of dimensionality, only half of the wavelet coefficient are used to train the convnet.\nA higher dropout is applied to avoid overfit.\nThe proposed net is evaluated on a dataset and different wavelet transforms are assessed. \n\nThis contribution is not convincing enough. The idea to use DWT is interesting but not new and the results are only tested on one small dataset.\nThe proposed approach should be applied on different types of BCI task (P300, error potentials, etc), as it is the case in Lawhern et al. (2018) or at least on several datasets of motor imagery, see [1] for example of available datasets.\nThe results should be compared to state-of-the-art techniques, that is tangent space classification using Riemannian geometry, see [2]. Comparing the results with FBCSP is not enough.\n\nTo improve this contribution, the authors could make the following modifications.\nThe experimental protocol section is not really relevant, as it is already described in the literature and the authors use the data in a common way. The last paragraph of this section is interesting, the rest could be dropped.\nThe Proposed method section could include a figure to show the sequence of preprocessing applied to signal and the shape of the deep net.\nThe results part is a bit hard to read as it just a description of the table. A figure with star indicating significant statistical difference could help to ease the reading.\n\n[1] Jayaram, V., & Barachant, A. (2018). MOABB: trustworthy algorithm benchmarking for BCIs. Journal of neural engineering, 15(6), 066011.\n[2] Lotte, F., Bougrain, L., Cichocki, A., Clerc, M., Congedo, M., Rakotomamonjy, A., & Yger, F. (2018). A review of classification algorithms for EEG-based brain–computer interfaces: a 10 year update. Journal of neural engineering, 15(3), 031005.\n\np1: (the decease) -> decrease\n"}