{"title": "Benefit for volumetric data not clear", "review": "The work concerns convolution in the unit sphere. It differentiates itself from previously mentioned work by working in the volume space and not the surface space. While I can't say I understand all of the implications of the work,  I was left with several questions. Many of these questions are in regards to claims made by the authors whose answer or reference was not made clear.\n\n- It was not made clear why there is a benefit to convolving the object in the unit sphere vs the unit cube, especially given that the work was not able to perform better than other work that was based on the unit sphere. This point was the stated problem of the paper. Although it was mentioned that the unit sphere preserves all of the points of the object, it isn't clear if the transformation causes any deformations of the object. Furthermore, the fixing of one axis seems to be a way to hack around problems of increased dimensionality, but there was no justification given.\n\n- How does the number of trainable layers help to differentiate resource usage. Wouldn't a better measure be number of parameters? The authors make that claim that shallowness is a virtue, but there is little discussion as to the size of each layer in comparable terms.\n\n- Why was no \"ablation\" or \"accuracy vs trained layers\" data shown for the Modelnet40 dataset? I would think that would be stronger evidence than for the Modelnet10 data.\n\n- Why wasn't the 1d conv net used for creating the viewing angles included in the size of the architecture? Was there a verification as to what the filters from this network were actually giving? The authors mention how we should interpret them, but not enough information about the structure of the network is given to satisfy this question.\n\n- I would have liked to see a description of the types of features that are found by these networks.\n\n- The authors say they are only going to show experiments on one possible use case, but then make claims for other use cases. I am referencing that since the texture data in the datasets used is constant, there was no need to model the texture data. There is no experimental evidence to show this is the case, however.\n\nOverall, I think the paper would have been stronger if it had more experiments.", "rating": "6: Marginally above acceptance threshold", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}