{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper proposes a high-order weighted variant of GCN. The key idea is to learn an adjacency weight matrix which obeys the topological constraints (e.g., if there exists k-length shortest path between any pair of nodes, then the corresponding entry of power-k weight matrix could have a non-negative value) from a lasso-type reconstruction loss. Experiments on 3 small citation networks are reported.\n\nOverall, I have a few concerns as below on the model and the experiment which prevent me from accepting the paper.\n\nPros:\n\n1, The topic of the paper, i.e., incorporating high-order information, is very important for learning better graph representations with GNNs.\n\n2, The paper is clearly written.\n\nCons:\n\n1, My main concern is on the objective of the proposed adjacency weight learning. It is not clear to me why the unsupervised reconstruction type of objective would produce weight matrix W that helps the downstream supervised tasks? Or more concretely, why W obtained by solving (8) would be useful for learning better representation for node classification? Moreover, there are many other ways which enable the model to directly learn weights on the graph, e.g., learnable spectral filters which take eigenvalues as input, learnable message functions in GNN, attention weights in GAT. All the learnable parts in above competitors are well aligned with the supervised learning objective. What do you think makes the proposed model superior to these competitors?\n\n2, I have another concern on the efficiency of the proposed method. An optimization needs to be done during inference which is problematic for moderately large graphs. It would be great to report the run-time of the proposed method.\n\n3, Experimental results are less convincing. (1) Only results on three small citation networks are reported. I suggest authors to try larger datasets to fully verify the effectiveness of the proposed model, e.g., reddit, PPI, quantum chemistry, etc. (2) It would be great to also report the standard deviation in Table 4.\n"}