{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper presents a novel architecture for extracting features for periodic signals that is sample efficient and has superior performance than previous approaches. The proposed method is based on a graph architecture that takes into account the ordering of the vertices, contrary to standard GNNs. In order to extract periodic signals, they prove that if two data points are phased shifted, then there exists a subgraph for each data point such that one is a cyclic permutation of the other. To that end, the authors present an architecture that is cyclic permutation invariant through a pooling operation on all the cycles. The proposed method is evaluated on simulated and real data.\n\nThe paper is well written and well motivated. The authors however ignore most of previous related work, there is a huge bulk of work on graph neural networks and on modelling time-series. It is important and interesting that the authors compare how the presented architecture differs from previous work.\n\nRegarding the method, the entire approach is based on two assumptions: 1) the data points are phase shifted with a period that is a multiple of T, and 2) that you know that windows size and slide size such that makes one graph a cyclic permutation of the other. How often does (1) happen in practice? How sensitive it is to the failure of such assumptions? \n\nThe results section is the weakest part of this paper. The comparison between other approaches not presented by this method is essentially just the MLP, which is the most naive baseline. The author should compare to 1Dconvs, RNNs, MLPs with fourier features, and state-of-the-art approaches tackling time-series and/or periodic signals. As I mentioned previously, it would also be important to analyze the sensitivity of the method with respect to the assumptions build upon.\n\nAt this stage, I do not think that the paper is ready for acceptance."}