{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The goal of this work is to explore multi-sensor data modelling, with a focus on anomaly detection in machinery containing rotating shafts. Multi-sensor recordings from machinery can be phase-shifted, due to errors in the relative timing of sensors. The authors develop a method for modelling such phase-shift data. They augment phase-shift data with a graph structure which represents the relationship between sensors and they use a graph neural network with a cyclic permutation structure to enforce phase-shift invariance. Model performance is evaluated with real-world data from machinery containing a rotating shaft. Their model may be useful for other domains with phase-shifted data, such as multi-sensor medical data.\n\nAlthough this is an interesting application domain and model, I have selected weak reject. \n\nThe primary reason for this decision is that the authors do not provide sufficient comparisons to related work and models, either in the form of a literature review, or in the form of model benchmarking. This is especially problematic for a domain which will be unfamiliar to much of the machine learning community.\n\nNone of the six references in the paper address anomaly detection for temporal data (e.g. Ahrens et al. “A machine-learning phase classification scheme for anomaly detection in signals with periodic characteristics” 2019) or the extensive related literature of time series models (e.g Pope et al. Learning phase-invariant dictionaries 2013, Edwards and Lee, Using Convolutional Neural Networks to Extract Shift-Invariant Features from Unlabeled Data”, 2019), or more closely related work on shift invariant graph neural networks (e.g. Gama et al, Convolutional neural network architectures for signals supported on graphs, 2018). \n\nTo address this, I feel that the authors need to provide a related work discussion. I would also like to see some experiments comparing their model to benchmark models that have a greater chance of being competitive such as a variant of models introduced by Pope et al. 2013 or Edwards and Lee 2019 for example.\n\nMinor note: there is a typo in the definition of v_i\n\nThank you for the submission.\n"}