{"title": "Interesting work but confusing presentation and some missing areas ", "review": "This paper explores the potential of generative models for adversarial robustness. It presents some interesting and well formulated findings but is lacking in some meaningful ways. \n\n-It does a good job of summarizing the literature though it misses out on some very recent but relevant work\n-It introduces three detection methods and extensively evaluates them  against several zero-knowledge attack types. Notably all the attack types are gradient based methods. \n-They present detailed performance metrics on the zero-knowledge attack, and introduce the perfect knowledge attack but do not present equivalently detailed results.\n-The results are  presented in a confusing manor, and the paper is perhaps done a disservice by the inclusion of a very large number of tables both in the main text and the appendix without the necessary writing required to situate the reader.  \n-The paper also briefly mentions the ongoing debate around \"off-manifold\" conjecture, only to them assume its correctness and based the entire work on the premise. \n\n###Highlights \n*well written introduction and a good overview of generative modeling \n*very good visualizations and explanation of the detection methods \n*thorough results on zero-knowledge gradient based attack detection rates  \n*interesting direction on adversarial examples  \n\n### Areas for improvement \n*more time should be spent on discussing the off manifold conjecture; the paper is based on the correctness of this conjecture though recent work has called its validity into question\n*only gradient based attacks are discussed though the paper title suggests robustness to all attacks\n*perfect-knowledge attacks should be explored in much more detail \n* the paper should streamline the results and findings, the large number of tables and results will confuse the reader and do not add to the argument\n*recent work on generative models for adversarial robustness should be discussed (https://arxiv.org/abs/1805.09190, https://arxiv.org/abs/1811.06969)  \n*the two class cifar10 results are not particularly convincing as this is a substantial simplification of the cifar10 problem \n* the results on the full cifar10 data set make use a the extracted features of a pre-trained discriminative cifar10 network, this introduces the problem at layer activation adversarial attacks, but this is not mentioned in the paper (https://arxiv.org/pdf/1511.05122.pdf)\n\nOverall i think the work shows promise but is not yet ready for acceptance \n\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}