{"title": "Potentially interesting, though large omissions make this difficult to follow", "review": "The paper uses a number of deep learning approaches to analyse sets of Traffic data. However, as these sets of traffic data are never explained it is difficult to follow or understand what is going on here.\n\nSome major comments:\n1) Many of the key concepts in the paper are not discussed. The primary one would be that of what the two data sets contain. Without knowledge of this it is difficult to ascertain what is going on. \n\n2) Many of the processes used are not described in enough detail to either understand what is going on or to re-produce the work. Without this it is difficult to make headway wit the work.\n\n3) It is not clearly articulated what the experiments performed are doing. For example, how have you applied the other techniques to this data?\n\n4) Key terms are not defined. Such as Traffic Flow.\n\n5) The English structure of the paper is poor with many mistakes. A thorough proof-reading is essential.\n\nSome more specific points:\n- \"with the larger road network, the difficulty of flow forecasting grows.\" - This seems to be a consequence of the other ones not a challenge in it's own right.\n\n- What is \"superiority\"?\n\n- \"Spatiotemporal traffic flow forecasting task is currently under a heated discussion and has attracted a large research population.\" - evidence to back up this statement.\n\n- Your contributions aren't contributions, but rather a list of what you have done.\n\n- How does your related work relate to what you have done?\n\n- Hard to parse \"To extract temporal relationships within the history traffic flows, we model this process as a layering structure with autoencoder as cell\"\n\n- Appendices B and C should be in the main paper.\n\n- What is in x^{(1)}?\n\n- \"When take the sparsity constrains into consideration\" - what are the sparsity constraints?\n\n- How do you obtain the weights?\n\n- Figure 2 should come much sooner as it relates a lot of the concepts together.\n\n- \"On both datasets, we slice traffic flow information into 15 minutes windows, where 70% of data is for training, 10% for validation and remaining 20% for testing.\" - Is that each 15 mins is split 70:10:20?\n\n- Proof by example is not a proof.\n", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}