{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper studies the problem of translating natural language questions into SQL queries to answer questions from databases. \n\nStrengths of the paper:\n1. The research problem is of great value in applications, as users may not have expertise on writing a good SQL queries. The proposed algorithm can help to parse the input arbitrary queries into SQL standard queries.\n2. The experiments were conducted on publicly available datasets, i.e., the Spider dataset that has been investigated in the previous work.\n\nWeaknesses of the paper:\n1. Many details of the equations and techniques are not clear. For instance, what do the notations $c_{i,0}^{fwd}$, $c_{i,0}^{rev}$ stand for in section 3.3?; what is $d_z$ and how to set $H$ in section 3.4? what does $\\alpha_{i,j}^{(h)}$ work for in section 3.4?\n2. The motivations of some techniques used in the paper are not clear. For instance, why do the authors apply BiLSTM but not other recurrent neural networks to obtain representations of the nodes in the graphs?  Are there other techniques to obtain embeddings of nodes in a network? There are a number of network embedding techniques having been proposed, for instance:\n(a) A. Grover et al., Node2vec: scalable feature learning for networks, KDD 2016.\n(b) Z. Meng et al., Co-embedding attributed networks, WSDM 2019.\n3. The contributions of the paper seem not significant. The paper sounds like a technical report on the combination of some existing encoding and decoding techniques to the task, although the task is interesting. In terms of technical contributions, the authors are encouraged to state them explicitly and more clear.\n4. Is the code of the proposed model publicly available? \n\nIn sum, the task of the research is very interesting. But at the current version, the paper needs to be revised to make all the notations and techniques be more clear, and the contributions of the paper seems marginal.\n"}