{"title": "Failed to motivate the significance and poor experimental baselines.", "review": "Summary:\n\nThis paper presents a neural network based tree model for the regression via classification problem. The paper is easy to follow but it failed to give motivations for the significance of this work.  I do not understand why regression via classification is any useful and what value it brings to the well studied regression problem with many different function approximators. The paper neither explain why regression via classification is any useful nor does it motivates the need for the presented model. The presented experiments are also not thorough, there are stronger and simpler baselines for regression like random forests, gradient boosted trees  or kernel ridge regression which are not evaluated and compared. I think this work do not pass the acceptance bar at ICLR conference. \n\nComments:\n\n1. I was not aware of this age and height estimation tasks. i-vectors are the standard features for speaker recognition.  Can the authors please elaborate in a  line or two why i-vectors would be suitable for age and height estimation?.\n\n2. The regressor function r() simply gives out the mean value of the bin. The authors could have provided on details on why this choice ? and how it affects MAE ?\n\n3. Each node in the NRT is successively being trained on a lesser amount of data. why do all the node-specific neural networks need the same parameter size then ?\n\n4. In Conclusion the authors say,  \"In addition, we proposed a scan method and a gradient method to optimize the tree.\" The authors do not very clearly mention these two methods in the text, neither are the results demonstrated in that way.\n\nMiscellaneous comments:\n\n1. This line seems incomplete in Section 1: \"Traditional methods for defining the partition T by prior knowledge, such as equally probable intervals, equal width intervals, k-means clustering, etc. [4, 5, 3].\" \n\n2. The notations used inside the nodes in Figure 1 has not been defined in the paper. \n\n3. Figure 2 and 3 axes don't have labels. Figure 3 caption says age, but it is for heights.\n\n4.  In Section 4.4: Figure 4.4 should be Figure 4 and at one point \"This is visible in 4.4\" should be \"This is visible in Figure 4\"", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}