{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper proposes a differentially private estimation of survival function via the Kaplan-Meier (KM) estimator. The paper further extends their results to the estimation of confidence intervals and test statistics as well as scenarios with competing risks. Differential privacy is an important aspect when dealing with sensitive data such as data generated in healthcare and clinical settings. The authors seek to provide a differentially private procedure in the setting of survival analysis.\n\nOverall, the reviewer finds that the authors ineffectively deliver the promise of the paper in various aspects, ranging from theories to experiments, and to the clarity of the paper. The paper, in its current form, is too preliminary to publish. Specific comments follow. \n\n1. equation (1) the notation is not explained at all. \n2. While the definition of the KM estimator is given in equation (2), no explanation is provided regarding how the estimator corresponds to an estimation of the survival function.  The authors may consider providing a running example for a better explanation with a visualization of the resultant step function.\n3. Despite being the key definition of the paper,  definition 1 of differential privacy is not clearly stated. Some symbols in the definition remained unexplained.  e.g. what is $\\mathcal{X}$. What is the  \"Range()\" of a randomized algorithm $\\mathcal{M}$? The concept of differential privacy also requires further intuition and explanation. Such as why smaller $\\epsilon$ corresponds to stronger privacy guarantees. What does privacy guarantees itself mean? \n4. In section 3, the term of privacy budget is also mentioned but not explained.\n5. Page 5, Algorithm 6 is referenced but nowhere to find.\n6. In the experiments, the authors choose $\\epsilon=2$ and $\\epsilon=1$. However,  it is unclear why these parameters are chosen. It is also unclear what these choice imply in terms of the privacy that can be preserved in practice, and whether such preservation suffices."}