{"experience_assessment": "I have published in this field for several years.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposed to address a compound problem where missing data and distribution shift are both at play.  The paper goes on to describe some heuristic methods that resemble the gradient reversal methods due to Ganin et al for handling both problems. \n\nThe novel part of the paper over DANNs is the joint, end-to-end training of latent representations for missing data,  While it is sloppy with terminology, the paper is overall reasonably easy to follow although it might mislea a novice reader and sufficient details are provided to replicate their results.  \n\nThe major problem here is the problem appears to be underspecified, and its not clear under what conditions if any the proposed methods are valid. Moreover it’s not clear to what extent the experimental results should ameliorate these concerns. \n\nIf the data is not missing at random then there is presumably confounding. The authors dance around this topic, just asserting that they are handling non-stochastic missing data but do not say precisely what is assumed about the relationship between the observed and missing data. \n\nIn short the paper addresses an under-specified problem with a heuristic technique based upon domain-adversarial nets which have recently been shown have a number of fundamental flaws. It's never made clear under what assumptions this proposed procedure is valid and the paper misrepresents the prior work on lable shift, including the theoretically sound work, e.g.:\n\n\"we assume covariate shift as in most UDA papers e.g. Ben-David et al. (2010); Ganin & Lempitsky (2015).”\n>>>  Ben-David 2010 is not about covariate shift ….\n\nSome minor thoughts:\n\n“some components of the target data are systematically absent”\n>>> \tNot clear what “component” means at this point\n\n“We propose a way to impute non-stochastic missing data”\n>>> \tWhat does this mean? Is non-stochastic, not missing at random? What is the pattern of missing-ness conditioned on? What assumption, if any, is made? \n\n“This key property allows us to handle non-stochastic missing data,” \n>>> \tagain what precisely does this mean?\n\n“Consider that x has two components (x_1, x_2)…”\n>>>\tsloppy  notation:\n\t“Source features” x_s = (x_S1, x_S2) are always available \n\n\n\n\n"}