{"experience_assessment": "I have read many papers in this area.", "rating": "8: Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "## Summary\n\nThe authors propose a method for training physical systems whose behavior is governed by partial differential equations. They consider situations where only partial observations available, and where control is indirect.\n\nIndirectly controlling physical systems is a very important problem with applications throughout engineering. In fact, much of the field of robotics can be described in these terms. The authors employ a number of interesting methods, including a predictor-corrector framework and the adjoint sensitivity method for differentiating through differential equation solvers.\n\nThe paper is generally very clear, organized and well written. There are only a few places where I think clarification is needed (see detailed comments below). I also have a few questions about the losses and training procedure. On the whole, I think the paper is inventive, well-written and potentially very impactful. I think it would be a great addition to ICLR.\n\n\n## Clarifications\n\n* Page 4: I found the statement \"an agent trained in supervised fashion will then learn to average over the modes instead of picking one of them\" a little confusing. Could you clarify the reasoning here?\n* Page 5: I think the description of predictor-corrector could be clearer. In particular, I found the phrase \"the correction uses o(t + ∆t) to obtain o(t + ∆t)\" unclear.\n* Page 8: Could you add a description of what is observable to the body of the paper (I see it is included in the supplement)?\n* Page 8: I think ∇p needs to be divided by density in your NS equation, right?\n* Page 8 - 9: Is there a limit on the size of the force that can be applied at any point? I know the total force is penalized, but what about the maximum force applied at any point?\n\n\n## Losses and Training\n\n* I think \"differentiable physics\" losses need a more detailed explanation in the body of the paper.\n* In the supplement, it is defined using B_r, but I don't think B_r is defined.\n* It seems like the differential physics loss requires a differential solver (in this case, for Burger/Navier-Stokes). If I have understood this correctly, I think this needs to be discussed in the body of the paper. In particular, it would be nice to discuss what happens when the physics is a black box (i.e. we can interact with the system by applying control and observing, but we don't know the rules governing the physical system). Is this exactly when we are restricted to the \"supervised\" loss? Is there some middle ground? What if we had black box access to the exact physics, along with an approximate differentiable solver? This seems like a realistic scenario for e.g. large fluid flow scenarios."}