{"title": "Interesting approach and seems to have adequate convincing experiments ", "review": "Summary:\n      The paper tries to predict the quality of output of a segmentation algorithm applied to medical images. The approach of this paper is to looks at the \"true\" shape of the segmentation on the training samples and learn a VAE for the shape feature on them  for training samples.  For the test samples (that are new and are segmented only the algorithm whose quality is to be predicted), a linear function of the loss function of the learnt VAE applied to the output for the segmentation is used to predict quality. The linear function is tuned to the VAE loss of the output of the specific segmentation algorithm on the training samples.\n\n The basic premise is that VAE minimizes the gap between between the log likelihood of the true shape and the VAE loss function. Therefore, the gap should be small for \"good\" shapes while very bad for \"bad/wrong\" shapes. Therefore the VAE loss trained on the good shapes on the training examples can indicate the goodness of a segmentation algorithm's output.\n\nPros:\n  I think the authors have compared to the number of baselines on three medical imaging datasets and show that their method via various metrics clearly outperforms others on this specific medical imaging application.\n\nI like the primary technical idea behind the paper of detecting low quality outputs by projecting to the range space of a VAE and looking at its likelihood.\n\nCons:\n1)  I dont know about the apriori assumption that shape of the segmentation will be the right feature to actually focus on. How general is this assumption for medical imaging tasks ?\n\n2) Authors say - \"Variational autoencoder(VAE) (Kingma & Welling, 2013), compared with AE, has stronger representation capability\" - Why does the VAE have stronger representation capability?  - I dont understand this part.  Is it because it outputs the probabilities z given Y and Y given z that is somehow more useful ?\n\n3) Can GANs be used instead of VAEs? Is there a natural loss function that could be used in this case during quality prediction?\n\n\nDisclaimer: I am not an expert in the area for segmentation of medical images.\n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}