{"title": "I consider the proposed method interesting, although it is somewhat incremental. There are some conceptual issues with the proposed approach as well as missing related work. Motivation could be improved. The empirical evaluation is strong. ", "review": "Summary:\n\nThe paper presents a session-based recommendation approach by focusing on user purchases instead of clicks. The method is inspired from concepts of cognitive science which adds an imagination reconstruction network to an actor-critic RL framework in order to encourage exploration.\n\n\nComments:\n\nThe proposed architecture is an interesting inspiration from Neuroscience which fits into the sequential recommendation problem. However, the motivation of using RL is missing from the technical contribution. Considering a deterministic policy, using LSTMs which already encode sequentiality of states in addition to another component for planning, seem to undermine the role of RL. \n\nThe motivation of creating imagined trajectories instead of actual user trajectories is unclear. On the other hand, there are many traditional planning approaches which are not mentioned such as Monte Carlo Tree Search that simultaneously trade-off exploration and exploitation. \n\nThe literature review is incomplete and misses important contributions on session-based recommendation, particularly, MDP-based methods such as Shani et al., An MDP-based recommender system, 2005 and Tavakol and Brefeld, Factored MDPs for Detecting Topics of User Sessions, 2014 (also see references therein).\n\nEmpirically, the authors compare their method to several recent baselines. This renders the empirical part exceptionally strong. Nevertheless, the length of the trajectories is only 2 and instead should be varied empirically to show the usefulness of the reconstruction network. \n\n\nQuestions:\n\n-How are cold-start situations encountered if items are one-hot encoded?\n-Why is there a strong focus on quick adaptation to user sessions? Usually, users tend to search quite a lot before converging; hence, longer sessions possibly better reflect user interests.\n\n\nMinor:\n\n-Proofreading is necessary\n-Table 1 and 2 would be more readable if they were figures\n-Figure 3 seems to be taken from Tensorflow runtime convergence plots, which could be dropped given the limited space", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}