{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "Authors consider the attacks where there is 1 edit in the middle characters of words. They propose a mapping strategy for the most frequent words. The point of the mapping is to map all adversarial versions of a word to be mapped to the same word. In essence the mapper is a typo corrector. They design the mapper by first connecting all the words that have a common edit 1 typo. In the basic version they map all the words in a  connected components to the most frequent word of that component. In the more advanced version they define a criteria based on the distance of a words embedding from its mapped words embedding and greedily merge clusters. Using this preprocessing technique drops the accuracy of the model by 10-20%. But the model is almost 100% robust. In the face of an attack the accuracy does not drop more than 5%. Whereas other methods suffer much higher drops in the face of an attack.\n\nI vote for rejecting this method since 10-20% drop in the accuracy is only acceptable if a system is under constant attack and all the sentences are adversarially perturbed.\n\nOne downside of their method is that their mapper maps each word individually and context independent. There is no reason to have a constant word mapper. A context dependent mapper can identify whether in this sentence “aboupt” is a typo of “about” or “abrupt” since their use cases and part of speeches are quite different. If one augments the words with their part of speech at the very least one can still have stable mappings. There would be no need for such high sacrifices in the fidelity."}