{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "This submission presents a simple proof for depth separation in deep neural networks. The authors claim their proof is simple, and can be easily followed by newcomers. The motivation of the paper is clear. \n\nI give an initial rating of weak reject is because: (1) the notations in this submission are inconsistent and confusing; (2) the contribution seems marginal compared to previous literature. I will illustrate more as below.\n\n1. The authors claim that their problem construction and lemma 3 are novel. However, I found similar formulation in Theorem 5.4 of \"Tropical Geometry of Deep Neural Networks\", ICML 2018.  Can authors clarify the difference and your contributions? \n\n2. Most of the proof follow reference \"On the expressive power of deep neural networks.\" ICML 2017, especially lemma 4. Basically, lemma 4 is a 2d simplification of the results in that reference. \n\n3. Notations are inconsistent. For example, authors use \"d\" as the number of hidden layers in introduction, and then use \"L\" as number of layers later. Actually I think \"m\" also has the meaning of number of layers because authors always refer to \"m\" as network depth. \n\n4. For equation 1 in section 3.2, what is the execution order of this equation? It seems from right to left. However, if we see the last equation in section 4.3, the execution order seems from left to right. This is inconsistent, correct me if I'm wrong.\n\nMinor:\nI only see Lemma 2,3 and 4. Where is Lemma 1? \n\nIn conclusion, if this submission focuses on simple proof and easy understanding, the notations should be kept consistent and use as few characters as needed. The writing needs improvement. "}