{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper tries to improve the limitations of previous variational bounds for mutual information estimation, where it uses generalized functions from nonextensive statistical mechanics to get generalized better bounds for the logarithm and the exponential in the partition function. Experiments on simple synthetic data are performed to show the effectiveness, but these experiments are too simple, more thorough experiments on real data sets should be conducted.\n\nThere are some confusions in the writing.\n\nIn Equation (4), the last term is a Monte Carlo sample average by K samples to approximate the partition function Z, so approximate symbol should be used for last term instead of = symbol. Similarly in Equation (5), the last inequality is not really an inequality since this is a Monte Carlo sample average by K samples to approximate the terms in  the previous inequality. This is also true for equation  or inequality of (6), (18)-(20). In fact this is a problem that appears in Poor and Oord's papers. \n\nOn page 2, second line K is the batch size, then the first line after equation (4), K is the number of samples. Please make it consistent. \n\nOn page 3, the first and second paragraph, it is stated \"I_{NWJ} estimator performs well in high dimensional high dependence scenarios but exhibits high variance due to the exponential function in the partition function which amplifies the critic errors. One way to reduce the variance is to make the critic depend on multiple samples and use a Monte Carlo estimator for the partition function.\" Please explain why I_{NWJ} estimator exhibits high variance, is it observed by experiments, or it's been proved mathematically? Similarly why making the critic depend on multiple samples and use a Monte Carlo estimator for the partition function can reduce the variance. I see these kind of statements often appear on papers, I know Poore's paper provide experimental evidence of the validness, but I don't see any mathematical proof.\n\nThe way to cite the references is not right, for example, McAllester & Statos (2018), the correct one is (McAllester & Statos 2018)."}