{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper proposes a model for point processes using normalizing flows. The conditional distributions of next inter-arrival times are modeled as normalizing flows with base distributions conditioned on the history. Continuous-time flow based on neural ODE was employed. \n\nOverall I find this paper incremental. There have been several works using deep generative models to temporal data, and the proposed method is a simple combination of well-established existing works without problem-specific adaptation. \n\nI don’t get the point of using VAE in the likelihood estimation. The model (PPF-D) already defines a flexible conditional distribution. The only reason I can imagine to introduce VAE type model is when the dimension of the latent variables (which should be strictly the same as the observed variable) is too large to model directly. In such case one may choose to optimize a lower bound computed from the variational distribution defined over the lower-dimensional latent spaces. Hence in case of temporal point processes where the dimension is one, I see no point of doing VAE. The authors stated that VAE based model (PPF-P) performs better than ordinary flow model (PPF-D) because PPF-P has more flexible base distribution. My guess is that PPF-P has one more stochastic layer so the architecture itself is more expressive than PPF-D. PPF-D with more complex structure (e.g., more layers in base distribution parameter network) may result in a similar performance.\n\nThe authors stated in coclusion section that “The proposed PPF can be optimized by maximizing the exact likelihood”, which is not true for PPF-P optimizing the lower bound. "}