{"title": "The paper is concerned with a special case of deep learning (binary classification subject to strong assumptions) and tries to establish a mixed bag of results related to what is called \"learning dynamics\" of deep learning. ", "review": "The underlying motivation for the paper is really interesting and cuts straight to the heart of Deep Learning and strives to unravel the key understanding that we are still to a large extent missing.\n\nWhen it comes to clarity and organization I find the paper a bit \"messy\" in that it is a collection of quite a few findings on the very specific topic of binary classification with quite strong assumptions. Especially given the very specific nature of the topic I miss a strong and clear path through the paper. Unfortunately the paper leaves me with the distinct feeling that there are still a lot of work needed to be able to tell the story about the problem under study. Having said that the paper does contain several individual findings. Having said that I find the ideas leading up to what the authors refers to as \"gradient starvation\" to be really interesting and that would be a great clear idea to focus on.\n\nA few concrete questions/comments:\nCan you explain somewhere exactly what you mean when you say \"learning dynamics of deep learning\"? Given the specific nature of the results presented in the paper it would be nice to be precise also when it comes to the overall topic under study.\n\nGiven the very specific nature of the topic treated in the paper I find the title of the paper largely misleading. The title claims way more than what is actually delivered in the paper, despite the fact that the authors have put in an \"On\" in the beginning of the title.\n\nIn Corollary 3.3. you characterize the convergence speed in a nice way, but I am missing the link to the behaviors observed empirically in e.g. Fig. 2. What am I missing?\n\nThe final sentence in Section 2 is highly speculative and I find this hard to believe without solid backing. The sentence reads \"... and helps develop intuitions about behaviors observed in more general settings.\" Given the restrictive nature of your set-up I find it very hard to believe that this extends to more general settings.\n\nTiny detail: The axes of several of the plots given in the paper mis the lables which makes it hard to read. Straightforward to fix, but worth mentioning nevertheless.", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}