{"title": "Missing comparisons to permutation equivariant DeepSets", "review": "This paper looks at stacking attention mechanism for learning over sets.\n\nI think that the paper is well written overall. The architecture put forth is a fairly straightforward implementation of attention. Thus the methodological contribution is incremental. Still, it is nice to see some implementation of an attention model be considered for permutation invariant set embeddings.\n\nHowever, there are some core misrepresentations and omissions that make publication difficult. The main problem is that the paper completely ignores the permutation equivariant mappings discussed in DeepSets (Zaheer 2017). See (4) and (23) of https://arxiv.org/pdf/1703.06114.pdf: \"Since composition of permutation equivariant functions is also permutation equivariant, we can build deep models by stacking layers.\"\nIn practice this is often done by mapping points x_i in a set as x_i -> \\phi(x_i) - max_j \\phi(x_j). Stacking this layer works surprisingly well, typically better than just with a single pool. Thus, the permutation equivalent mappings of Zaheer 2017, which do have higher-order interactions and are linear in the number of points, are a glaring omission of table 1 and all of the experiments. Furthermore, the omission leads to a misrepresentation of the work.\n\nAnother unfortunate omission is previous work that considers set and distribution data through kernels and other nonparametric methods such as: \nMuandet, Krikamol, et al. \"Learning from distributions via support measure machines.\" Advances in neural information processing systems. 2012.\nOliva, Junier, Barnabás Póczos, and Jeff Schneider. \"Distribution to distribution regression.\" International Conference on Machine Learning. 2013.\n\nIt is also odd that the paper compared to DeepSets on modelnet with 100 and 1000 points but not with 5000 points. Will there be code available?\n\nWithout a better description of and comparison to permutation equivariant mappings I would feel hesitant to recommend publication.\n\nedit:\nIn light of the revised experiments and inclusion of permutation equivariant deepset layers, I'm inclined to recommend publication. However, if I could nitpick further, I think it would be nice to make some edit (or addition) to Table 1 to include permutation equivariant deepsets. Moreover, it would be nice to have some additional description of permutation equivariant layers in Section 2.1.", "rating": "6: Marginally above acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}