{"title": "Interesting results, but the paper is not matured enough", "review": "The paper propose an end-to-end combination of spatial and temporal attention for videos. The method first extracts a vgg19 representation to any frame, reduced with spatial soft-attention.  The attended vectors are then fed to LSTM with a soft temporal attention.\n\nStrengths: \n\nThe problem of applying both temporal and spatial attention is important and challenging in general.\n\nThe reported numbers on HMDB51 and UCF101 are impressive, given the fact the authors only used rgb features. (Hope I haven't missed anything)\n\n\nWeaknesses:\n\nRecent datasets for action recognition, e.g., Moments in time, Charades, Youtube-8M etc, are missing. If the authors can show this model on any of these this will make their case stronger. I suspect the proposed model is limited to short-videos only,  keeping the spatial information means the features dimensions are increased by factor of 49. This is why Charades dataset can be very interesting to see, because the videos are longer. But also Moments in time, which is much larger.\n\nThe writeup should improve significantly: Grammar mistakes, typos e.g.,  donates/denotes, operations in equations (eq. 5,6), punctuation after equations. etc..\n\nEven though the model is basic, It was really hard to follow. For instance, I couldn’t follow the whole discussion about T classifications, and the voting. What exactly are we classify? Another example, eq5, \\beta_t is not an actual attention score, but the energy potential that we later use to calculate the attention in eq7.\n\nQualitative evaluation is barely there, one sample is not convincing enough, qualitative evaluation in vision-models should show many-many examples.  Fig 2,3. describe well-known techniques, I think it's better to add more examples instead.\n\nTo conclude:\nThis is important subject, but the paper is not matured enough. A better writeup, and evaluation on more recent dataset is necessary. ", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}