{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper proposes a new approach to data augmentation using GANs, called Parallel Adaptive Generative Data Augmentation (PAGDA), in which the following procedure is used:\n- (1) First, GANs are used to generate different batches of data points based on the starting training set, and then these batches are added back to the training set\n- (2) This is done using an ensemble of K GANs where each GAN is trained on K-1/K portion of the training set, and the resulting samples are sent to the training sets of the other K-1 GANs\n- (3) The generators are sampled from proportional to their (exponentially normalized) inception scores\n\nOverall, this paper unfortunately should be rejected due primarily to inadequate experimental evaluation.  Specifically, the paper proposes a new method (and a very complex and seemingly arbitrary one at that), in a space where there are many pre-existing approaches, and then neither (a) compares to any pre-existing baselines or approaches (other than the most trivial of manual data augmentation strategies), nor (b) experimentally justifies or explores any of the design choices in the extremely convoluted method design.  Therefore, there is no real way for the reader to render any conclusion about the merit of the proposed approach: how does it compare to many (seemingly similar) existing approaches?  Why were the various design decisions made, which ones are more or less important?  How well does it work?  No real way to answer these given the extremely minimal experimental section.\n\nAdditionally, there is relatively little detail in the main description of the method (e.g. how is the GAN trained on labeled data?  How exactly is the sampling done?).  Also, worth noting that \"Multi-task\" is used incorrectly in the experiments section."}