{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposes to improve the Capsule Networks by making three empirical modifications to them:\n1. Without using routing procedure from CapsNets\n2. Without using convolutional layers\n3. Using higher-rank tensors to save parameters\n\nWith these modifications, they achieve comparable performance with much fewer parameters. In the experiments, they also show some interesting insight on the initialization of CapsNets. Overall, this paper is well written, easy to understand. However, I have the following concerns:\n\n1. The P-CapsNet outperforms the original one. Which one of the three modification contributes the most to the improvement? A comprehensive ablation study should be done in this work.\n\n2. The P-CapsNets shows competitive without requiring the expensive routing procedure. However, the generalization ability is not the only way to evaluate capsule networks. It is not clear whether other properties of CapsNets are affected by the removal of the routing procedure.\n\n3. In P-CapsNets, the basic unit of input, output, and capsules are all rank-3 tensors. The Equation 4 is obtained by extending Equation 3 to the 3D case and incorporating the convolution operation. What is the relationship between this work can DeepCaps[1] where they apply 3D convolution based dynamic routing algorithm?\n\n[1] Rajasegaran, Jathushan, et al. \"DeepCaps: Going Deeper with Capsule Networks.\" Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2019.\n\n4. In Section 7, the adversarial robustness of CapsNets is evaluated. The paper claims that P-CapsNets also suffer this issue, even more seriously than CNN models. Do the experiments with the Basic Iterative Method (BIM) show the same result? The experiment should be done as in Hinton et al. (2018).\n\n5. The universal adversary perturbation (Moosavi-Dezfooli et al. (2016)) is applied to evaluate the resistance to white-box attack. Why this work chooses this one instead of a popular white-box attack method (e.g., FGSM as in Hinton et al. (2018))?"}