{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper aims to obtain latent representation of data such that probability density for the real space can be calculated correctly from that in the latent space. The authors optimize a loss function that has components related to parametric probabilistic distribution and auto encoder simultaneously. While this might be an important problem (I am not sure), the paper is not written and organized well which makes a through evaluation very difficult. I provide below some of the problems with this the paper:\n\nWhy the introduced method is better than VAE as a generative model for capturing the latest representation is not explained well. It is not also used as a baseline in most of the experiments.\n\nThe motivation for having the third term in Equation (4) needs to be explained. Also what is h() in the second term. The authors only describe briefly both terms together after they used it here but failed to describe what each term is.  Why there is an h for the second term but not for the third term. h() becomes more clear much later in the paper but when it is used the first time, it not defined. \n\nI believe A in Equation (5) should be also positive-definite. \n\nWhat is L(x) in Equation (8).  It needs to be defined.\n\n\nExperiments:\n1-\tIt is useful to also plot the original data in space s to see how the results in Figure 2 make sense. \n2-\tFigure 3 is not clear.\n3-\tIn the Anomaly detection experiments, the authors make two assumptions that usually do not exist in real-worlds: (1) they assume that they have access to training set that only contains normal cases. (2) They assume that they know the correct rate of anomaly. I think both these assumptions are very restrictive and unreal. While these assumptions are used for all the comparing methods, it is not obvious how different algorithms behave in real scenario. \n4-\tFigure 4 and what it represents is not clear. \n\nWriting Problems:\n1-\tIn the text of paragraph before Figure 1, Eq. (5) in “in the second term of Eq. (5)” is a typo and should be Eq. (4). \n2-\tIn the paragraph before Figure 1, the following sentence is not complete: “Then, averaging Eq. (4) according to distribution, x~P_x(x) and epsilon~ P(epsilon).”\n3-\tSection 4.2.1: “there is a difference is PDF → “there is a difference in PDF”"}