{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper focuses on synonym based substitution defense from adversarial attacks (SEM) and proposes an improved  \nadversarial attack approach (IGA).\nThe topic is important and the proposed idea could make the  \nadversarial attack more meaningful. \n\nUnlike prior work using spelling checkers (map wrongly spelled  \nwords to correct ones) to reduce the effects of character modifying  \nbased attacks, the authors map word synonyms to a unique  \nencoding.\nThe authors claim that the results demonstrate that SEM can significantly  \nimprove the robustness of neural networks and that IGA can achieve better  \nattack performance compared to existing attacks. The work  \nis generally well-explained.\n\n\nBeing limited to word synonym substitution based attacks makes the paper a little bit narrow, but it is fine if the methods  \nare thoroughly investigated. Could you use any typical and existing  \ncluster algorithms with the SEM encoder? Why do you want to invent something  \nnew (since there is no reference for the proposed Algo. 1, I have to  \nassume that the authors did invent it)?  Are there any advantages of  \nthe proposed Algo. 1 over some typical cluster algorithms?\n\n\nDid you fine-tune the word embedding? if embeddings are not fixed  \nduring training, it may change the Syn(w, delta,k), since calculating  \nSyn(w, delta,k) is based on the embeddings, right?\n\nhow does k affect the experiment?\n\nOne concern from Algorithm 1 is that the mapping E you want to learn  \nis biased by the order of how you traverse in W (line 2 in Algo. 1).\nSuppose you traverse W by the order (...,w_1,w_2,w_3,...) ,  if  w_2  \nis in both Syn(w_1,delta,k) and Syn(w_3,delta,k), then  E(w_2) =  \nE(w_1). However if the order is (...,w_3,w_2,w_1,...), then E(w_2) =  \nE(w_3). I wonder whether this matter or not.\n\nHow about the computational costing time for GSA,PWWS, GA, and IGA ? This could  \nmatter if you compared their attack performance with your proposed IGA.\n\n IGA could traverse all synonyms of a word no  \nmatter what value k is. Does this have a similar impact with the cases  \nwe increase k or delta (the distance threshold)? All these cases will  \nmake the search space bigger and may also cost longer time (like more  \niterations), I think.\n\nIn the extreme cases of IGA, if two words are mutually the only  \nsynonym with each other, it could replace each other for many times.  \nThe good thing is that there was a maximum number, lambda. BTW, what  \nis the maximum number lambda?\n\nThe authors mention they randomly sample 200 examples  \nto evaluate the efficiency of the SEM method. The SEM layer is not that time-consuming during training. I  \nguess that the adversarial attack should be time-consuming? In this  \ncase, changing GA to IGA should be more carefully evaluated, it may  \ncost a longer time.\n\n\n\n\nminor comments\n\n1. In Algo. 1, we can remove \"E[w_j'] \\neq NONE\" in line 5, since it  \nwas already mentioned in line 4.\n2. Can you directly report the numbers in Figure 2?\n3. you mention in the introduction  \nthat the extra encoder is called SEM, and then you call the clustering  \nalgorithms also SEM. So should SEM be the encoder for the defense, or  \njust a new cluster algorithm?\n4. The subscripts for w and w' are confusing. In the first equation  \n(the unnamed one), the subscripts for w' (1,2,...k) seem like the order  \nbased on the distance. In the paragraph just below equation (1),  \nthe subscripts for w' or w (i.e., 1,2,...n) denote the word order based  \non the input x. In Algo. 1, the subscripts for w denote the order in  \nthe vocabulary. It may need to be changed in some ways.\n5. In the first paragraph of Sec. 2, did you explain K? I think K  \n(capital one) and k are not related, could you change one of them to  \nanother letter.\n\n\n\n"}