{"title": "A method to produce adversarial attack using a Frank-Wolfe inspired method", "review": "This paper provide a method to produce adversarial attack using a Frank-Wolfe inspired method. \n\nI have some concerns about the motivation of this method: \n - What are the motivations to use Frank-Wolfe ? Usually this algorithm is used when the constraints are to complicated to have a tractable projection (which is not the case for the L_2 and L_\\infty balls) or when one wants to have sparse iterates which do not seem to be the case here.  \n - Consequently why did not you compare simple projected gradient method ? (BIM) is not equivalent to the projected gradient method since the direction chosen is the sign of the gradient and not the gradient itself (the first iteration is actually equivalent because we start at the center of the box but after both methods are no longer equivalent).\n - There is no motivations for the use of $\\lambda >1$ neither practical or theoretical since the results are only proven for $\\lambda =1$ whereas the experiments are done with \\lambda = 5,20 or 30.\n - What is the difference between the result of Theorem 4.3 and the result from (Lacoste-Julien 2016)?\n \nDepending on the answer to these questions I'm planning to move up or down my grade.\n\n In the experiment there is no details on how you set the hyperparameters of CW and EAD. They use a penalized formulation instead of a constrained one. Consequently the regularization hyperparameters have to be set differently.\n\n The only new result seem to be Theorem 4.7 which is a natural extension to theorem 4.3 to zeroth-order methods. \n\nComment: \n- in the whole paper there is $y$ which is not defined. I guess it is the $y_{tar}$ fixed in the problem formulation Sec 3.2.  In don't see why there is a need to work on any $y$. If it is true,  case assumption 4.5 do not make any sense since $y = y_{tar}$ (we just need to note $\\|\\nabla f(O,y_{tar})\\| = C_g$) and some notation could be simplified setting for instance $f(x,y_{tar})  = f(x)$.\n- In Theorem 4.7 an expectation on g(x_a) is missing\n\nMinor comments: \n- Sec 3.1 theta_i -> x_i\n- Sec 3.3 the argmin is a set, then it is LMO $\\in$ argmin.\n\n===== After rebuttal ======\nThe authors answered some of my questions but I still think it is a borderline submission.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}