{"rating": "3: Weak Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #1", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "Summary of the Paper:\n  \nThe authors claim the that i.i.d hypothesis that is often used in the prior when looking for the equivalence between neural networks and GP is not valid. Then, they propose a new interpretation of neural networks as Gibbs distributions (in the case of fully connected layers) and a MRF in the case of convolutional layers. Some simulations are done to verify this.\n\n\nDetailed comments:\n\nOverall I believe that the writing of the paper is very sloppy and difficult to read and follow. It is not clear that the GP interpretation cannot be valid simply because the activations and weights are not i.i.d. I.I.D is a sufficient condition but not required in the central limit theorem. For example, the sum of correlated Gaussian variables also tends to a Gaussian distribution. The same for non-Gaussian variables. Therefore, I do not think that the GP interpretation of the NN is wrong simply for that. This simply shows that the i.i.d. prior may be suboptimal.\n\nSumming up, I think that this paper needs more work. Currently, I do not think I can extract anything useful from it.\n\nThe prior is subjective and can be chosen by the user. So if an i.i.d. prior is actually chosen, the corresponding Bayesian  neural network will converge to a GP.\n\nAn i.i.d. prior may be sub-optimal. However, it can be used to interpret neural networks as GP. There is no problem with that.\n\nIt is well known that the sum of random variables can also converge to a Gaussian distribution even though they are not independent. This questions the claims of the paper.\n\nThe witting of the paper needs to be improved. There are several expressions that do not sound well. E.g., \", GP with i.i.d.\"\n\nZ'y in Eq. (9) should depend on l.\n\nIt is not clear what is the distribution of a hidden layer (activations weights etc..).\n\n\"...and f Y is an estimation of the true distribution P (Y |X)\" what do you mean by that?\n\nEq. (8) seems to be a prob. distribution for the random variable Fy. However, the authors give an expression for f_yl, which does not make sense.\n"}