{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper analyzed a few issues of Adam, and proposed a new variant of Adam called AdamAL.  \n\nThere are quite a few issues: \n--It is not clear whether the heuristic observations are useful. \n--Theorem 3.1 does not even lead to the convergence of the algorithm. \n--The simulation does not show the advantage. \n--There are too many typos and grammar errors.\n\n1) Heuristic observations.\nOne main observation is that v_{t+1} = beta_2 v_t + (1 - beta_2) g_{t+1}^2 in the original Adam will be different from \\hat{v}_t defined in AMSGrad. The paper states \"...will accumulate this small error into each step\" ...\"will lead this model to find a suspicious local optimal\".  This claim makes little sense. Even if AMSGrad uses a different v from the original Adam, it is not necessarily bad. In addition, why is this related to \"suspicious local optimal\" (I suppose this paper intends to say \"spurious local optima\")? I do not have any intuition why this is related to spurious local minima. \n\n\n\n2) Too many typos and grammar errors. \n\nJust give one example. In the first paragraph of Sec. 3.3, there are at least 15 typos, and a few sentences are hard to read: \n   \"They derive it mainly from an unrealistic objective function\" --what does \"objective function\" mean? \n   \"Does it really solve the problem or dose this design violate the intuition of Adam-Type algorithm\"?  --what is the \"intuition\" to be violated? I roughly get the point of this sentence, but \"intuition\" is not a good word here.\n   \"To be more specifically, we present a simple one-step AMSGrad swapping at iteration t and figure out the ill-condition problem\". --What is \"ill-condition problem\"? It is not mentioned in this paragraph, and I don't know where it comes from.\n   In the whole paper, there are too many problematic sentences to enumerate (a very rough estimate: at least 30?)  It makes the paper very difficult to read.\n\n  \n\n   "}