{"rating": "3: Weak Reject", "experience_assessment": "I have published one or two papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review": "I am having a hard time validating the claims of contributions of this paper over the contributions of Ruiz et al.,(2016). Ruiz et al already propose the generalized method which allows the reparametrizated density to be dependent on the latent variable. They already derive the score function method and the standard reparameterization as special cases of their generalizaed reparameterization. So both the remarks on Page 3 area already known from previous works.  The way this paper is structured and contributions are listed, it seems the authors completely overlook several contributions of Ruiz et al, while touting some of them as their own. e.g. Above Section 3 (last para of Section 2), the authors talk about the cases of Gamma, Beta  etc which are hard to handle using the standard parameterization, but the authors fail to mention that the work of Ruiz et al is able to handle these perfectly well. \n\nThe notations in the beginning of Section 3 is confusing to me. \\rho is a transformation function, yet the authors say \"let w() be the the density function of \\rho\", because somehow \\rho is suddenly a random variable ? How did that come about ? \n\nSimilarly, some of the background material is misleading -- e.g. the authors say that the entropy term is \"ignored\" and they \"focus on the simplified ELBO\", while that is not the case in VI. The gradient of entropy is more amenable, it is not ignored. The background is very poorly written and misleading.\n\nThe possible connection to transport theory might be interesting, but the authors merely allude to it, listing the velocity field and picking the condition for unbiasedness out of thin air without any explanation or background. Simiarly the connection to control variate is only alluded to in less than 10 sentences, and in my humble opinion does not provide enough clarity for this to be a contribution. \n\nI suggest the authors clearly discuss the contributions over and above those of Ruiz et al (the obviation of calculation of full fledged jacobians) and discuss their work more vis-a-viz Ruiz et al, fix the background so that it is more faithful to what is known in the literature (how is the velocity field introduction different ?), provide the details of the method /before/ directly writing down the theorem for it (Thm 3.1), and clarify the connections to control variate in more detail rather than just merely alluding to it (may be also provide more detail in the background about it). The authors have listed the connection to control variates as a contribution but in the draft body it is merely a mention. Here is the direct quote \"We can see that the GTRANS\nmodel is a special case of the control variate method with a complex differential structure\". In its current form the paper is not ready for publication IMHO. "}