{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper looks at the problem of making the reparameterization trick in Variational Inference applicable to a wider range of distributions. Reparameterized estimators have lower variance than score function estimators but their application is restricted to fewer distribution classes. Using a set of mathematical devices, they derive gradient estimator for the ELBO as a transport equation. \n\nOn similar lines as Ruiz et al (The Generalized Reparameterization Gradient or G-REP), the paper starts off by assuming that the standardized variable (\\rho in the paper, \\epsilon in Kingma and Welling, Ruiz et al.)  is a weak function of the variational parameters. They then go on to develop transport equations which reduce to the reparameterization and score function methods as special cases. This is also what we see in the related papers - G-REP goes about the estimation process for q(z,\\theta) more directly, and obtains two terms, one that looks like the reparameterization gradient and the other a score function like term. \n\nA particular form of the velocity field is then used for their polynomial based estimator.\n\nApplicability is shown for the gamma distribution (and therefore associated distributions such as the dirichlet, beta). The results show a lower variance than the other known approaches (G-REP, and Rejection Sampling VI), and the ELBO reaches a high value at a much smaller number of runs. Having said that, I am not so sure if the results are really that much better than the counterparts - especially RSVI. \n\nMy thoughts: I very much enjoyed going over the derivations and associated papers. The other related paper with a transport equation involves pathwise derivatives (as the authors note - Jankowiak and Obermeyer - https://arxiv.org/abs/1806.01851) and appeals to Optimal Transport for the procedure. \n\nI am curious as to whether we can give a physical interpretation to the 'velocity' in the transport problem which looks very much like the transport equations we encounter in physics and fluid mechanics. I do note as a minor point that some of the other related papers (Ruiz et al, Naesseth et al.) read much more clearly. \n\n"}