{"title": "interesting study of stability of signal representations on graphs", "review": "The paper introduces an adaptation of the Scattering transform to signals defined on graphs\nby relying on multi-scale diffusion wavelets, and studies a notion of stability of this representation\nwith respect to changes in the graph structure with an appropriate diffusion metric.\n\nThe notion of stability in convolutional networks is an important one, and the proposed notion of stability\nwith respect to diffusion distances seems like an interesting and relevant way to extend this to signals on graphs.\nWith this goal in mind, the authors introduce a scattering transform on graphs by relying on diffusion wavelets,\nand provide an appropriate study of stability, which seems to highlight relevant properties of the graphs.\nThe proposed representation seems to provide benefits compared to the previous work of Zou & Lerman,\nparticularly regarding computational efficiency, as well as stability with respect to a metric that is perhaps more\nuseful, though there is a dependence on the graph topology through the spectral gaps.\nIn addition, the experiments on author attribution and source localization suggest that the\nresulting representation remains discriminative, in addition to providing stability to changes in graph structure.\n\nI find that these contributions provide an interesting advance in theoretical understanding of graph convolutional networks\nfrom a stability perspective, in addition to introducing a useful non-learned representation,\nand am thus in favor of acceptance.\n\nNevertheless, some parts of paper would benefit from further discussions and more clarity:\n\n- other than empirically, one aspect that's missing compared to the original study of the scattering transform is energy preservation. The authors could at least provide a discussion of whether such a property can be obtained here as well (does it depend on the spectral gap through C(beta)?)\n\n- what is the role of the spectral gap in the stability bounds? is this a drawback of the diffusion metric / choice of wavelets?\n\n- Section 3.2 suggests that metric stability is a good way to characterize stability, by seeing deformations in Euclidian domains as a change to the ground metric. Yet, in Euclidian scattering, the same representation is applied to a deformed signal and the original signal, and stability is measured with the Euclidian metric.\nCan the link be made more precise, by explaining what a deformation of a signal would be on a graph, or by applying arguments from the proposed construction to the Euclidian case?\n\n- the paper is heavy on terminology from wavelets and harmonic analysis, a more detailed presentation of diffusion wavelets and related concepts such as localization would be beneficial. Also, it seems like the chosen wavelets in the construction favor spatial over frequential localization - is this due to a trade-off? if so, can it be avoided?\n\n\nSome more detailed comments:\n- Section 2, 'generally far weaker': what is meant by 'weaker'?\n- Section 3.3:\n  * 'calculus on T': T is used before being defined\n  * clarify what norm is used (I assume operator norm?)\n  * 'defines a distance', 'stronger than .. GH': this should probably be justified\n- Section 4:\n  * 'optimal spatial localization', 'temporal difference', 'favoring spatial over frequential localization': these could be clarified\n  * 'amplify the signal': what does this mean?\n  * the sentence about the choice of the appropriate J is not clear and should be further clarified\n- Section 5.1:\n  * the sentence about the choice pi/pi* = 1 should be clarified. Also, where is this assumption used?\n  * epsilon_psi, epsilon_U should be defined\n  * 'given that [..] by definition': this doesn't seem to be defined elsewhere\n  * (16): isn't a factor m missing in the first term?", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}