{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper investigates the impact of implementation \"details\", with existing implementations of TRPO and PPO as examples. The main takeaway is that the performance gains observed in PPO (compared to TRPO) are actually caused by differences in implementation, and not by the differences between the two learning algorithms. In particular, adding to the TRPO code the same implementation changes as in PPO makes TRPO on par with (and possibly even better than) PPO. The clipping objective of PPO is also found to have no significant impact on its performance. This calls for more careful comparisons between algorithms (by minimizing implementation changes and more in-depth ablation studies) than has typically been done until now in the RL research community.\n\nAlthough this paper is pretty straightforward and does not bring meaningful algorithmic improvements, I still believe it should be accepted as reproducibility and evaluation are a major issue in RL, and people need to be aware of these kinds of implementation differences that can affect the reported results.\n\nMy only important concern is that I could not find a link to the code, which I believe is a must for such a paper focusing on implementation. Could the authors please confirm that they will release their code?\n\nOther small remarks:\n\t- Fig. 1 is hard to read, I think more synthetic results could have easily conveyed more clearly the intended message\n\t- When referring to Fig. 2 and 3 please specify \"left\", \"middle\" or \"right\"\n\t- Fig. 2's caption should describe the plots in left to right order (also what does \"maximum versus mean KL\" mean?)\n\t- Fig. 3's caption lists mean KL twice on its first line\n\t- \"The trust region for PPO-NoClip bounds KL to a lesser degree\": this is confusing as it sounds like it is \"less bounded\" while it is actually \"more bounded\" (as said in Fig. 3's caption)\n\t- It would help comparing Fig. 2 and Fig. 3 if they both used the same y axis range\n\t- Typo: \"enforcing\" => enforces"}