{"title": "Interesting engineering work, but rather limited novelties", "review": "This manuscript introduces a method, called siamese network (SN), to identify duplicate and copied/modified images, which can be used to improve surveillance of the published and in-peer-review literature. The topic is interesting and the authors showcased that their method can be used for a side application of semantic segmentation as well. \nThe paper is a very interesting engineering article. But its novelties and merits seem limited and rather incremental. There are several unclear points in the method, and more importantly it is not clear where the method stands among the various previous works. There are no proper comparison with previous works nor enough ablation studies to support the claims provided in the paper.\n-\tThere are three parallel streams of CNN in the proposed 3-branch network. Are they sharing parameters? If No, why not! It seems like they need to be learning similar set of features sharing parameters is the most feasible approach. There are no discussions on this, nor any analyses in the experiments. Whereas for the previous work on the same topic (Chopra et al. (2005)) has a two-branch network that shares parameters.  \n-\tThe results suggest that SN may not be good enough to be used as a fully autonomous forensic detector, but it can narrow down the pool of images which can be subjected to further human review or interventions. The question here will be how different this method is compared to all previous similar research (some of which introduced in Section 2). There are absolutely no comparisons with any previous/other methods (neither theoretically nor experimentally). Why do we need another method that does almost the same as previous works? If it is better than the previous ones, this should come out from the paper. \n-\tThe results section is very brief and does not include proper comparisons. Even for the semantic segmentation, the authors only compared with U-Net, and their results are just comparable with it, not any better. U-Net now is not even close to the state-of-the-art for semantic segmentation, especially for the datasets used in the paper (for cell and nuclei segmentation). \n-\tOne of the main issues with this line of research is that the dataset is not public and, probably due to legal issues, it may not become public. Therefore, future comparisons and reproducibility of the research may be of concern. \n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}