{"rating": "8: Accept", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The paper introduces an efficient, unbiased contrastive divergence-like algorithm for training energy-based generative models on the example of Restricted Boltzmann Machine.\nThe proposed algorithm is built upon a very interesting work on unbiased finite-step MCMC approximations by Jacob et al, 2017.\nDespite the actual theory being published some time ago, the submitted paper popularises these ideas in the machine learning community and contains optimised variants of the existing algorithms for training of RBMs.\n\nThe paper is mostly written well and does a good job of introducing unbiased MCMC estimators.\nAuthors evaluate their method on rather toyish datasets (by modern standards), however, their empirical analysis is thorough. The improvement upon the standard CD and persistent CD is clear.\nIt also appears that the algorithm actually does not require too many steps and generally does not introduce a lot of computational overhead. \nThe only question I have is why CD has only been tried with k=1 steps? \nI would be interested in its performance for different number of steps including the dynamically chosen number provided by the empirical \\tau in UCD for a given iteration.\nEven though I do not expect a significant improvement to be obtained, this would separate the effect of the number of steps chosen “right” from unbiasedness of the gradient estimator.\nOther baselines, including those mentioned in the related work, could also make the comparison more complete.\n\nI would also suggest including https://arxiv.org/abs/1905.04062, as it seems to be relevant in the spirit."}