{"title": "First step on an important problem but hard to tell if its generally useful.", "review": "In this paper the authors present 4 methods for detecting outlier edges and nodes in graphs so as to prevent adversarial attacks on graph convolutional networks.  They demonstrate that their methods are accurate (through high AUC) in detecting edges added by two previous adversarial detection methods.\n\nI think focusing on not just attacking GCNs but actually preventing them is awesome, and work of this sort should be highly lauded as I believe prevention is more difficult than attacks.  That said, it is hard to tell how general this work is.  The methods discussed follow fairly standard anomaly detection procedures (albeit with NN based models).  However, this leaves a few key open questions: \n\n(1) To what degree do these methods address the particulars of GCN attacks?  This could possibly be addressed by better recapping the GCN attacks and explaining how these methods directly relate to those attacks.\n\n(2) How robust are these methods?  While the intuition behind the methods at a high level seems reasonable, it is unclear if they provide any real robustness to an adversary.  Could the previous attacks be adapted if these detection mechanisms were known?  For example, I expect that adding edges that are high likelihood and maximally change the victim label would be an effective deception technique.  I believe a more thorough theoretical understanding of the robustness of the protection would make me more confident that these are broadly useful.  As of now, it seems very much data dependent.\n\n\nDetails:\n\nGraphGen is worded weirdly -- you're not generating graphs, you're building a generative model for which you evaluate the probability that you would have generated an observed subgraph.\n\nRobust MF has been studied and should be cited as well:\n\nBenjamin Van Roy and Xiang Yan. Manipulation-resistant collaborative filtering systems. In Proceedings of the Third ACM Conference on Recommender Systems, RecSys ’09, pages 165–172, New York, NY, USA, 2009. ACM.\n\nBhaskar Mehta and Wolfgang Nejdl. Unsupervised strategies for shilling detection and robust collaborative filtering. User Model. User-Adapt. Interact., 19(1-2):65–97, 2009.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}