{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "\nThis work proposes a dynamic graph message passing network to efficiently capture long distance relationships in computer vision tasks. The proposed methods in this paper are closely related to deformable and non-local papers.\n\nThe paper does not clearly show the difference with deformable and non-local and why the proposed methods works better than them. This paper is more than 8 pages, which requires higher standard when reviewing. Here are some other comments.\n\n1. The number of parameters for learning position-specific random walks can be very large as it is P ×(K×C) x h x w. This can also be observed from Table 1(a) by comparing DGMN w/ DA+DW with DGMN w/ DA+DW+DS. It means the application of proposed method is limited.\n\n2. The comparison details with deformable paper and non-local paper is not clear. This paper actually is closely related to these two papers. There is little details about these two models in experimental studies. Notably, DGMN w/ DA+DW even performs worse than non-local. By adding more parameters to learn walked nodes, DGMN w/ DA+DW+DS outperforms non-local. Although non-local use 2.88M parameters, the authors can remove some of linear transformations to make it clear. Since the proposed method works very similar to non-local and deformable, I need more details to verify the effectiveness of the method.\n\n3. Is the proposed method really related to graph? The key part of GCNs is the node connectivity. Here, the method samples a fixed number of nodes that are connected to a center node. Why the authors want to use graph concepts to explain the story. The connection to graph is not convincing to me.\n\nSuggestions:\n\n1. Better explanation of the novelty especially compared with deformable and non-local.\n\n2. Fair experimental studies or detail explanation about the fairness.\n"}