{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "In this paper authors describe a way to quickly model interaction between many entities, in the form of mixture of Gaussians. They provide huge computational complexity improvements over Bialkowski et al. work, which allows them to analyse big datasets.\n\nPaper, in its current form, lacks quantitative evaluation, comparison to other methods (heavily cited in the paper), and any well established applications that can be quantified. Given that the method described is a composition of many known techniques, and some new tricks, it is hard to assess the value of these contributions without seeing more unified evaluation methodology. All the provided results (apart from computational complexity wrt. specific approach, which are quite amazing in isolation!) are qualitative and descriptive in nature, which together with the fact of being applied to a single, specific dataset, with makes it hard to judge any generality. This is a common problem with various \"structure discovery methods\" such as clustering techniques, but an important one to address.\n\nIt is also unclear to reviewer, whether the only (main?) claim authors want to make is that they provide speed-up to the existing solution. if this was the case, it is really hard to see how each of the proposed steps guarantees the same outputs as previous approaches, while at the same time only affecting speed. In particular authors make the claim of improvement stability, yet do not provide empirical evaluation showing these benefits over previous methods. \n\nPlease compare these to results reported e.g. in the cited work of Yeh et al. \"Diverse Generation for Multi-agent Sports Games\".\n\nOverall, in reviewer's opinion, results looks quite incremental, and are heavily concentrated around specific paper of Bialkowski et al., and as such might see limited interest in the ICLR community.\n\nMinor comments:\n- please unify use of quotations (authors use closing quotations for both opening and closing quotes)\n- is there an extra | symbol in eq. (4)?\n\n\nPlease note, that reviewer has little experience in this particular branch of the field, and thus some of the issues mentioned could come from misunderstanding the standards."}