{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "N/A", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "The paper addresses a problem in the context of understanding formations of sport player in a play field. The problem is that players form an ומ-ordered sets of entities and to analyze them, one would like to keep some canonical representation that allows us to compare formations across time. The idea of this paper is to assign roles to each players (name each member of the set) based on the distribution of their spatial locations on a field. Once this representation is learned, future work may use it for downstream problems, which are not discussed in this paper. \n\nGeneral: \n\nThe paper is very clearly written, the method makes sense and the related work are both well explained. \nI have two main concerns: First, the scope of the paper may be too narrow for a conference like ICLR, as the method part is fundamentally a clustering method, and the application is very specific. Second, I was expecting that the paper shows interesting results that can be obtained once the representation is learned, but this are lacking from the paper. \nBased on these two concerns, I dont think the paper would be a good fit for ICLR. \n\nTo make the paper more appealing to the ML community, my recommendation to the authors is to  show what can be achieved with the new representation, that was impossible with previous representations. For example, it is claimed that faster learning allows to compute it season wide and on-the-fly. What are useful tasks that your rep' can help with? How do these tasks perform with the new rep? \n\nOther comments and questions. \n\n-- What about other competing representations. Would it be useful to look at movement trajectories instead of distribution of isolated locations (cluster lines instead of points)? \n-- What happens when a player is replaced by another player of the same role. Wouldnt its distribution change? Dont you want your rep' to reflect such events? \n"}