{"title": "This paper claims to introduce non linearity in the discourse vector framework defined by Arora et.al. While the motivations for the non extensive statistics seem interesting and warrant a thought, the experiments are severely lacking in providing any insight into the method.", "review": "This paper while presenting interesting ideas, is very poorly written. It seems as though the authors were in a rush to submit a manuscript and did not even bother with basic typesetting.\nFirstly, the paper spends too much time motivating and re-introducing the model of Arora et.al. Note to the authors here, they cite the same paper from Arora et.al for 2017 twice. The first time the model they refer to was introduced by the paper \"RAND-WALK: A latent variable model approach to word embeddings\", this is probably what the authors mean by the 2016 reference?\n\nNow coming to the experiments, the results are presented in a table that is poorly formatted. The section partitions are not clearly delimited, making for a hard read. Even if we overcome that and look at the results, the presented numbers are incredibly confusing. On the STS 13 and 15 data sets, Ethayarajh 2018's numbers are much better at 66.1 and 79.0. Coming to STS14 Ethayarajh attain 78.4 while the proposed method achieves 78.1. If we discount this for the moment, and look at the results on STS12 where the proposed method achieves 71.4, this is the only data set where the proposed method does better than the other baselines.\n\nSo almost on 3 of the 4 datasets Ethayarajh 2018 does better. This makes me question what exactly is the proposed model improving?\n\nCoupled with the fact that there is no motivation to explain results or future work, this makes for a very poorly written paper that is very challenging to read.\n\nIt is very likely that there is some merit to the proposed methods that introduce non linearity, but these points simply get lost in the mediocre presentation.", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}