{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "The paper aims to understand and interpret feature representation in DNNS by proposing two entropy-based at pixel-level metrics called Strict information discard (SID) and reconstruction uncertainty (RU). The new metrics are used to diagnosis the generality and coherency of DNN models. \nOverall, quantifying and interpret feature representation learning in DNNS are important and interesting topics. Two proposed metrics have clear intuitions. However, the paper needs to be improved to be published at the top-notch venues. \nSection 3 contains the main contributions, however, there are many aspects which is not rigorously defined. Hence, it is difficult to justify the soundness of the metrics. Some unclear details are as follows\n1/ What is X_c, is it the empirical distribution of data or data distribution in general or what else? \n2/ In Eq(6), to compute the concentration, do we need the ground truth?\n3/ The proposed metrics are mentioned to be related to the information-bottleneck principle but the paper does not describe it in detail. How are they similar and different? Can newly proposed metrics replace the information-bottleneck principle? \n4/The paper mentioned that the perturbation-based methods are heuristic-based, why are the entropy-based methods not heuristic? Is there any theoretical guarantee that they reflect the idea of SID and RU?\nMoreover, the experiments only demonstrate how SID and RU works in several datasets and settings. There is no comparison with other works in the literature, e.g. the information-bottleneck principle."}