{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This paper empirically presents a very interesting connection between two also very interesting phenomena (mode connectivity and lottery ticket hypothesis), while removing a previous limitation of the lottery ticket hypothesis on larger networks. through a good amount of experiments, the authors empirically showed these two phenomena co-occur together (i.e. matching networks are stable) and have positive correlation (i.e. the more “matching” the network the more “stable”), under different network architectures and datasets.\n\nThough it is unclear from the paper what are the immediate / straightforward applications, the findings do present interesting contributions. Several things I found that can further improve this paper.\n\nFirst, this paper lacks a structured literature review. It is suggested that the findings may provide insights to our understanding of how SGD works in neural network. Laying some proper background knowledge on this area is needed in the literature review. \n\nThere are several experiments that I’m curious to see. Though I must say the existing amount of experiments sufficiently validates the existence of the connection authors put forth and hence not required.\n\na) Provide some metrics on how “far” are the two final weights upon which mode connectivity (or stability) is explored. For the sake of comparison, distance between the initial weights and final weights can be added. \n\nb) First off, the introduction mentions connectivity was previously observed using “disjoint subsets” of data, whereas later in the paper only different orders of the same data are explored. I wonder if this is a typo. Regardless, exploring if the findings still apply on disjoint data and/or varying amount of data, besides different data orders, is helpful. \n\nc) Does the full network have the property of mode connectivity (when trained using different data orders), or this only occurs under sparsity.\n\nLastly, the writing of the paper doesn’t interfere with understanding, but can definitely use more work. Abstract can be tightened. Several typos throughout the paper:\n- in the abstract, \"with the no change\" -> remove \"the\"\n- bottom of page 1, subt -> sub\n- second bullet point under \"contributions\": remove \":\"?\n- page 3, paragraph starting with \"stability\": \"the increase in worst-case increase\" -> \"the worst-case increase\"?\n"}