{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper proposes to learn via meta-learning to correct noisy labels using a small trusted set of examples with correct labels. Inspired by the work of Ren et al, 2018, which proposes a method to learn to re-weight examples via meta-learning, the authors of this work instead propose to learn to remove label noise, but in a similar fashion. They use a finite-differences approximation to compute the second-order gradient in meta-learning and a look-ahead SGD to update the weights of base classifier after applying several update steps to the meta-learner.\n\nNovelty\nThe idea is novel, well motivated and technically sound. \n\nPerformance:\nThe method does not seem to perform better than the existing approaches of GLC or L2R or Forward unequivocally in all situations. For example even for the simpler UNIF noise, the proposed method performs poorly versus the existing approaches particularly when less trusted data is available. This is to expected as their method relies on learning a CNN to correct the labels, which in turn is likely to be more susceptible to overfitting with inadequate trusted data. This limits the broad applicability of the proposed approach and narrows its contribution.\n\nExperiments:\nI would also like to see the authors results include some real-world image datasets beyond the toy MNIST dataset. For example Hendrycks et al. at the very least included the CIFAR dataset besides MNIST, even though that is also not ideal because of how small the CIFAR dataset. Without these results it is unclear as to whether the proposed method is even applicable to real-world images or not.\n"}