{"title": "Very interesting paper with a nice methodological tansfer between rare event estimation and NN verification", "review": "This is a paper of the verification of neural networks, i.e. check their robustness, \nand the main contribution here is to tackle it as a statistical problem adressed with \nmulti-level splitting Monte Carlo approach. I found the paper well motivated and original, \nresulting in a publishable piece of research up to a few necessary adjustments. These \nconcern principally notation issues and some potential improvements in the writing. \nLet me list below some main remarks along the text, including also some typos. \n\n* In the introduction, \"the classical approach\" is mentioned but to be the latter is \ninsufficiently covered. Some more detail would be welcome. \n\n* page 2, \"predict the probability\": rather employ \"estimate\" in such context? \n\n* \"linear piecewise\": \"piecewise linear\"? \n\n* what is \"an exact upper bound\"? \n\n* In related work, no reference to previous work on \"statistical\" approaches to NN \nverification. Is it actually the case that this angle has never been explored so far?\n\n* I am not an expert but to me \"the density of adversarial examples\" calls for further \nexplanation. \n\n* From page 3 onwards: I was truly confused by the use of [x] throughought the text \n(e.g. in Equation (4)). x is already present within the indicator, no need to add yet \nanother instance of it. Here and later I suffered from what seems to be like an awkward \nattempts to stress dependency on variables that already appear or should otherwise \nappear in a less convoluted way. \n\n* In Section 4, it took me some time to understand that the considered metrics do not \nrequire actual observations but rather concern coherence properties of the NN per se. \nWhile this follows from the current framework, the paper might benefit from some more \nexplanation in words regarding this important aspect. \n\n* In page 6, what is meant by \"more perceptually similar to the datapoint\"? \n\n* In the discussion: is it really \"a new measure\" that is introduced here? \n\n* In the appendix: the MH acronym should better be introduced, as should the notation \ng(x,|x') if not done elsewhere (in which case a cross-reference would be welcome). \nBesides this, writing \"the last samples\" requires disambiguation (using \"respective\"?). \n\n\n \n\n ", "rating": "8: Top 50% of accepted papers, clear accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}