{"title": "This paper proposes an algorithm that jointly selects training samples for domain adaptation and performs a down stream task such as classification, POS tagging, parsing etc. While the proposed model is interesting and innovative, experimental evaluations are largely lacking and insufficient to establish claims of the authors.", "review": "The paper aims to address issues with Domain Adaptation by using RL approaches. Domain Adaptation is an actively studied area in NLP research and so this paper is relevant and timely. This paper proposes and algorithm that is in line with work that aims at selecting data smartly when performing Domain Adaptation. The proposed algorithm learns representations for text in the source and target domains jointly. The proposed algorithm has two components i) a selection distribution generator (SDG) and ii) a task specific prediction for tasks being POS tagging, Dependency parsing and Sentiment Analysis.\n\nWhile the proposed algorithm is interesting from a RL perspective and make sense, there is no explanation provided as to why this algorithm should do better over non RL based approaches for tasks such as Sentiment Analysis.\n\nDomain Adaptation is widely studied for Sentiment Analysis and a lot of current research focuses on the various aspects of domain data, such as word and sentence level semantics, when developing algorithms. For example the following papers all (saving the third) address the problem of Domain Adaptation for Sentiment Analysis through various approaches fairly similar to the authors' algorithm, that provide similar if not better results than those provided in the paper,\n\n[1]Barnes, Jeremy, Roman Klinger, and Sabine Schulte im Walde. \"Projecting Embeddings for Domain Adaption: Joint Modeling of Sentiment Analysis in Diverse Domains.\" arXiv preprint arXiv:1806.04381 (2018).\n[2] Ziser, Yftah, and Roi Reichart. \"Pivot Based Language Modeling for Improved Neural Domain Adaptation.\" In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers), vol. 1, pp. 1241-1251. 2018.\n[3]An, Jisun, Haewoon Kwak, and Yong-Yeol Ahn. \"SemAxis: A Lightweight Framework to Characterize Domain-Specific Word Semantics Beyond Sentiment.\" arXiv preprint arXiv:1806.05521 (2018).\n\nParticularly the second paper is a clear improvement over SCL (the earlier pivot based approach), a baseline that is considered by the authors in this work. There are no comparisons against this work in this paper, yet the authors compare against SCL alone.\n\nDue to lack of comparisons against state-of-the-art in Sentiment Analysis/Domain Adaptation for Sentiment Analysis it is hard to accept the claims made by the authors on the superiority of their algorithm. Had their paper aimed at improving over other RL based approaches for Domain Adaptation for Sentiment Analysis, some experiments could be over looked. \n\nBut, when making a claim that addresses the problem of Sentiment Analysis, comparisons against the state-of-the-art non RL based approaches is extremely important. Particularly, given the size of the data sets used, one could use lexical/dictionary based approaches [3] and improve upon the classification accuracies without having to train such an involved algorithm.\n\nFurthermore there is no qualitative analysis provided to gain insights into the behavior of the embeddings spaces of the target and source domains that are learned jointly via the proposed algorithm. At least such an analysis would have provided some insight into why the authors' RL based solution is better than a non RL based solution.\n\nThe lack of reference or comparisons against relevant literature is future highlighted by the seemingly relevant, yet largely dated related works section.\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}