{"title": "Interesting idea, but the novel contributions are unclear and experimental results don't seem to match earlier published results", "review": "This paper proposes a way to use generative modeling (specifically, introspective learning) to handle data variations at test time. \n\nWhile the proposed idea is interesting, many of the core ideas seem to have been proposed in earlier work (Jin et al., 2017; Lazarow et al., 2017; Lee et al., 2018) and the novel contributions of this work are not clearly explained. It would be useful to split Section 3 into background section which reviews prior work and a section which describes the proposed idea and how it differs from prior work. \n\nExperiments: \n- The performance numbers in Table 1 seem quite far from the earlier published results. For instance, the ICN paper reports 6.5% test error on CIFAR and 1.9% test error on SVHN, which are much lower than the results reported in this paper \nhttps://papers.nips.cc/paper/6684-introspective-classification-with-convolutional-nets.pdf. It would be better to similar architectures as the original paper for a fair comparison.\n\n\nOther comments:\n- Section 3: it might be worth making a distinction between the two notions in which generative versus discriminative methods are discussed (i) using a discriminative binary classifier within a generative model and (ii) using the classifier that predicts class labels (e.g. the 10 classes in MNIST). \n- The extension to multi-class problems is only briefly discussed in page 4. Which version (series of one-vs-all or a single CNN classifier) is used in the experiments?  What's the computational complexity and how would it scale with the number of classes?\n- The semi-supervised learning results only discuss GAN-based methods, but there are a lot of VAE-based methods (cf. https://arxiv.org/abs/1406.5298) that would be worth discussing too\n- I think it’s a bit confusing to label the methods \"WGAN-GP\", \"DCGAN\" as these methods uses both CNN for classifier in addition to the generative part.\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}