{"experience_assessment": "I have read many papers in this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review": "This paper proposed a model for imputing missing values and predicting clinical events in time series data. Its contribution lies in incorporating uncertainty,  feature correlations and temporal correlations into GRU when imputing the missing values.\n\nComments:\n\n1. The representation in section 3.2 is rather confusing. Do you learn different inference networks for \\mu_z, \\sigma_z and different generative networks for \\mu_x, \\sigma_x at different time points? If so, please add t as the subscript for all  \\mu_z, \\sigma_z, \\mu_x, \\sigma_x above the uncertainty matrix paragraph. Otherwise, it is confusing when ‘t’ first appears as the subscript of \\sigma_x in the formula of \\hat{\\Sigma}_x, . According to the context of section 3.2, \\sigma_{x,t} is a vector with D elements, since diag(\\sigma_{x,t}) represents a D*D diagonal matrix, the dimension of the matrix [diag(\\sigma_{x,1}), …, diag(\\sigma_{x,T}) ] is D*DT, hence \\hat{\\Sigma}_x cannot \\in R^{T*D} as the author claimed. \n\n2. The introduction section and the related work section is a bit redundant with repeated descriptions of the same reference papers at both sections.\n\n3. For evaluation purposes, the paper performed experiments to compare the proposed model with various baseline models, which is thorough enough in terms of different baselines. However, it only employed one data set. It would be more convincing if it had performed more experiments on other data sets, such as MIMIC-III.\n\n4. There are many places missing articles in front of the singular nouns. E.g. “However, since it is intractable due to involvement of ...” should be “However, since it is intractable due to the involvement of ...”; “As time delay ∆t is essential element to...” should be ”As time delay ∆t is an essential element to...” ; “...our learnable parameters in recurrent imputation network.” should be “...our learnable parameters in a recurrent imputation network.”; “As part of the ablation studies,...” should be “As a part of the ablation studies,...”\n\n5. “...Eq. (1) using negative exponentional rectifier...” should be “exponential”.\n"}