{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "Paper summary\n\nThe authors introduce a missing data imputation network to incorporate correlation, temporal relationships, and data uncertainty, specifically for the problem of data sparsity in EHRs. Their model involves two main portions: an imputation network that feeds into a classification network. They tested the effectiveness of their method by predicting in-hospital mortality rate on the PhysioNet Challenge data from 2012. Their model yields higher AUC on the mortality rate classification task than several other methods. The compared methods are well described, with good explanations of how they differ from the authors' model. In addition to strong experimental results, the introduced model also has some theoretical justification for the additions that they have made to the traditional GRU.\n\nDecision\n\nThe algorithm has been both theoretically and empirically justified, and has valuable contributions for an important application. The performance of the method is encouraging, and the method has novel components. Still, analysis of the experiments would greatly benefit from statistical significance tests when comparing to other methods. This paper still needs some work before it can be accepted.\n\nAdditional feedback\n\nThere are a few things that need to be addressed before the paper should be published. In section 3.2, besides citing the reparameterization trick, the authors are not clear on how much of the VAE is based on existing work. On the other hand, their graphical comparison between the vanilla GRU and their version is very informative. Throughout the paper, the authors need not write out the equations of well-established functions (e.g., cross-entropy loss function).\n\nFigure 3 should have a dotted line for V-RIN and a solid line for V-RIN-full, as the current format is difficult to read in black and white. Lastly, some proofreading and restructuring should be done throughout the paper, as some portions are difficult to read. For example, in both the first sentences of the abstract and the introduction, the word \"comprise\" should not be followed by \"of\" (EHRs store longitudinal data comprising patient's clinical observations in the ICU).\n\nLastly, there would be a stronger argument for the paper if the imputation network were tested on a dataset with naturally missing data, rather than randomly sampling from an existing dataset. This is because there might be certain variables that are more likely to be missing than others, but could offer a strong signal if successfully imputed."}