{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper presented a method that combines VAE and uncertainty aware GRU for sequential missing data imputation and outcome prediction.  \n\nPros:\n>modeling heterogeneous sequential data with missing value is an important task, especially in the healthcare domain.  \n>The presentation of the method is easy to follow. \n>The experiments compared with many baselines \n\nCons:\n>Figure 2 should compare the D-GRU (che 2018) cell which is the baseline as well. Comparing to D-GRU, I am not sure what is the contribution as the GRU-D has considered both the delay \\Delta and the delay \\gamma. Please clarify.\n> Also many works have studied  VAE + sequential model. Combining with the previous point. I don't see sufficient novelty in this work apart from using the standard VAE + sequential formula with D-GRU. \n>How does alpha and gamma from equation (11) been chosen? I guess that the performance is sensitive to these parameters. \n>The experiments are weak as it is only evaluated on one dataset (PhysioNet).\n>Improvement shows in Table 2 are not significant considering std comparing with other methods. \n>There are many VAE based methods for missing value such as [1][2], and the uncertainty is used for downstream tasks [2]. \n>It would be great to have analysis comparing with non-sequential VAE based imputation method etc and discuss which part of the design contributed most to the performance gain. \n\n[1] Mattei, Pierre-Alexandre, and Jes Frellsen. \"MIWAE: Deep Generative Modelling and Imputation of Incomplete Data Sets.\"\n[2] Ma, Chao, et al. \"Eddi: Efficient dynamic discovery of high-value information with partial VAE.\" arXiv preprint arXiv:1809.11142 (2018).\n"}