{"title": "The actual effectiveness of the proposed method is unclear", "review": "\n[Summary]\nThe main purpose of this paper is to propose an extension of relation networks.\nThe proposal consists of two parts: 1) to integrate constraints of dependency syntax to control which relations influence the representation, and 2) utilize a recurrent computation to capture higher-order relations.\n\n[clarity]\nThis paper is basically well written.\nMotivation and goal are clear.\n\n[originality]\nThe idea of utilizing supervised or unsupervised dependency tree as constraints to control which relations influence the representation seems novel and interesting.\nHowever, technically it consists of the combination of the previous methods, such as matrix-tree theorem for calculating conditional probabilities, and structured attention.\nTherefore, the proposed method is incremental rather than innovative.\n\n[significance]\nExperiments on several varieties of datasets revealed that the proposed method consistently improved the performance from the baseline RN.\nIn contrast, it did not outperform the current best scores for all experiments comparing with the current published best methods.\nObviously, we have no reason that we must use RNs for such tasks.\nTherefore, the actual effectiveness of the proposed method in terms of the actual task settings is unclear for me.\nI concern about the actual calculation speed of the proposed method.\nThe proposed method seems to require much higher computational cost against the baseline RNs.\n\n[Questions]\n1, Regarding the approach in general, it would be nice to see how much it depends on the quality of the dependency parse. \nFor example, we cannot always prepare a good parser for experiments on MT such as low-resource languages.\nDo you have any comments for this?\n\n2, Some experimental results showed that “RN intra-attn” was better than “Reccurent RNs”.\nThis implies for me that the higher-order dependency is useless for such tasks.\nAre there any analyses why “Reccurent RNs” did not work well?\n\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}