{"title": "Interesting problem and hypothesis, inconclusive analyses and experiments", "review": "This paper is motivated in an interesting application, namely \"explainable representations\" of patient physiology, phrased as a more general problem of patient condition monitoring. Explainability is formulated as a communication problem in line with classical expert systems (http://people.dbmi.columbia.edu/~ehs7001/Buchanan-Shortliffe-1984/MYCIN%20Book.htm). \nInformation theoretical concepts are applied, and performance is quantified within the minimum description length (MDL) concept.\n\nQuality & clarity \nWhile the patient dynamics representation problem and the communication theoretical framing is interesting , the analyses and experiments are not state of the art. \nWhile the writing overall  is clear and the motivation well-written, there are many issues with the modeling and experimental work.\nThe choice of MDL over more  probabilistic approaches  (as e.g. Hsu et al 2017 for sequences) could have been better motivated. The attention mechanism could have been better explained (attention of whom and to what?) and also the prior (\\beta). How is the prior established - e.g. in the MIMIC case study   \nThe experimental work is carried out within a open source data set - not allowing the possibility of testing explanations against experts/users. \n\nOriginality \nThe main originality is in the problem formulation. \n\nSignificance \nThe importance of this work is limited as the case is not clearly defined. How are the representations to be used and what type of users is it intended to serve (expert/patients etc) \n\nPros and cons\n+ interesting problem\n\n-modeling could be better motivated\n-experimental platform is limited for interpretability studies\n\n== \nHsu, W.N., Zhang, Y. and Glass, J., 2017. Unsupervised learning of disentangled and interpretable representations from sequential data. In Advances in neural information processing systems (pp. 1878-1889).\n\n", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}