{"title": "Comparison with the state-of-the-art is incomplete", "review": "The paper presents an approach for generating 3D shapes as point clouds. The approach consider a lexicographic ordering of points according to the (x, y, z) coordinates and train a model to predict points in order given the previous predictions. The conditional distribution is modeling using a self-attention mechanisms that consider multiplicative interactions between representations.  \n\nThe model is evaluated in two ways. First  for point-cloud generation which is evaluated both qualitatively and for unsupervised learning of point-cloud representations. Second as a decoder for image to shape completion tasks. \n\nComments:\n\n1. Lexicographic overlong of points seems like a poor choice for shape representation. It is sensitive to object rotation, missing parts, etc. \n2. The method is not compared with other approaches for point-cloud generation that have improved over the 3D R2N2 approach the paper compares against. In particular \n    1. AtlastNet and FoldingNet (CVPR 2018) consider parameterization of point clouds as a function of (x,y) coordinates to encoded the 2 manifold nature of the shape.\n\n    2. Multiresolution Tree Networks (ECCV 2018) -- that consider 1D ordering of points obtained from a KD tree ordering of points. This approach is directly comparable to the proposed approach and reports 86.4% accuracy for unsupervised representation learning on ModelNet40 classification. The improvements over the approach that uses fully-connected layers such as PointSetGen (Fan et al, 2017) is marginal (.640 -> 0.656 improvement in IOU). MRTNet and AtlasNet report improvements by a larger margin over PointSetGen. \n\n    3. Other baselines for image to shape generation that generate shapes using hierarchical voxel-based representation (OctTree networks Riegler et al.), view-based models (Lin et al., AAAI 2018), etc. are missing.\n\nIn summary the representation is not well motivated and the evaluation is incomplete. In particular comparison to several recent works on 3D shape generation is missing.", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}