{"rating": "6: Weak Accept", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review": "I think their strong point is at the same time their weak point. \", they do not rely on explicitly specified first-order logic rules.\" My question would be, why not use that information if available as prior knowledge? Perhaps I'd like to see a stronger motivation for the use of having to learn this part. I can see how its might be useful but would be very happy to see more motivation for this. I think I've seen Kotler learn the rules of sudoku but sudoku is such a specified problem that Im not convinced yet this is usueful to learn. Thats a different paper but I missed the motivation for that here too.\n\nI like the honesty of the authors for saying it doesn't scale to larger problems. Regardless, I think this paper is good to push the field in that direction. I particularly like the graph generation task. Graph generation, afaik, is not easy. \n\nWhat I invite the authors to do is to not be restricted by theoretically/principled motivated ways. I believe its better to find things that work well first and then to find a theory (the other way round). This is not enough to reject the paper for me because I do believe this is pushing the field forward in a good direction. If possible I'd suggest to relax the theory and then compare the two models if possible.\n\nIn the contribution it says \"(i) we introduce a new statistical relational model, which\novercomes actual limitations of both classical and recent related models such as \" I would have really liked it to have been spelt out which limitations, very specifically and concisely the paper overcomes in that section.\n"}