{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "This paper proposes a type of conditional Information Bottleneck (IB) that addresses the following problem: given that some features may be expensive to obtain for use in prediction, when should they be obtained such that the overall benefit outweighs the cost? A variant of the IB is proposed to model this question. However, optimization is intractable. The paper replaces a certain non-differentiable operation by a deterministic neural network which outputs the probability of seeking the expensive features. The main application here is reinforcement learning, where an agent could compute some plan or communicate with other agents at a cost, and the goal is to solve the task more efficiently while making use of this additional information. It is shown that the proposed method, VBB, makes judicious use of the limited number of costly feature acquisitions it makes, resulting in improved task performance across 3 tasks.\n\nI am not an expert on the topic, but I find that this paper is well-written and tackles a basic question with effective methods that work well in practice. \n\nHowever, since the problem is so basic, I wonder how it connects to active learning or more specifically \"active feature acquisition\":\n\n-Saar-Tsechansky, Maytal, Prem Melville, and Foster Provost. \"Active feature-value acquisition.\" Management Science 55.4 (2009): 664-684.\n-Shim, Hajin, Sung Ju Hwang, and Eunho Yang. \"Joint active feature acquisition and classification with variable-size set encoding.\" Advances in Neural Information Processing Systems. 2018.\n-Ma, Chao, et al. \"Eddi: Efficient dynamic discovery of high-value information with partial VAE.\" arXiv preprint arXiv:1809.11142 (2018). \n\nMinor:\n- \"((Bahdanau et al., 2014; Mnih et al., 2014; Xu et al., 2015))\": double parentheses\n- \"minimizing unnecessary access? . We compare\": drop the . after ?\n- \"to dynamically adjusts\" --> \"to dynamically adjust\"\n- \"The agent always access the\" --> \"The agent always accesses the\"\n- \"Tables 3a, 3b compares\": no such tables in the paper\n- \"each method acsess the\" --> \"each method accesses the\""}