{"rating": "1: Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I carefully checked the derivations and theory.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "First of all, I must confess that my knowledge is quite limited to read this paper. Perhap the authors present something that I can not catch up at the present.\n\nI conjecture the paper would like to bring the evolution in genetics and perhap brain cirecuits as well to define a novel neural net model, called NNE by the authors. \nThe paper is somewhat cumbersome in the introduction that makes the reader (here is myself) can not understand the main idea. At first the authors introduce about evolution in genetics and genomics that is a bit different from what I known. Then the authors claim that they can show that the brain circuits can evolved in their model.\nThere are so many mistake and/or typos in sentences and in mathematical formulation. These make me can not finish reading the paper. I have to stop reading at the end of Section 2.\nHere are my concerns and questions:\n1). What is \"STDP\" in the 2nd papragraph in Introduction?\n2). in the 3rd papragraph in Introduction: \"Suppose that the brain circuitry for a particular classiﬁcation task, such as “food/not food”,is encoded in the animal’s genes, assuming each gene to have two alleles 0 and 1\". This is realistics, the allels in animal is 0 1 or 2 if encoded.\n3). The authors use the words \"gene, genotype, phenotype\" in a special way that is different to what I known in genomics (in GWAS).\n4).  in the 3rd papragraph in Introduction: \"At each generation, a gene is an independent binary variable with ﬁxed probability of 1\". What do you mean by fixed probability of 1? I can not understand in anysense that I know.\n5). In Section 2, What is n? the authors start the mathematical formulation but I can not find out what is n? Is it the sample size?\n6). In Section 2, paragraph 2, you define y~ \\mathcal{D}, BUT then in all formulas later you denote y ~ D. What is D??? I can not understand.\n7).  In Section 2, paragraph 2, you define a label of y as \\ell(y), BUT then in the 1st sentence of the 3rd paragraph in Section 2 you wrote    L(NNE_x(t), l(y)). What is l(.) here ???\n8). In the equations (1) and (2), what is p^t  ???  You have NOT defined it.\n9). Right after equations (1) and (2), What is \\epsilon ???? Can NOt understand.\n10). The sentence right after the equation (3): \"This is the standard update rule in population genetics under the weak selection assumption.\" This is NOT trivial to me, and even the machine learning comunity, we do not know this rule, it is not obvious. PLEASE provide exact reference.\n11). the first equation in the PROOF of LEMMA 1 wrong  \\mathcal{L} (p^t)  should be equal to E_{x~p^t}  NOT p.\n12). in the PROOF of Theorem 1, I can NOT find out where \\gamma has been defined?\n13). What is d  in Theorem 2? is it the dimension? I make too many guesses !!!\n"}