{"title": "Review for \"Detecting Memorization in ReLU Networks\"", "review": "This paper aims to distinguish between networks which memorize and those with generalize by introducing a new detection method based on NMF. They evaluate this method across a number of datasets and provide comparisons to both PCA and random ablations (as in Morcos et al., 2018), finding that NMF outperforms both. Finally, they show that NMF is well-correlated with generalization error and can be used for early stopping. \n\nThis is an overall excellent paper. The writing is clear and and focused, and the experiments are careful and rigorous. The discussion of prior work is thorough. The question of how to detect memorization in DNNs is one of great interest, and this makes nice steps towards this goal. As such, it will likely have significant impact.  \n\nMajor comments:\n\n1) The early stopping section could benefit from more experiments. In particular, it would be helpful to see a scatter plot of the time of peak test loss as a function of NMF/Ablation AuC local maxima and to measure the correlation between these rather than simply showing 3 examples.\n\nMinor comments: \n\n1) While the comparisons to random ablations are mostly fair, it is worth noting that the variance on random ablations appears to be lower than that of NMF and PCA. \n\n2) The error bars on the plots are often hard to see. Increasing the transparency somewhat would be helpful.\n\nTypos: \n\n1) Section 1, third paragraph: “We show that networks that networks that generalize…” should be “We show that networks that generalize...”\n\n2) Section 3.1, third paragraph: “Because threshold is the…” should be “Because thresholding is the…”\n\n3) Section 3.2, third paragraph: “In the most non-linear case we would…” should be “In the most non-linear case, we would…”\n\n4) Figure 2 caption: “...with increasing level of…” should be “...with increasing levels of…”\n\n5) Section 4.1.1, second to last line of last paragraph: missing space before final sentence\n\n6) Figure 4a label: “Fahsion-MNIST” should be “Fashion-MNIST”\n", "rating": "9: Top 15% of accepted papers, strong accept", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}