{"title": "Review - Diversity is All You Need: Learning Skills without a Reward Function ", "review": "*Pros:*\n-\tMostly clear and well-written paper \n-\tTechnical contribution (learning many diverse skills) is principled and well-justified (although the basic idea builds on a large body of prior work from related fields as also evidenced from the reference list)\n-\tExtensive emperical evaluation on multiple tasks and different scenarios (mainly toy examples) showing promising results.\n\n*Cons:*\n-\tThe main paper assumes detailed knowledge of the actor critic setup to fully follow and appreciate the paper (a few details provided in the appendix) \n-\tp(z): it is not entirely clear to me how the dimensionality of z should be chosen in a principled manner aside from brute force evaluation (as in 4.2.2; which does not go beyond a few hundreds). What happens for many skills and would learning p(z) be preferable in this scenario?\n-\tNote: The work has been in the public domain for some time thereby limiting the apparent novelty. This has not influenced my decision as per ICLR policy. \n\n*Significance*: I think this work would be of interest to the ICLR crowd despite it having been in the public domain for a some time. It provides a simple objective for training RL models in an unsupervised manner by learning multiple diverse skills and contributes with an extensive and convincing empirical evaluation which will surely have a lasting impact in the RL subfield. \n\n*Further comments/questions*:\n-\tThe authors assume that only states and not actions are observable. Intuitively, it would seem easier to obtain the desired results if the actions are also available. Could the authors perhaps clarify why it is reasonable to assume that the actions are not observable to the planner when evaluating the objective in Eq 1?  Similarly, I’d like some insight into the behaviour of the proposed method if actions are also available (and how it differs from prior art in this case)?\n-\tI’d suggest enforcing consistently in the way variation across random seeds is visualised in the figures (e.g. traces in fig 4, no indication in fig5, shaped background in fig 6). \n-\tI’d suggest making it explicit what $\\theta$ refers to in Eq. 1 (and provide some details about the SAC setup for completeness, as previously mentioned)\n-\tMinor typos etc: {p2, l6} missing word, “SAC” never defined, “DOF” never defined, and a few other typos/punctuation issues throughout. \n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}