{"title": "very well written paper, good experiment section, method of communication can be more motivated", "review": "This work is an extension to the work of Sukbaatar et al. (2016) with two main differences:\n1) Selective communication: agents are able to decide whether they want to communicate.\n2) Individualized reward: Agents receive individual rewards; therefore, agents are aware of their contribution towards the goal.\nThese two new extensions enable their model to work in either cooperative or a mix of competitive and competitive/collaborative settings. The authors also claim these two extensions enable their model to converge faster and better. \nThe paper is well written, easy to follow, and everything has been explained quite well. The experiments are competent in the sense that the authors ran their model in four different environments (predator and prey, traffic junction, StarCraft explore, and StarCraft combat). The comparison between their model with three baselines was extensive; they reported the mean and variance over different runs. I have some concerns regarding their method and the experiments which are brought up in the following:\n \nMethod:\n\nIn a non-fully-cooperative environment, sharing hidden state entirely as the only option for communicate is not very reasonable; I think something like sending a message is a better option and  more realistic (e.g., something like the work of Mordatch & Abbeel, 2017)\n\nExperiment:\n\nThe experiment \"StarCraft explore\" is similar to predator-prey; therefore, instead of explaining StarCraft explore, I would like to see how the model works in StarCraft combat. Right now, the authors explain a bit about the model performance in Starcraft combat, but I found the explanation confusing.\n \nAuthors provide 3 baselines:\n1) no communication, but IR\n2) no communication, no IR\n3) global communication, no IR (commNet)\n\nI think having a baseline that has global communication with IR can show the effect of selective communication better. \n\nThere are some questions in the experiment section that have not been addressed very well. For example:\n Is there any difference between the results of table 1, if we look at the cooperative setup? \nDoes their model outperform a model which has global communication with IR? \nWhy do IRIC and IC work worst in the medium in comparison to hard in TJ in table1? \nWhy is CommNet work worse than IRIC and IC in table 2?", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}