{"rating": "1: Reject", "experience_assessment": "I do not know much about this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "This paper proposes a model to embed states and action sequences into latent spaces in order to enable efficient estimation of empowerment in a reinforcement learning system. \n\nThe paper shows some interesting experimental results. But overall, it is not ready to publish yet for the following reasons: \n\n1. The technical section is lack of important description/theorems/derivation/etc that are necessary to support the claims.  \n\nWhat is the detailed definition of empowerment, i.e., how to spell out the formula of mutual information I? What is the distribution of action sequences and states? What is the policy function \\pi? How is \\pi related to or different from \\omega? How is the learned empowerment used in (training) policy? \n\nThe authors proposed a parametrization in equation-3 for state transition and claimed that this parametrization yields ``an efficient estimation of MIAS as explained in the next section’’, but did not give any explanation throughout the paper. Does it mean the equation-4 is easy to solve? Does equation-4 end up that way because of the parametrization in equation-3? Why so? \n\nWhat is the water-filling algorithm? How does it associate the capacity with the empowerment? Elaboration is needed for this bit. \n\nThe authors claim that putting more weight on empowerment in reward ends up in a more conservative policy, but didn’t give any technical justification. They indeed mention that ``a state is intrinsically safe for an agent when the agent has a high diversity of future states’’ and that ``the higher its empowerment value, the safer the agent is’’. The former is a hypothesis and the latter needs technical/derivation support---e.g., why empowerment is correlated with the diversity? The interesting experimental results in figure-6 seem to support the authors’ claim, but precise technical justification is needed. \n\n2. Some technical description/argument should be more precise and accurate. \n\nThe authors claim that they ``observes the current state through its visual sensors’’---but the actual state (i.e. the exact angle and height) can’t be observed and the visual sensor data is only an approximation, so the correct claim should be something like: we observe the visual representation of the actual state. \n\nThe authors claim that the ``existence of such representation ... is one of the contributions of our work’’---the existence of something shouldn’t be a contribution of a technical paper, what can be a contribution is the proof of its existence. \n\nThe authors claim that they ``inject Gaussian noise … into the latent space.’’ This is very confusing: it sounds like (1) there wasn’t any randomness in this formulation; (2) the estimation of empowerment is difficult because of that and (3) the authors added the Gaussian noise to enable the efficient estimation. However, based on my understanding after reading multiple times, I guess what actually happened is: (1) there should be randomness and the noise can be anyway distributed and (2) the authors assumed it is Gaussian so it is simple enough to yield an efficient estimation. The authors should really clarify this. \n\n3. There are also some typos that may confuse readers. \n\nThe authors mentioned that ``a linear Gaussian channel given by Eq. 4.3’’---is it section-4.3 or equation-3?\n\nIn appendix, what is d_z and d_b? \n"}