{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper describes the collection and analysis of a numerical common-sense dataset. The paper also states that a novel regression method is presented for quantifying numerical common sense.\n\nStrengths:\n- the numerical common sense task and its related challenges are presented and motivated clearly\n- the data/annotations and their analysis are presented clearly. The experiment can be replicated reasonably (provided that the data is released, as the authors state)\n\nWeaknesses:\n- the dataset is too small (230 pairs of units and values). Two observations follow from this: (1) such small-scale data is of limited use to state of the art (deep learning) data-hungry approaches; (2) the relatively low cost of crowdsourcing typically results in much bigger datasets. \n- some decisions or definitions seem a bit ad hoc and are not convincing. For instance: in Table 1, why is the apple measured in centimetres but the coffee cup measured in meters? Another example from section 1: why are temperature and weight described as nonphysical scales, but money described as a subjective scale? Another example of a definition: \"similar words share similar units and thus concrete words contains numerical information\". Statements like these are problematic because one could easily think of counter examples where this is not the case.\n- the experimental findings are not based on state on the art methods applied in a setup where the robustness and transferability of the methods on other data and domains has been analysed and discussed. \n\nOverall this work is interesting as a starting point. My advice is to consider scaling up both the data and the methods, and to accompany this by a more comprehensive analysis of limitations."}