{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "Summary:\n- key problem: semi-supervised semantic segmentation;\n- contributions: 1) combine the CutMix data augmentation of Yun et al 2019 with the standard consistency loss of  and the  structured consistency loss of Liu et al 2019, 2) state of the art results on Cityscapes.\n\nRecommendation: Reject\n\nKey reason 1: limited novelty.\n- What is the major difference with French et al 2019? Is it just the addition of the structured consistency loss of Liu et al? Figure 1 is almost identical to Figure 3 in French et al 2019.\n- What is the major novelty / insight besides the direct combination of the aforementioned papers and others like MixMatch (Berthelot et al 2019)?\n- Is the main contribution the faster computation of the structured consistency loss by limiting it to the CutMix boxes?\n\nKey reason 2: limited experimental validation.\n- The performance improvements are all <0.4%: are they statistically significant? What is the variance w.r.t. the random seed (important as the method is heavily relying on sampling random transformations)?\n- I would suggest conducting experiments on more than just one dataset, e.g., by adding COCO and/or Mapillary Vistas.\n- What is the performance of the approach when using only a subset of the labels (e.g., 10%, 25%, 50%) vs the full Cityscapes training set?\n\nKey reason 3: writing could be significantly improved.\n- There are numerous grammatical mistakes and unclear sentences, e.g., \"It regularizes the inter-pixel relationships consistent\", \"a lot of researches were\".\n- Figures 2a and 2b are identical.\n\n\n"}