{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This work proposed a fully stochastic RL method and demonstrated significantly improved performance on multiple tasks.\n\nPros:\n1. The presentation is very clear and easy to read. \n2. The proposed method is sensible \n3, The experimental evaluation shows great practical gain\n\nCons:\n1. The method itself is incremental. As discussed in the related work, this work can be seen as complementary to many related works such as Igl 18, but the novelty of the idea is rather limited. \n2. The claims and the real-benefit of the method may not be consistent. (My biggest concern)\nThe paper claims that full stochasticity contributed to the practical gain but in the experiment Figure 6, we can see the simple filtering does not perform well. \nIt seems that the benefit of the method is rather from such particular latent space design rather than the stochastic vs deterministic. \n3. Continue with the previous point, Figure 2 is not very well motivated and I believe that from Figure 1 to figure 2 design was the most important part of the performance gain. Such important designed was very briefly described without any motivation. \n4. With the previous point, the experiments may be unfair, because, another partially stochastic method can easily utilize such design and further improve the performance. \n5. The related work should add a discussion about stochastic sequential models such as Kalman VAE etc.  paragraph 3 motivates your contribution as VAE does not model sequential information. But there are many works such as the KVAE that are stochastic and models sequential information. \n\n"}