{"title": "Dynamic Pricing with RL", "review": "In this paper, the authors study the problem of Dynamic Pricing. This is a well-studied problem in Economics, Operations Research, and Computer Science. The basic problem is to find the right price for a product based on repeated interaction with the market. The significant challenge in this problem is to figure the right set of prices without knowing the future demand. The authors in this paper propose a deep reinforcement learning based approach to tackle this problem. Algorithms to this problem in the past have made assumptions such as concavity of the demand curve to make it tractable mathematically. In this paper, they do not make assumptions (although they do not provide theoretical guarantees) and one of the contributions of this paper is to handle the full generality of the problem. The other contribution is to test their methods in both offline and real-time setting and compare it against a natural MAB style algorithm (LinUCB to be precise). I have several comments on this paper.\n\nFirst, the paper is not well-written. To begin with, the authors do not formally define the Dynamic Pricing problem. In literature, there are many versions of this problem. Is there limited supply or is the supply unlimited? Should we find the price for a single item or multiple items separately? It is unclear. There are pieces of information across the paper which indicate that the seller is selling multiple products for which the algorithm is pricing separately. I am still unsure about whether the supply is finite or not. Along these lines, the authors should spend some time reading through the draft carefully to fix many grammatical mistakes throughout the paper. \n\nSecond, the authors have missed out some critical related work, both in the related work section *and* in their experimental comparison. The paper Dynamic Pricing with limited supply [Babiaoff et al EC 12] and Bandits with Knapsacks (BwK) [Badanidiyuru et al FOCS 2013] provide MAB style algorithms for this problem. These algorithms overcome the reasoning they provide in their experiments - \n\n\"We noticed that, LinUCB outperformed DRL methods in offline policy evaluation. One of the main reasons is that, MAB methods aim to maximize immediate reward while RL methods maximize long-term reward\". \n\nThe BwK algorithm precisely optimizes for long-term rewards under limited supply constraints. I think it will be useful to add experiments that compare the current approaches of the paper with this MAB algorithm. Overall I find the baselines in this paper to be weak and suggest more experiments and comparison against tougher relevant benchmarks. In fact, they have failed to compare, in any meaningful way, to a long line of work on Dynamic Pricing (the two Besbes and Zeevi papers they have cited for instance). I wonder how the experiments compare against those algorithms. Or they should clearly state why such a comparison is not relevant.\n\nOverall I find the goal to be interesting and novel. But I think the current state of the draft and the experiments make it weak. In particular, the paper falls below the bar on clarity and quality in this current state.", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}