{"title": "Review for Dynamic Pricing on E-commerce Platform with Deep Reinforcement Learning", "review": "The authors proposed a deep reinforcement learning for dynamic pricing problem. The major contribution is on the problem formulation and application end. From the algorithm point of view, the authors adopt the existing deep reinforcement learning algorithms like DQN and policy gradient. The experiments are conducted both online and offline using dataset from Tmall.\n\n[Advantage Summary]\n1. A very interesting application to apply deep RL on dynamic pricing.\n\n2. Experimented on industry dataset based real users. Both online and offline experiments are conducted.\n\n[Weakness Summary]\n1. This is not the first work to apply deep reinforcement learning for dynamic pricing problem as claimed by the authors.\n\n2. Limited technical contribution.\n\n3. Illustration and analysis of the experiment can be further approved.\n\n[Details in weakness and questions]\n\n1. This is not the first work to apply deep reinforcement learning for dynamic pricing problem as claimed author.\nFor instance, \n\"Reinforcement Learning for Fair Dynamic Pricing\"\nSince applying deep RL to dynamic pricing is one of the significant contributions of this paper, this limits the overall contribution.\n\n2.  The technical contribution is very limited by just applying existing algorithms.\n\n3. How to determine the step t seems to be a very important issue that can affect the performance of the algorithm and not well explained. From the experiment, the authors seem to set the period as one-day and update the price daily. But in reality, the time to update the price in a dynamic pricing system should not be a fixed value. For instance, the system should adjust the price in real time if there are changes in the environment(e.g., demand-supply change)\n\n4. Experiment part needs more analysis. For instance, day 16 seems to be an outlier, and conversion rate drops dramatically in the following days. Why? How is the conversion rate from day 16 gets calculated in the final evaluation?", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}