{"title": "Interesting but needs more work: clarifications to existing work and ablations would make this paper more appealing", "review": "This paper proposes a continuous-time gradient flow as an alternative normalizing flow. The formulation is motivated from optimal transport and the Monge-Ampere equation. Symmetry constraints motivated by the use of a potential function can be enforced during training.\n\nI'm surprised [1] was mentioned only for their backpropagation scheme. Much of this paper is similar to theirs, such as Eqs (2) and (3) being the \"instantaneous change of variables\" in [1], the mention of efficient reversibility, experimenting with forward and reverse KL objectives, and parameter efficiency. \n\nGiven the different angle of approach in this work, I'm willing to believe some of this is independently done. This work contains interesting derivations and a different parameterization, with enough contributions to potentially be interesting in its own right. However, I firmly believe in proper attribution and believe [1] should at least be mentioned in the introduction and/or theoretical background. \n\nPros:\n - The potential function and the resulting gradient flow parameterization is interesting.\n - Parameterizing a potential function motivates some symmetry constraints.\n - Interesting application of normalizing flows to the Ising model.\n \nCons:\n - Paper presentation needs some work on clarity.\n - Relation to existing work needs to be clarified.\n - Experiments lack ablations and proper comparisons. e.g. the effect of using symmetry constraints, the effect of using a gradient flow parameterization.\n - If I understood correctly, the symmetry \"constraints\" are really data augmentation during the training phase, rather than hard constraints on the model.\n\nMain questions:\n- It seems the potential function plays a similar role to the negative log-likelihood in [2]. \n- Does having symmetry constraints lead to a better model when the constraints are justified? ie. can you provide comparisons for the Ising model experiment in 4.2?\n- What are the set of constraints you can specify using a potential function? Permutation of the variables is very briefly mentioned in the experiment section, but this could be clarified much earlier. \n- I may have missed this, but what exactly are the symmetry conditions that were used in the experiments?\n- It seems that the proposed permutation constraints could be part of the training algorithm rather than the model. How different would it be if you permute the data samples and use an existing normalizing flow algorithm? ie. can you provide comparisons where randomly permuted data samples are also used during training with existing algorithms?\n- Since you used a fixed-step size solver, do you have some guarantees, theoretical or empirically, that the numerical integration has low error? e.g. what is the reconstruction error from doing a forward and reverse pass, and what would the error be if compared to a much smaller step size?\n\nMinor:\n- The potential function is parameterized directly but is not integrated to infinity. Since the resulting gradient flow is time-invariant, how this would affect the expressivity of the flow? Could a time-variant potential function be used?\n- Eq (5) is also the Liouville equation, which I think should be mentioned.\n- MNIST digits have completely black backgrounds, so I don't understand why Figure 3 samples have grey backgrounds. Could this have something to do with numerical issues in reversing the numerical integration?\n- It's awkward that Figure 3 contains the loss over training for Monge-Ampere flows but only the final loss for the rest. Table 1 sufficiently summarizes this figure, so unless you can show the loss over training for all methods I think this figure is redundant.\n- Equations are referenced both with and without parenthesis. It'd be best if this is consistent across text.\n- There are quite a few grammar mistakes, especially around important digression. (e.g. top of page 3 \"experienced by someone travels with the fluid\" -> \"experienced by someone traveling with the fluid\".)\n- Please use citep and citet properly. Many references should be done using citep (with brackets around the author-year), when the author is a not a part of the sentence.\n\n[1] Chen, Tian Qi, et al. \"Neural Ordinary Differential Equations.\"\n[2] Tabak, Esteban G., and Eric Vanden-Eijnden. \"Density estimation by dual ascent of the log-likelihood.\"", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}