{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The goal of the paper is to identify salient image regions to explain a prediction of a vision model.\n\nThe method proposed is a complex heuristic based on connection weights and activations of the current, previous and successive layer, as well as the neurons already selected in the successive layer. The method makes some intuitive sense, but a lot of the choices seem entirely arbitrary.\n\nSection 3.2 describes a reinforcement learning approach for selecting three scalar parameters to set in the heuristic. Reinforcement learning in this case seems completely unnecessary. The authors could have used a super simple technique like MERT, very common in machine translation for example. Moreover the setting of these three scalar parameters requires some validation data annotated with salient image regions, making the method inapplicable when such data is not available.\n\nThe evaluation of this method is quite interesting. The paper reports that their method is quantitatively better than competitive alternatives in a \"pointing game evaluation\", where the method is tasked with identifying salient points within a ground truth bounding box, and an \"increate in performance\" evaluation, where the method is tasked with producing a bounding box which should increase the confidence of the model's decision. A number of subjective evaluations are also presented to show that the method indeed works reasonably well.\n\nThe paper would benefit greatly in my opinion from a simpler exposition of the method, from dropping the reinforcement learning step if possible, and from investigating some theoretical backing for the chosen method."}