{"title": "An interesting method to improve transfer learning between related tasks. The motivation is strong, explanations are intuitive, technical parts are solid, experiments are sufficient. ", "review": "This paper propose an intermediate stage before transfer learning on playing new games that is with slight visual change. The intermediate stage is basically a mapping function to translate the images in the new game to old game with certain correspondence. The paper claims that the adding of intermediate stage can be much more efficient than re-train the model instead. \nThen the paper compares different baselines without the mapping model. The baselines are either re-trained from scratch or (partially) initialized with trained model. The learning curves show that fine-tuning fails to transfer knowledge from the source domain to target domain. The mapping model is constructed based on unaligned GAN. And the experiments are setup and results are shown.\n\nPros:\n+ The paper makes a very good start from analogizing human being adjusting himself between similar tasks. \n+ The paper demonstrates strong motivation on improving the existing transfer learnings that are either fail or take too much time to train from scratch.\n+ The paper clearly illustrate the learning curve of multiple approaches for transferring knowledge across tasks.\n+ The paper proves detailed analysis why using unaligned GAN to learn the mapping model, and gives\n+ I also like the experiment section. It is well written, especially the discussions section answer all my questions. \n\nQuestions:\n1.\tWhy fine-tuning from a model that is trained from related task does not help, even decelerate the learning process? Could you explain it more?\n2.\tCould you please also include in figure 2 the proposed transfer learning curve with the mapping model G? I’m curious how much faster it will converge than the Full-FT. And I suppose the retrain from scratch can be extremely slow and will exceed the training epoch scope in the figure.\n3.\tIn dataset collection, you use untrained agent to collect source domain image. Will it improve the results if you use well trained agent, or even human agent, instead? \n4.\tI hope, if possible, you can share the source code in the near future.\n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}