{"experience_assessment": "I do not know much about this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposes to apply mixture density estimation model on the offset regression problem in human pose estimation. The main motivation is to model the multi-modal nature of human pose and improve spatial accuracy. So the mixture density network proposed in this paper tries to first extract the viewpoint, which is the dominant multi-modal factor, and then any spatial regression problem can use the viewpoints to obtain higher accuracy.\n\nI am not quite in this field, but I have the following concerns of this paper:\n\n1. The objective (6) is a combination of 6 loss, which includes a binary classification, keypoint heatmap, offset regression, and so on. However, when these small problems are trained together (with even different weights), I was wondering how the importance is determined and how the performance was a tradeoff between the small losses. I know this is from the previous paper, but the intuition is not very clear. Moreover, things may need to be changed after the components get changed.\n\n2. Density estimation is considered as a difficult problem in high dimensional data, even using deep neural networks. This paper focuses on using it to model the conditional probability of a pose (offset vector) given an image, which can still be high (input is an image and output is 2K dimension vector). So I was wondering how the performance varies with the dimension of input and output data.\n\n3. I cannot find any comparison of the proposed method with the original L1 loss. The paper claims it’s in Table 3, but it’s not. \n\n4. The writing of the paper could be significantly improved.\n"}