{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper brings to our attention the problem of privacy-preserving representation learning.\nThe assumption in this work is that the data feature can be split into two parts: private and non private.\n\nThe authors propose to use VAE with additional regularizer terms to learn hidden representations that would encode both private and non-private part as independent as possible.\nThere are two scenarios considered:\n1) supervised disentanglement, total of 4 terms (two for public part, two for private part) are added to the VAE loss.\n2) weakly-supervised disentanglement: in this setting, downstream task is unknown and only two terms are added tot he VAE loss: one to penalize the classifiability using private information in the public z space, and other to promote the classifiably using private information in the private z space.\n\nOverall, I think it is a well-stated problem and this work seems to get some positive results on CelebA dataset. However, a few questions must be clearly addressed:\n1. Eqn 6 is derived from Eqn 2 and Eqn 5. please clean up the notation on L terms. Currently they are not consistent and L_i and L_j are not defined.\n\n2. In section 3.3, the authors mention the optimization is nontrivial. Can you expand on that? current section 3.3 is too short for the readers to appreciate that non-triviality.\n\nOther comments:\nOn Page 1, \ngrowing privacy concerns will entails —> entail\nthe \"Glass / gender\" example doesn’t make sense to me. why glass is considered non-private while gender is private? maybe we should use another example here.\n\nOn Page 2,\n penultimate paragraph, where it used as —> where it is used as …\nWhile the latter encourage preserving —> encourages\nThis two additional terms —> these two additional terms\n\nPage 7, Figure 2 caption needs rewriting.\n\n\n"}