{"title": "Original contribution unclear", "review": "The paper W2GAN describes a method for training GAN and computing an optimal transport (OT) map\nbetween distributions. As far as I can tell, it is difficult to identify the original contributions\nof the paper. Most results are known from the OT community. The differences with the work of Seguy, 2018\nis also not obvious. I encourage the authors to establish more clearly the differences of their work\nwith this last reference. Most of the theoretical considerations of Section 3 is either based on \nunrealistic assumptions (case 1) or make vague assumptions 'if we ignore the possibly significant effect ...'\nthat seem unjustified so far. Experimental results do not show evidences of superiority wrt. existing works.  \nAll in all I would recommend the authors to better focus on the original contribution of their works wrt.  \nstate-of-the-art and explain why the theoretical analysis on convergence following a geodesic path in a \nWasserstein space is valuable from a practical view. Finally, I did not understand the final claim of the \nAbstract : 'Perhaps surprisingly, we also provide empirical evidence that other GANs also approximately following\nthe Optimal Transport.'. What are those empirical evidences ? It seems that this claim is not supported somewhere \nelse in the paper.\n\nMinor remarks:\n - regarding the penalization in eq. (5), the expectation is not for all x and y \\in R^2, but for x drawn from \\mu and y from \\nu.\n   Same for L_2 regularization\n - Proposition 1 is mainly due to Brenier\nBrenier, Y. (1991). Polar factorization and monotone rearrangement of vector‐valued functions. Communications on pure and applied mathematics, 44(4), 375-417.\n - from Eq (7), you should give precisely over what the expectations are taken.\n - Eq (10) : how do you inverse sup and inf ? \n - when comparing to Seguy 2018, are you using an entropic or a L_2 regularization ? How do you set the regularization strength ?\n - where is Figure 2.a described in section 4.2 ? \n\nRelated works :\n - what is reference (Alexandre, 2018) ?  \n - regarding applications of OT to domain adaptation, there are several references on the subject. \n   See for instance \nCourty, N., Flamary, R., Tuia, D., & Rakotomamonjy, A. (2017). Optimal transport for domain adaptation. IEEE transactions on pattern analysis and machine intelligence, 39(9), 1853-1865.\nor \nDamodaran, B. B., Kellenberger, B., Flamary, R., Tuia, D., & Courty, N. (2018). DeepJDOT: Deep Joint distribution optimal transport for unsupervised domain adaptation. ECCV \nfor a deep variant.\n - Reference Seguy 2017 and 2018 are the same and should be fused. The corresponding paper\n   was published at ICLR 2018\n   Regarding this last reference, the claim 'As far as we know, it is the first demonstration of a GAN achieving reasonable generative modeling results and an approximation of the optimal transport map between two continuous distributions.' should maybe be lowered ? ", "rating": "3: Clear rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}