{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper proposes a new black-box adversarial attack method called TREMBA, in which the search for the “adversary” is done in a reduced space z. Summary of its contributions:\n-\tA attack method that improves query efficiency of black-box attack\n-\tProduces perturbations that are effective across different networks\n-\tImproves attack success over SOTA defended networks \n\nIn general, the paper is very well written, with clear mostly clear exposition and sufficient experimental verification. What follows are the itemized pros and cons (mostly just points that would be good to address):\n\n[pros]:\n-\tWell written\n-\tA good overview of previous methods and how the TREMBA fits within them\n-\tSufficient experimental validation\n\n[points to address]\n-\tIn Black-Box Attack method of related works, did you mean to say, “Targeted attack is much harder than un-targeted attack for transfer-based method.”?\n-\tYou ought to explain what NES is - Natural Evolution Strategies – and the general description of the method, as it is a major part of your algorithm (Section 3.2). It took two papers to find what NES stands for.\n-\tIn section 3.2 you write – “The sign function provides an approximation of the gradient, …” – is there a citation that should go with this claim? \n-\tMake sure to explain all of the variables in the paper, e.g. $\\omega_k$ in Eq. (3) or $\\nu_k$ in Eq. (4).\n-\tIS there a particular reason you chose the hinge loss to train the generator? Could you have used other losses instead?\n-\t“A higher value of $\\kappa$ laeds to higher transferability to other models” – maybe a citation required? Or else more intuition?\n-\tAdding specifics about ConvNet1, ConvNet2\n-\tHow did you set $\\epsilon$ ?\n-\tWould changing the sample size for each method improve the performance for respective methods?\n-\tIt would have been interesting to include a Future Works section\n-\tA more thorough discussion why the models works so well.\n"}