{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "*First of all, TBH, I'm not very familiar with the field of reward inference / inverse reinforcement learning, my assessment to the paper is only based on educational guess.*\n\nThe paper proposes a surprising insight that reasoning about irrationality of human experts could help better reward inference, which is trying to get the reward function from human expert demonstrations. The authors start from Bellman update and try to add different modifications to the Bellman update to see how different types and levels of rationality affect the reward inference. The proposed modifications include adding Boltzmann sampling instead of taking a max, tuning different levels of optimism and pessimism, transforming the reward in specific way, change the discount into myopic discount or into hyperbolic discounting, and so on.\n\nThe authors conduct an experiment on a small 5x5 gridworld and find that most changes to introduce irrationality into the Bellman update have led to lower log loss than the rational expert, which demonstrates that the proposed irrationality methods are effective on reward inference. In Figure 4 and Figure 5, the authors show a few specific examples on how different types of irrationality and different levels of them could affect the policy's behavior. \n\nThe major limitation of the paper (the authors also mention it in Page 8) is that the proposed method is quite hard to generalize into many environments. The usefulness of the irrationality depends a lot on the environments and the authors may have to conduct more extensive experiments to make their claims solid."}