{"title": "Not enough analysis", "review": "Please consider this rubric when writing your review:\n1. Briefly establish your personal expertise in the field of the paper.\n2. Concisely summarize the contributions of the paper.\n3. Evaluate the quality and composition of the work.\n4. Place the work in context of prior work, and evaluate this work's novelty.\n5. Provide critique of each theorem or experiment that is relevant to your judgment of the paper's novelty and quality.\n6. Provide a summary judgment if the work is significant and of interest to the community.\n\n1. I am a researcher working at the intersection of machine learning and\nbiological vision.  I have experience with neural network models and\nvisual neurophysiology.\n\n2. This paper makes two contributions: 1) It develops Brain-Score - a\ndataset and error metric for animal visual single-cell recordings.  2)\nIt develops (and brain-scores) a new shallow(ish) recurrent network\nthat performs well on ImageNet and scores highly on brain-score. \n\n3. The development of Brain-Score is a useful invention for the field.  A nice\naspect of Brain-Score is that responses in both V4 and IT as well as behavioral\nresponses are provided.   I think it could be more useful if the temporal dynamics (instead of the\nmean number of spikes) was included.    This would allow to compare temporal\nresponses in order to compare \"brain-like\" matches.\n\n4. This general idea is somewhat similar to a June 2018 Arxiv paper\n(Task-Driven Convolutional Recurrent Models of the Visual System)\nhttps://arxiv.org/abs/1807.00053\nbut this is a novel contribution as it is uses the Brain-Score dataset.\n\nOne limitation of this approach relative to the June 2018 ArXiv paper\nis that the Brain-Score method is just representing the mean neural\nresponse to each image - The Arxiv paper shows that different models\ncan have different temporal responses that can also be used to decide\nwhich is a closer match to the brain.\n\n5. More analysis of why CORNET-S is best among compact models would greatly\nstrengthen this paper.  What do the receptive fields look like?  How do they compare\nto the other models.  What about the other high performing networks (e.g. DenseNet-169)?\nHow sensitive are the results to each type of weight in the network?   What about feedback connections\n(instead of local recurrent connections)? \n\n6. This paper makes a significant contribution, in part due to the\ndevelopment and open-sourcing of Brain-Score.  The significance of the\ncontribution of the CORnet-S architecture is limited by the\nlack of analysis into what aspects make it better than other models.\n\n\n\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}