{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "N/A", "review": "This submission aims to understand whether common sense and semantic understanding can benefit in a room navigation task. The authors design several interesting auxiliary tasks to understand the significance of common sense and semantic understanding for room navigation. They conduct experiments to understand the importance of each auxiliary task empirically.\n\nHowever, the clarity and quality of writing is poor which makes it difficult to follow the manuscript at many places and evaluate its significance. Some auxiliary tasks are not defined well, several ideas are not motivated well and some paragraphs seem unnecessary. I find the experiments inconclusive due to lack of statistical significance testing, insufficient data, and inadequate hyperparameter tuning. More details in the following comments.\n\nComments on Section 3:\n\n- The agent architecture description is not easy to follow. Terms are used without defining them. For example, acronyms CS and SU are stated in Sec3 Baseline model without defining what they stand for or what they mean, in Sec 3 Input, what are “ generating grounding questions”?. There are too many acronyms to keep track of and they are often unintuitive until you read the whole section. There are many cross-references between paragraphs which makes it very difficult to follow the description. For example, In Section 3.1 “generic sequence of rooms (between source and target room) generated by the common sense planning module (CS_RS)”. Here, what is a generic sequence of rooms? How are they generated? What is the common sense planning module? Why is it abbreviated CS_RS? \n\n- Why is Das et al. (2017a) cited for LSTM baseline? I can think of many papers before this doing reinforcement  and Imitation learning using LSTMs or recurrent networks.\n\n- I do not understand the motivation behind the proposed method of self-supervised learning. The prediction of SU_RD (room detection) is used as labels for fine-tuning SU_CR (current room detection) and SU_PN (post navigation grounding) in unseen environments. Why would SU_RD generalize well on unseen environments but not SU_CR and SU_PN?\n\n- What is the need for SU_CR (current room detection) when SU_RD (room detection) already consists of current room? Why not just use SU_RD as an auxiliary task for SGN instead of SU_CR?\n\n- The motivation behind SU_PN is unclear. Why does the agent need to remember which rooms during the trajectory when it stops? How is this supposed to help in navigation?\n\n- The definition of some auxiliary tasks is not clear. It is not clear how the labels were generated for some auxiliary tasks. What are the left, front and right rooms in SU_RD? Do they need to be visible in the current image or does the agent need to predict likely rooms which are behind walls? What if there are multiple rooms in one direction? The CS_RS task is also not defined clearly. It seems from Figure 2 that the input to the CS_RS model is the sequence of rooms in the ground truth trajectory but it is not stated anywhere. What is it predicting? What are “generic room sequence patterns”?\nHow are the labels of CS_RS, SU_RD generated?\n\n- If CS_RS is taking the sequence of rooms in the ground truth trajectory as input, the model makes a strong assumption of having access to sequence of rooms to reach the target room at test time. It also makes the comparison to the baseline unfair. If it is not taking sequence of rooms as input, what is the input to the CS_RS model?\n\n\n\nComments on Section 4:\n\n- What is the meaning of ‘games’ in this context? I am assuming trajectories.\n\n- What hyperparameters were tuned using the validation set?\n\n- Looking at the results in Table 1, I am not sure whether the difference in the performance of different models is significant or not. I believe statistical significance tests need to be conducted especially because the difference between the performance of different models is small and the test set consists of only 324 trajectories, which are further split into easy, medium and hard sets. \n\n- The performance of several models is unintuitive in many places. For example, the performance of CS_RS lower than baseline in medium trajectories, CS_RS improves the performance when added to CS_Nxt in easy and medium but not in hard, SU_PN is better than SU_CR in medium but not in easy, however, SU_PN+CS_Nxt is better than SU_CR+CS_Nxt in easy but not in medium. SU_PN+SU_RD is worse than SU_CR+SU_RD across all settings but SU_PN is overall better than SU_CR. The authors have provided some explanation for some of the above but not for all. I am suspecting that many of the above observations are due to the variance in the results, because of small test sets and not due to the difference in auxiliary tasks. And this again raises questions about the statistical significance of all the results.\n\n- Several statements in the results indicate inadequate hyperparameter tuning such as “We hypothesize that hyperparameter tuning is important in combining different modules” and  “the performance generally degrades as the agent tends to focus more on the auxiliary tasks than the action prediction task”. I believe it is essential to tune the hyperparameters for auxiliary tasks if the goal is to understand the importance of auxiliary tasks empirically. \n\n- What is the purpose of Section 4.2? What are we supposed to learn from this experiment?\n\n- It is not clear how are the embeddings visualized in Sec 4.4 and Figures 5 and 6. How are the embeddings projected in two dimensions? How are they aligned?\n\n\n\nSuggestions for improvement:\n\n- The writing can be improved significantly. I suggest first describing all the auxiliary tasks and then describing the agent architecture for training the auxiliary tasks. The description of auxiliary tasks can be improved, especially SU_RD and CS_RS.\n\n- I suggest increasing the size of the test set and performing statistical significance tests for making sure that the difference in performance numbers is not due to noise/variance. \n\n- The manuscript needs to be proof-read. There are some grammatical errors."}