{"title": "Interesting idea, weak eval", "review": "The authors propose an interesting idea of generating synthetic data sets for ride sharing. In particular, they split the space/time into small spatial/temporal cells (50mx50m and 5min) each containing number of requests (or a scaled version of it), and train a conditional GAN to output these cell values given an input 5-min time label. They validate the results using metrics from graph and fractals theory.\nWhile the idea is interesting, the execution of the paper is lacking. Some details are missing and especially key things such as metrics should be explained better.\n- How is the data represented? It says that pixel represents the number of ride requests, how exactly? Then, in the next paragraph it is said that pixel represents presence/absence of ride requests, so which one is it. This is a critical part of the proposal and is not well explained.\n- y-axis in Figure 2 is not explained.\n- Metrics should be better explained. How are edges defined, when you only model requests, not destinations? This is far from being clear.\n- In addition, how is D2 defined? Do we compute one for each time, or how? What exactly is \"side e\", what is a \"side\" here? Basically both metrics are not well defined.\n- \"We can claim strong similarity ...\", what is this justified by?\n- Second paragraph in Section 3.1 is not clear, reads very strangely.\n-  Labels are being mentioned before being defined, adding to confusion.\n- It is clear from Figure 2 that workdays and weekends are very different, yet the authors chose to ignore that fact during modeling. They do mention that we can choose any labeling we want, but still strange that for the experiments this was not taken into account.\n- The authors mention that cells as 1.2km x 1.2km, but Figure 3 shows much different resolution. Seems that the figure is just given as an example, but reading the text one gets an impression that the figure was actually used in the paper. This needs to be clarified.\n- For the classifier, it says that \"time sequence of the data\" is a label, what does this mean? You mean the actual label, or some time sequence? This is confusing, although it seems that simply the 5-min label was used.\n- Could we add the metrics to the loss, to enforce them as the authors say that that would result in strong similarity?\n- One of the major flaws of the paper is missing baseline. It is very difficult to appreciate the results without any reference result.\n- Again, I am not sure how results in Section 5.2 are computed when only requests are modeled.\n- Footnote 2 in the conclusion mentions baselines, yet there are none mentioned in the paper.", "rating": "4: Ok but not good enough - rejection", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}