{"title": "CoVAE", "review": "The paper presents a VAE that uses labels to separate the learned representation into an invariant and a covariant part. The method is validated using experiments on the MNIST dataset.\n\nThe writing in this paper is somewhat problematic. Although it is hard to put the finger on a particularly severe instance, the paper is filled with vague and hyperbolic statements. Words like \"efficiently\", \"meaningful\", \"natural\", etc. are sprinkled throughout to confer a positive connotation, often without having a specific meaning in their context or adding any information. Where the meaning is somewhat clear, the claims are often not supported by evidence. Sometimes the claims are so broad that it is not clear what kind of evidence could support such a claim.\n\nA relatively large amount of space is used to explain the general concept of invariant/covariant learning, which, as a general concept, is widely understood and not novel. There are other instances of overclaiming, such as \"The goal of CoVAE is to provide an approach to probabilistic modelling that enables meaningful representations [...]\". In fact, CoVAE is a rather specific model(class), rather than an approach to probabilistic modelling.\n\nThe paper is at times meandering. For instance, the benefits of and motivation for the proposed approach are not simply stated in the introduction and then demonstrated in the rest of the paper, but instead the paper states some benefits and motivations, explains some technical content, mentions some more benefits, repeats some motivations stated before, etc.\n\nMany researchers working on representation learning hope to discover the underlying learning principles that lead to representations that seem natural to a human being. In this paper, labels are used to guide the representation into the \"right\" representation. It is in my opinion not very surprising that one can use labels to induce certain qualities deemed desirable in the representation.\n\nTo conclude, because of the writing, limited novelty, and limited experiments, I think this paper currently does not pass the bar for ICLR.", "rating": "4: Ok but not good enough - rejection", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}