{"title": "Very interesting finding; insufficient empirical analysis, theory with approximations too bold", "review": "Pros:\n- The finding that SVHN has larger likelihood than CIFAR according to networks is interesting. \n- The empirical and theoretical analyses are clear, seem thorough, and make sense.\n- Section 5 can provide some insight when the model is too rigid and too log-concave (e.g. Gaussian).\nCons:\n- The premises of the analyses are not very convincing, limiting the significance of the paper.\n- In particular, Section 4 is a series of empirical analyses, based on one dataset pair. In 3/4 of the pairs the author tried, this phenomenon is not there. Whether the findings generalize to other situations where the phenomenon appears is uncertain. \n- It is good that Section 5 has some theoretical analysis. But I personally find it very disturbing to base it on a 2nd order approximation of a probability density function of images when modeling something as intricate as models that generate images. At least this limitation should be pointed out in the paper.\n- Some parts of the paper feel long-winded and aimless.\n\n[Quality]\nSee above pros and cons.\nA few less important disagreement I have with the paper:\n- I don't think Glow necessarily is encouraged to increase sensitivity to perturbations. The bijection needs to map training images to a high-density region of the Gaussian, and that aspect would make the model think twice before making the volume term too large.\n- Figure 6(a) clearly suggests that the data mean for SVHN and CIFAR are very different, instead of similar.\n\n[Clarity]\nIn general, the paper is clear and easy to understand given enough reading time, but feels at times long-winded.\nSection 2 background takes too much space.\nSection 3 too much redundancy -- it just explains that SVHN has a higher likelihood when trained on CIFAR, and a few variations of the same experiment.\nSection 4 seems to lack a high-level idea of what it want to prove -- the hypothesis around the volume term is dismissed shortly after, and it ultimately proves that we do not know what is the reason behind the high SVHN likelihood, making it look like a distracting side-experiment.\nA few editorial issues:\n- On page 4 footnote 2, as far as I know the paper did not define BPD.\n- There are two lines of text between Fig. 4 and Fig. 5, which is confusing.\n\n[Originality]\nI am not an expert in this specific field (analyzing generative models), but I believe this analysis is novel.\nHowever, there are papers empirically analyzing novelty detection using generative model -- should analyze or at least cite:\n    Vít Škvára et al. Are generative deep models for novelty detection truly better? \n    ^ at first glance, their AUROC is never under 0.5, indicating that this phenomenon did not appear in their experiments although a lot of inlier-novelty pairs are tried.\nA part of the paper's contribution (section 5 conclusion) seem to overlap with others' work. The section concludes that if the second dataset has small variances, it will get higher likelihood. But this is too similar to the cited findings on page 6 (models assign high likelihood to constant images).\n\n[Significance] \nThe paper has a very interesting finding; pointing out and in-depth analysis of negative results should benefit the community greatly.\nHowever, only 1 dataset pair is experimented -- there should be more to ensure the findings generalize, since Sections 3 and 4 rely completely on empirical analysis. According to the conclusions of the paper, such dataset pairs should be easy to find -- just find a dataset that \"lies within\" another. Did you try e.g. CIFAR-100 train and CIFAR-10 test?\nSection 5 is based on a 2nd order expansion on the $log p(x)$ given by a deep network -- I shouldn't be the judge of this, but from a realistic perspective this does not mean much.\n", "rating": "7: Good paper, accept", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}