{"experience_assessment": "I do not know much about this area.", "rating": "6: Weak Accept", "review_assessment:_thoroughness_in_paper_reading": "I made a quick assessment of this paper.", "review_assessment:_checking_correctness_of_experiments": "I did not assess the experiments.", "title": "Official Blind Review #3", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review": "Summary:\nAs the title suggests the paper focusses mostly on a negative result:\nMutual information (MI) estimators obtained by variational methods have severe\nlimitations that make them potentially not useful for down stream tasks.\nBesides highlighting the problems with variational MI estimators the authors\nsuggest a modification to slightly improve the performance of MI estimators\nbased on partition functions by reducing their variance when MI is high.\n\nThe authors give a good overview / introduction of various approaches to\nvariational MI estimation by discriminative and generative methods.\nGenerally, MI estimation involves the estimation of the KL divergence between\nthe joint distribution and the product of the marginals.\nThe authors present a unifying view on the different approaches that optimizes\nthe log density ratio required for the KL divergence over the space of\nlog density ratios.\nDiscriminative approaches model the density ratio directly (through e.g. neural\nnetwork models) and generative approaches model the separate densities\n(as generative models where it is possible to evaluate the (conditional)\nprobabilities / likelihoods of the data generating process).\n\nThe authors prove that discriminative approaches that are based on the partition\nfunction approach suffer from high variance where mutual information is high\n(Theorem 2).\nThe estimator based on a finite sample has high variance even if the density\nratio approximation is correct.\n(The partition function approach is a way of staying constrained to the log\ndensity ratio function space.)\nThis high variance problem is something that has previously been observed\nempirically and is the main theoretical point that is being made about\nlimitations of MI estimators.\n\nIn order to slightly alleviate the problem of high variance the authors suggest\na way of biasing MI estimators by clipping the density ratio estimates\nthrough a constant chosen as a hyper-parameter.\nThey prove that their clipping approach reduces variance and therefore\nintroduces a bias variance tradeoff.\n\nIn their later experiments the clipped version of the discriminative approach\nperforms much better in terms of variance than without clipping and also better\nthan a generative approach.\n\nIn order to empirically evaluate the quality of MI estimators the authors\nsuggest three criteria that they call self-consistency:\n(i) independence, (ii) data processing, (iii) additivity\n\nSelf-consistency is evaluated experimentally on images where mutual information\nis computed between original image and image with part covered.\n\nThe authors claim and experimentally show that discriminative approaches fail\nin (iii) and generative approaches fail in (i), (ii).\nOverall, variational MI approaches do not satisfy self-consistency.\n\nEvaluation:\nI suggest to accept the paper.\nThe theoretical contribution of showing the variance limitation of\ndiscriminative approaches seems significant.\nThat insight leads to the idea that clipping can be a useful bias that\nsignificantly reduces variance without making the already biased anyways\nresults much worst in the experiments.\nHowever, I also feel like the paper is not yet as focused as it could be.\nIt contains many concepts that could need a little bit more space.\n\nSuggestions:\n- Page 2: Nitpick, but in the definition of $L^p(Q)$ using $\\colon$ twice is\n\tnot super readable on the first read\n\n- Page 2: In the definition of $I_{BA}$ clearify whether $p(x)$ is a marginal\n\tor a joint density (as $P$ is the cumulative joint)\n\n- Page 3: In Theorem 1 what is the definition of $P \\ll Q$?\n\tThis suggests an order on the space of measures $\\mathcal P$?\n\n- Page 3: \"Obtain an density ratio estimate\" -> Obtain a density ratio estimate\n"}