{"title": "summary of known ideas / no new ideas / no better results than other from the SR literature", "review": "The authors target single-image super-resolution (SR) task and study the efficiency (runtime, memory) of the current neural networks.\n\nOn the positive side, the paper is a good effort of bringing together works and insights related to efficient designs and efficient SR solutions.\n\nIf we report to the baseline architecture (RCAN) then the proposed efficient variants achieves large reductions in number of parameters or multiplications-additions, at the cost of lower accuracy. However, when the newly proposed trade-offs are compared with the existing literature, we see other methods that do a comparable or better job in the same range.\n\nOn the negative side, from my point of view, the study is far from being thorough and does not lead to or bring new insights or ideas. The experimental results does not reveal new operating points (trade-off between complexity/operations and performance accuracy).\n\nI would suggest to the authors to expand their study, to make some novel observations, and to propose some designs that can stand out in the literature.\n\nI am pointing out also to some recent papers that are related to the topic and can be or are applied to SR:\nGu et al, \"Multi-bin Trainable Linear Unit for Fast Image Restoration Networks\", arxiv 2018\nIgnatov et al, \"Pirm challenge on perceptual image enhancement on smartphones: Report\", arxiv 2018\nand some works proposed for that challenge:\nVu et al, \"Fast and efficient image quality enhancement via desubpixel convolutional neural networks\", ECCVW 2018\nLi et al, \"CARN: Convolutional Anchored Regression Network for Fast and Accurate Single Image Super-Resolution\", ECCVW 2018\nPengfei et al, \"Range scaling global u-net for perceptual image enhancement on mobile devices\", ECCVW 2018\n\n", "rating": "4: Ok but not good enough - rejection", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}