{"experience_assessment": "I do not know much about this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "# Review ICLR20, Self-Supervised Learning of Appliance Usage\n\nThis review is for the originally uploaded version of this article. Comments from other reviewers and revisions have deliberately not been taken into account. After publishing this review, this reviewer will participate in the forum discussion and help the authors improve the paper.\n\n\n## Overall\n\n**Summary**\n\nThe authors introduce a new method for classifying which appliance was turned on by looking at the change in total household electricity consumption and tracking people's coarse positions in the house.\n\n\n**Overall Opinion**\n\nThe paper is concise and interesting, but for now, I have to reject it because the same major things aren't clear to me:\n\n- Why are you doing this, to begin with, i.e. \"... to optimize energy consumption\"?. What does energy consumption have to do with classifying which appliance was turned on? There might be the rare edge case of a fridge door left open accidentally but that can't be the main argument here, can it?\n- Now, assuming that there is a benefit to this, why can't we use the smart plugs all around? You already use them to provide ground truth. But I imagine they are cheap and easy enough to distribute at large scale, whereas the location sensor was custom-built by you if I understood correctly and probably has to be calibrated for every house.\n\nOther than that, the paper is pretty good. Here are some minor...\n\n## Specific comments and questions\n\n- I got slightly disappointed when I picked up the paper because I was in a robotics mindset and assumed \"Self-supervised learning of appliance usage\" was some new way for a robot to analyze appliances and push buttons. I'd add a \"human\" in the title for clarity, e.g. \"Self-supervised Learning of Human Appliance Usage\" or \"Self-supervised Learning of Appliance Usage from Human Location Data\". But that's just my opinion, no pressure on this one.\n\n### Abstract\n\n- Please never repeat sentences from the abstract in the introduction or vice versa, good as they might be.\n\n### Intro & Rel. Work\n\nall good\n\n### Problem Formulation\n\n- Please always provide a proper caption for your figure so that the caption contains enough information for the reader to understand what's going on in the figure without having to search for it in the main text. This applies to Fig.1 and even more so to Fig.2 where I'd recommend explaining in broad strokes the information flow.\n- Fig. 1 (a) Why is there higher power usage between 02-06 compared to 14-18 o'clock? Is that a heater as the outside temperatures drop overnight? (c/d) I don't think that's a good way of visualizing this. I don't get anything out of diagram (c) and I'd prefer it if you could encode the time aspect in the diagram (d) as color/alpha. E.g. blue agent's oldest position is almost imperceptibly white, growing bluer and darker as the data points get closer to the final step in the recording.\n\n### Model\n\n- Doesn't the softwax require to know the number of appliances a priori?\n- How do you deal with $\\alpha$ and $P_t$ when a person is at the edge of the visible space? Does this cause problems during training or did this never occur? I could imagine, since the location is noisy, a person could jump in and out of the visible area and cause training instability.\n\n### Datasets\n\nall good\n\n### Results\n\n- What's \"Door / leaving\" in Table 2? Which appliance is this?\n- I think the standard at ICLR is to have the table and figure captions both below the respective objects\n- The last 3 sections, 6.3 to 6.5, read a bit rushed and might need a rewrite for clarity. \n- Fig. 5 is nice. But shouldn't the signal add up to explain the entire scene? There's a bit of blur next to the couch. Is this a training set vs test set artifact?\n\n### Conclusion\n\n- This needs to be developed a bit more: what are some downsides to your method? Where does it NOT work or what makes it prone to error? And what are future directions based on this work? What's worth researching further or have you solved appliance use detection for good?\n\n---\n\nI'm sure there are some good answers for my main concerns outlined at the beginning and after that, I'd be happy to adjust my rating. The rest are minor issues. Like I mentioned, save for page 8, the paper is well-written and focused."}