{"title": "Review", "review": "The paper proposes to use a differentiable drawing environment to synthesize images and provides information about some initial experiments. \n\nNot yet great about this paper: \n - the paper feels premature: There is a nice idea, but restricting the drawing environment to be \n - Some of the choices in the paper are a bit surprising, e.g. the lines in the drawing method are restricted to be at most 16 points long. If you look at real drawing data (e.g. the quickdraw dataset: https://quickdraw.withgoogle.com/data) you will find that users draw much longer lines typically. \nEDIT: the new version of the paper is much better but still feels like a bit incomplete. I personally would prefer a more complete evaluation and discussion of the proposed method. \n - the entire evaluation of this paper is purely qualitative (and that is not quite very convincing either). I feel it would be important for this paper to add some quantitative measure of quality. E.g. train an MNIST recognizer synthesized data and compare that to a recognizer trained on the original MNIST data. \n - a proper discussion of how the proposed environment is different from the environment proposed by Ganin et al (Deepmind's SPIRAL) \n\nMinor comments: \n - abstract: why is it like \"dreaming\" -> I do agree with the rest of that statement, but I don't see the connection to dreaming\n - abstract: \"upper agent\" -> is entirely unclear here. \n - abstract: the footnote at the end of the abstract is at a strange location\n - introduction: and could thus -> and can thus \n - introduction: second paragraph - it would be good to add some citations to this paragraph. \n - resulted image-> resulting image\n - the sentence: \"We can generate....data is cheap\" - is quite unclear to me at this time. Most of it becomes clearer later in the paper - but I feel it would be good to put this into proper context here (or not mention it)\n - we obtained -> we obtain\n - called a generator -> call a generator \n - the entire last paragraph on the first page is completely unclear to me when reading it here. \n - equations 1, 2: it's unclear whether coordinates are absolute or relative coordinates. \n- fig 1: it's very confusing that the generator, that is described first is represented at the right. \n - sec 3.2 - first line: wrong figure reference - you refer to fig 2 - but probably mean fig 1\n - page 3 bottom: by appending the encoded color and radius data we have a feature with shape 64x64xn -> I don't quite see how this is true. The image was 64x64 -> and I don't quite understand why you have a color/radius for each pixel. \n - sec 3.3 - it seem sthat there is a partial sentence missing \n - sec 3.4 - is it relevant to the rest of the paper that the web application exists (and how it was implemented). \n - fig 2 / fig 3: these figures are very hard to read. Maybe inverting the images would help. Also fig 3 has very little value.  ", "rating": "6: Marginally above acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}