{"experience_assessment": "I have read many papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #4", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper considers the problem of embedding graphs into continuous spaces.  The emphasis is on determining the correct dimension and curvature to minimize distortion or a threshold loss of the embedding.\n\nPros:\nThe problem is clearly stated and easy to understand.\nThe limitations of the three local curvatures are shown empirically and theoretically\n\nCons:\nExperiments seem inconclusive, with no discussion of the results\nProposed global curvature characterizes the optimal embedding parameters but not a different, efficiently calculable discrete curvature to approximate them\nAnalysis of particular graph families doesn’t necessarily inform what to expect from embedding large graph data\n\nOverall, I lean towards rejecting this paper.  The problem does seem an important one, but it seems the main contribution of this paper is comparing the local curvatures against an oracle for determining optimal curvature in embedding space, without putting forward an alternative method.\n\nQuestions:\nWhy is it reasonable to take these curvature metrics and use them directly as the curvature of the ambient space at all?  Especially given that Ollivier curvature belongs to a small interval and Forman curvature is always negative.\n\nDoes any of the graph family analysis carry over to more general graphs?  For example, assuming some priors about the appearance of these families as subgraphs, or the observed features of real networks in [1]?\n\n[1] J. Leskovec, D. Chakrabarti, J. Kleinberg, C. Faloutsos, and Z. Gharamani. Kronecker graphs: an approach to modeling networks. arXiv:0812.4905v1, 2008."}