{"title": "Clearly written but the overall quality is not high enough.", "review": "This paper proposes a new formulation of hierarchical clustering for graphs.\n\nQuality:\nThe proposed formulation has not been analyzed in detail and its advantage is not clear compared to existing approaches.\nIn addition, there are some existing measures for hierarchical clustering, for example, the dendrogram purity[1].\nIt would be interesting to analyze the relationship between the proposed method and such existing measures. \n[1] Heller, K. A. and Ghahramani, Z.: Bayesian Hierarchical Clustering, ICML2005\n\nClarity:\nThis paper is clearly written and easy to read.\nThe proposed criteria is carefully derived and well explained.\nI feel that the title of the paper is not appropriate as it says the paper is about graph representation learning while a graph (representation) is already given as an input in the setting discussed in this paper. \"Learning hierarchical representation ...\" would be better.\n\nOriginality:\nThe originality is not high as most of theoretical discussion is based on the existing work and the resulting hierarchical clustering algorithm is a straightforward extension of the average linkage method.\nOf course, it is quite interesting if a minor change makes a big difference in clustering performance (theoretically and/or empirically), but such result is not given.\n\nSignificance:\nSignificance of the contribution is not high as the advantage of the proposed formulation is not clear.\nOne of interesting questions is: how about higher order relationships between nodes?\nThe proposed method takes up to second order relationships between nodes, that is, edges into account.\nSince the proposed formulation can naturally include higher order relationships, it would be interesting to analyze such relationships in hierarchical clustering.\n\nPros:\n- The paper is clearly written.\n- The proposed formulation of hierarchical clustering is interesting.\nCons:\n- The advantage of the proposed formulation is not presented.\n- Experiments are not thorough.", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}