{"title": "just seem interesting", "review": "The paper presents an improvement on the previous work by [Neyshabur et el, ICLR 2018].\nMore precisely, an emprical generalization bound is provided by using PAC-Bayesian empirical \nbounds. To obtain the claimed improvement over the works [Barlett et al, NIPS 2017] and \n[Neyshabur et el, ICLR 2018], the authors have paid attention carefully (by putting some \nconditions) on the change of the layers (layer and interlayer cushion) as well as the activation \ncontraction. It is also worth noting that the paper is using a differrent loss function comparing \nto [Neyshabur et el, ICLR 2018], which the author called Optimal Margin Distribution Loss.\nAlthough the results seem interesting, the analysis is not convincible for me.\nA plus point is that the paper presents interesting numerical experiments showing the promising of the approach.\n\nMajor comments:\n1) The statement of the Theorem 1 is not clear: \nis it just under the assumptions of the lemmas\nor is it under all definitions and lemmas?\n2) The proof of Theorem 1 is not clear:\n how do you get the inequality (5)?\nhow do you get an upper bound on the KL divergence?\n This is not trivial for me!\n3) What is \\rho in Theorem 1 and in Definition 2?\n4) Your remark after Theorem 1 is not clear for me.\n  you claim that the product is (3) is large, what if we restrict all the spectral norms equal to 1?\n a simple counter example would fit better the explanation here, I guest.\n\nMinor comments:\n1) The Lemma 1 and 2 are almost the same to Lemma 1 and 2 in [Neyshabur et el, ICLR 2018]\nwithout precisely citations. I wonder how do you obtain your Lemma 1?\n2) page3, after formula (1), your loss will first DECREASING, not \"increasing\".\nCheck the sentence \"Fig. 1 shows, equation 1 will produce a linear loss increasing progressively with the margin distance....\"\n", "rating": "5: Marginally below acceptance threshold", "confidence": "4: The reviewer is confident but not absolutely certain that the evaluation is correct"}