{"experience_assessment": "I have published one or two papers in this area.", "rating": "3: Weak Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1245", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper proposes to learn top-k attacks, instead of commonly used top-1, where top-k predicted labels of an adversarial example are k (randomly) selected and ordered labels (the ground-truth label is excluded). The authors propose two attack methods for this problem: (i) extend CW attack (baseline)  (ii) use KL divergence between a manually designed logit layer adversarial distribution and the logit layer output of the current sample as the new loss replacing the loss in the objective function of the extended CW attack. They evaluate their proposed approach on RESNET-50 and DENSENET-121 on a subset of ImageNet under different k and targets.\n\nMain weaknesses of the paper:\n- Motivation is not clear. The author claims that the problem to be novel but does not give convincing arguments why do we want to study ordered top-k attacks.\n- Evaluation is far from being comprehensive. I’d like to see some results on other datasets.\n\nOther issues:\n- Using cosine distance between glove embeddings of two label names to estimate semantic similarity between the two classes (i.e. s(a,b) in Eq(9)) does not seem to be appropriate since there is no empirical evidence that even though two label names are semantically similar, this does not mean that their visual images are similar.\n- I’d like to see more intuitions from the authors on why AD performs better than the extended CW-attack.\n- l2 energy is not explicitly defined.\n\nThings to Improve that did not affect the score:\nThe paper has lots of typos/grammar errors. To just name a few:\n- 2nd to last line “by large margin” should be “by a large margin”\n- The abbreviation of ASR is directly used without being explicitly defined.\n- 3rd to last line on page 2 “diffoculty” should be “difficult”.\n"}