{"rating": "3: Weak Reject", "experience_assessment": "I have read many papers in this area.", "review_assessment:_checking_correctness_of_derivations_and_theory": "I did not assess the derivations or theory.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #3", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review": "The authors present a novel intrinsic reward/curiosity metric based on what they call Bayesian surprise. Specifically, the goal is that this approach should provide robust performance in sparse reward environments (as curiosity/exploration-based approaches often do) and in environments with stochasticity (which curiosity/exploration-based approaches can struggle with). The paper presents this perception-driven curiosity model, which is based on the difference between the predicted next state and the current state, and presents a series of experiments. The experiments compare the performance of agents trained on the intrinsic reward and some variations across games with both dense and sparse extrinsic reward. \n\nI like the approach and the paper is well-written. However, I find that the results of the experiments do not fully support the claims made in the paper. The authors point out themselves that River Raid, Pitfall, and Montezuma’s Revenge are all games with sparse extrinsic reward, where one would expect that the author’s intrinsic reward to have a clear benefit. However, only one game (Montezuma’s Revenge) sees any improvement, and that is a fairly minor one. Further, it is well understood from prior work that Montezuma’s Revenge benefits from exploration/intrinsic reward/curiosity. I would have expected at least some discussion of why these results did not match the expectations the authors had raised earlier in the paper. But ideally I’d like to see better results than this. Thus I lean towards a weak reject. \n\nBeyond discussing the incongruous results, the paper could also stand to contextualize or walk back some of the statements. For example in section 5.2 “We showed that our model explores more effectively than our baseline in cases where extrinsic rewards are sparse”. As I discussed above, this does not seem to be the case. \n\nThe paper would also benefit from additional baselines to better contextualize the results, how exactly this particular notion of visual novelty/perceptual-driven curiosity and bayesian surprise compares to others. \n"}