{"experience_assessment": "I have published one or two papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper thoroughly.", "review_assessment:_checking_correctness_of_experiments": "I carefully checked the experiments.", "title": "Official Blind Review #2", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "The paper proposes a new formulation for curiosity based on the expected reconstruction error of the next frame embedding, given the current frame + the next frame + the taken action. The experimental results are presented on 8 Atari games, including hard-exploration ones (Montezuma’s Revenge, Pitfall, and Private Eye). The baseline is chosen to be ICM.\n\nI am inclined to reject this paper. The key reason is that the experimental results are rather weak. From Table 1, ICM is better than the proposed method in 4 games, and the propose method is better than ICM in 4 games. It seems those methods perform on-par. Figure 2 also shows all methods perform rather similarly.\n\nDetailed arguments:\n[major concerns]\n* The experimental results currently do not convey the value of the method.\n* The choice of the baselines is not fully justified. For example, the \"Exploration by Random Network Distillation\" (RND) paper (Burda et al) is mentioned but not compared to. This is confusing because the point of RND was that it's not hurt by stochasticity -- which also seems to be one of the problems addressed in this paper. Another relevant baseline would be \"Count-Based Exploration with Neural Density Models\" (Ostrovski et al) -- it is known to show strong results on Atari and it also addresses exploration. Finally, \"Episodic Curiosity through Reachability\" (Savinov et al) also deals with environment stochasticity in a different manner -- by using episodic memory -- and shows good results in stochastic environments with added randomized TV.\n* Why are only 4 out of 8 datasets shown in Table 2?\n* The issue of the stochasticity is left rather un-analysed. What if the source of stochasticity is not sticky actions but rather some visual distractor? There are many such distractors explored in the prior work: random noise in the ICM paper, randomized TV in RND and Episodic Curiosity papers. The latter even considers different rules for switching the image on the TV: random image for any action or random image for one dedicated \"switch\" action.\n[minor concerns]\n* It is not fully clear what \"Perception-driven approach to curiosity\" section means.\n* It seems rather strange that both the embedding of the current and the next frames are given as the input to the encoder. Why would the method profit from the current frame embedding, why not give only the next frame as the input if in the end the comparison is done to the embedding of the next frame?\n\nPaper improvement suggestions:\n1) Stronger experimental results would help to convey the value of the proposed method.\n2) Adding stronger baselines would help to evaluate the impact."}