{"title": "Work uses Generative Adversarial Networks (GAN) paradigm to achieve Steganography/Steganalysis but  fails to dig deeper into obtained results to explain suitability of GAN for Steganography/Steganalysis or the types of embedded images. In need of serious rewriting.", "review": "Paper uses Generative Adversarial Networks' (GAN) paradigm to achieve Steganography/Steganalysis but  fails to dig deeper into obtained results to explain suitability of GAN for Steganography/Steganalysis or the types of embedded images (textures, patterns, complexity etc.) most suitable.\n\n- Figure 3/Page 7: Providing the residual differences between covers and stego-images would be appreciated. \n- Define Acronyms before using them: ISS-GAN for example (Integrated Steganography-Steganalysis (ISS)).\n- General concepts like State of the Art should not in our humble opinion be used through acronyms (SOTA).\n - Page 3/Paragraph (Deep Learning based Steganography):  Clean your references:\n     - Paper (Volkhonskiy et al.,2017) , Paper (Dong et al., 2018), Paper (Shi et al.,2017).\n\nIn need of a serious rewriting:\n - No need for 1. Introduction's first paragraph. Good intention for a simplistic definition scenario rendered redundant by following paragraph.\n - Multiple needless repetitions especially for definitions such as those of Steganography/Steganalysis (Paragraphs 4 & 5, page 4).\n - Ill-articulated phrases:\n    - Introduction: - 'Steganalysis as the counterpart, is an attack to the steganography'.\n                               - 'Since their birth, steganography and steganalysis promote the progress of each other.' Just say complementary processes.\n    - Paragraph 3/Page3: 'Their model is suitable for embedding secret with the random key.'.\n\nIn need of more proofing (Phrasing errors): \n  - Abstract: 'Its application on data generation' instead of 'It’s application on data generation'.\n  - Introduction: 'Imagine that you are' instead of 'Imaging that you are'.\n  - Multiple unjustified uses of  'the':\n       - we propose 'the' novel framework.\n       - You are on 'the' trip to New Orleans\n  ", "rating": "5: Marginally below acceptance threshold", "confidence": "5: The reviewer is absolutely certain that the evaluation is correct and very familiar with the relevant literature"}