{"title": "DEEP RECURRENT GAUSSIAN PROCESS WITH VARIATIONAL SPARSE SPECTRUM APPROXIMATION", "review": "Overall Score: 7/10.\nConfidence Score: 7/10.\n\nDetailed Comments: This paper introduces various Deep Recurrent Gaussian Process (DRGP) models based on the Sparse Spectrum Gaussian Process (SSGP) models and the Variational Sparse Spectrum Gaussian Process (VSSGP) models. This is a good paper and proposed models are very sound so I recommend for acceptance although as main weakness I can say that is very technical so it can be difficult to follow. Adding more intuitive ideas, motivation and maybe a figure for each step would be a solution. Apart from that it is a really good paper, congratulations.\n\nRelated to: RNN models and Sparse Nystrom approximation.\n\nStrengths: Models are very sound, solutions are solid, the proposed methodology is correct and the empirical results and experiments are valid and properly done.\n\nWeaknesses: It is too difficult to follow and it is written in an extreme technical way. More intuitions and a proper motivation both in the abstract and introduction may be put in order to make the paper easier to read and, hence, more used by researchers and data scientists.\n\nDoes this submission add value to the ICLR community? : Yes it does, the experiments show the efficiency of the proposed methods in some scenarios and are valid methodologies.\n\nQuality:\nIs this submission technically sound?: Yes it is.\nAre claims well supported by theoretical analysis or experimental results?: Experimental results prove empirically the methods and appendixes show the analysis performed in a clear and elegant way.\nIs this a complete piece of work or work in progress?: Complete piece of work.\nAre the authors careful and honest about evaluating both the strengths and weaknesses of their work?: Yes, and I would enfatize that I have liked that some experiments are won by other methods such as GP-LSTM, they are very honest.\n\nClarity:\nIs the submission clearly written?: Yes, but it is difficult for newcomers due to the reasons that I have stated before.\nIs it well organized?: Yes it is.\nDoes it adequately inform the reader?: Yes it is.\n\nOriginality:\nAre the tasks or methods new?: Yes, they are sound.\nIs the work a novel combination of well-known techniques?: Yes it is.\nIs it clear how this work differs from previous contributions?: Yes.\nIs related work adequately cited?: Yes, being a strength of the paper.\n\nSignificance:\nAre the results important?: I would argue that they are and are a clear alternative to consider in order to solve these problems.\nAre others likely to use the ideas or build on them?: If the paper is written in a more friendly way, yes.\nDoes the submission address a difficult task in a better way than previous work?: Yes I think.\nDoes it advance the state of the art in a demonstrable way?: Yes, empirically.\n\nArguments for acceptance: Models are very sound, solutions are solid, the proposed methodology is correct and the empirical results and experiments are valid and properly done\n\nArguments against acceptance: Clarity of the paper.\n\nMinor issues and typos:\n-> (V)SS not defined before being used.\n-> Abstract should be rewritten adding a motivation and focusing more on the problems being solved and less in the details of the solutions.\n-> Recurrent indexes that go backwards (i) of Eq. 1. should be explained why are going backwards before being used like that. Newcomers may be confused.\n-> Section 2 writing style lacks a bit of cohesion, relating the paragraphs may be a solution.\n-> Q is not defined in section 3.1 paragraph 1.\n-> A valid covariance function must produce a PSD matrix, put that in section 3.1. \n-> I do not see how U marginalizes in Eq. 7, kind of confused about that, I think that it should be p(y|X,U).\n-> Section 3.4 statistics should be explained.\n\nReading thread and authors response rebuttal decision:\n=================================================\n\nI consider that the authors have perfomed a good rebuttal and reading the other messages and the authors response I also consider that my issue with clarity is solved. Hence, I upgrade my score to 7 and recommend the paper for publication.", "rating": "7: Good paper, accept", "confidence": "2: The reviewer is willing to defend the evaluation, but it is quite likely that the reviewer did not understand central parts of the paper"}