{"experience_assessment": "I have read many papers in this area.", "rating": "1: Reject", "review_assessment:_thoroughness_in_paper_reading": "I read the paper at least twice and used my best judgement in assessing the paper.", "review_assessment:_checking_correctness_of_experiments": "I assessed the sensibility of the experiments.", "title": "Official Blind Review #1", "review_assessment:_checking_correctness_of_derivations_and_theory": "I assessed the sensibility of the derivations and theory.", "review": "This paper claims to analyze the global convergence of large-scale neural networks (NNs). Their analysis relies on the idea of “canonical space”, which upon further reading, is nothing more than multi-dimensional Fourier analysis.\n\nWhile the analysis of NNs is an extremely important problem, it is not clear what results are actually presented here nor how their results relate to other theoretical analyses of NNs. The introduction of Fourier analysis as a new mathematical tool, and devotion of a whole page to this “canonical space model” is almost laughable. Furthermore, this statement in the introduction is not only incorrect but it is absurd. To make such a claim would require a significant amount of background and review of literature to even place these statements in context.\n        “No matter what structures are used in a large scale neural network, either feed-forward or recurrent, either convolutional or fully-connected, either ReLU or sigmoid, the simple first-order methods such as stochastic gradient descent and its variants can consistently converge to a global minimum of zero loss no matter what type of labelled training samples are used.” \n\nSpecific comments:\n“to derive theoretical proofs under a very general setting without any unrealistic assumption on the model structure and data distribution.” - how is this possible?\n“A new mathematical tool called canonical space” = Fourier analysis (??) this is not a new mathematical tool\nSection 2 = a standard formulation of neural networks, followed by undergraduate level Fourier analysis.\nIn 2.1. What is a “well structured” network? Unclear from the notation and definitions.\n"}